var title=new Array()
var kasi=new Array()  //メイン歌詞
var kasi_n=new Array() //歌詞ひらがな
var kasi_s=new Array()  //歌詞文字秒数
var kasi_demo=new Array()  //オートモード用にアルファベットを保管する配列
var kasi_now=0  //現在の歌詞文字数
var kasi_s_now=0
var kasi_count=0  //現在の歌詞漢字表示行
var kasi_s_count=0
var kasi_n_count=0  //現在の歌詞ひらがな表示行
var kasi_emotime=1 //エモーショナルポイントの猶予秒
var emo_ten=0  //歌詞文字秒数評価点
var combo_ten=0 //現在のCOMBO数
var max_combo=0  //MAXCOMBO数
var playing=""
var startbutton=""
var playagain=new Array()  //playagain用の曲情報配列
var mozi_time_now
var mozi_time_num2
var mozi_time_now2
var test=""
var testvolume=1
var musicstarter="no"
var test2


title=[
  "sabisiiookami",
  "shiningstar",
  "syariraimoneasy",
  //"syariraimonnormal",
  //"syariraimonhard",
  "suzumeirocondensare",
  "imaginativejourney",
  "quiet",
  "sorairoradio",
  "setunacycle",
  "beatinangel"
]


//beatinangel['2']=[2,'(前奏)',16.981,0.3]
//タイトル[開始秒（整数）]=[開始秒,表示メッセージ,表示時間,判定秒数,（スキップ先秒）,（スキップ表示時間）]



var sabisiiookami=new Array()
sabisiiookami['2']=[2,'(前奏)',11.541,0.3]
sabisiiookami['13']=[13.541,'まんげつの夜になると',6.431,0.3]
sabisiiookami['20']=[19.972,'どこからか聞こえる',6.392,0.3]
sabisiiookami['26']=[26.364,'こずれのむこう　森のおくから',6.430,0.3]
sabisiiookami['33']=[32.794,'とおぼえが聞こえる',6.358,0.3]
sabisiiookami['39']=[39.152,'わおーん',3.244,0.3]
sabisiiookami['42']=[42.396,'わおーん ',2.40,0.3]
sabisiiookami['45']=[44.796,'オオカミが来るぞ',4.000,0.3]
sabisiiookami['49']=[48.796,'キミも　こぶたも　あかずきんも',6.376,0.3]
sabisiiookami['55']=[55.172,'はやくみんなにげてよ　ねえ',6.416,0.3]
sabisiiookami['61']=[61.588,'むねのいたみがきえないから',5.583,0.3]
sabisiiookami['67']=[67.171,'ねぇ　だれかボクのこと信じて',8.15,0.3]
sabisiiookami['75']=[75.321,'end']

var sabisiiookami_n=new Array()
var sabisiiookami_n={
  "1":"",
  "13":"まんけつのよるになると",
  "20":"とこからかきこえる",
  "26":"こすれのむこうもりのおくから",
  "33":"とおほえかきこえる",
  "39":"わおーん",
  "42":"わおーん",
  "45":"おおかみかくるそ",
  "49":"きみもこふたもあかすきんも",
  "55":"はやくみんなにけてよねえ",
  "61":"むねのいたみかきえないから",
  "67":"ねえたれかほくのことしんして",
  "75":"end"
  }

var sabisiiookami_s=new Array()
var sabisiiookami_s=[
13.841,14.264,14.698,15.095,15.496,15.893,16.297,16.684,17.106,17.484,17.763,
20.272,20.695,21.109,21.498,21.900,22.299,22.690,23.084,23.496,
26.664,27.074,27.485,27.881,28.286,28.679,28.944,29.862,30.263,30.676,31.086,31.476,31.879,32.142,
33.094,33.503,33.909,34.295,34.721,35.110,35.507,35.895,36.313,
39.452,40.259,41.067,42.257,
42.696,43.487,43.883,44.694,
45.096,45.494,45.901,46.297,46.695,47.105,47.476,47.872,
49.093,49.502,49.897,50.292,50.706,50.960,51.338,51.860,52.281,52.694,53.091,53.358,53.752,
55.472,55.734,55.891,56.286,56.549,56.705,56.965,57.472,57.893,58.188,58.606,58.860,
61.888,62.287,62.706,63.107,63.514,63.765,64.143,64.665,65.074,65.478,65.882,66.143,66.515,
67.471,67.77,68.309,68.575,68.718,69.105,69.352,69.507,69.767,70.284,70.54,70.697,70.963,71.321]

var sabisiiookami_demo=new Array()
sabisiiookami_demo=[
'm','w','k','t','n','y','r','n','n','r','t',
't','k','k','r','k','k','k','a','r',
'k','s','r','n','m','k','a','m','r','n','a','k','k','r',
't','a','h','a','k','k','k','a','r',
'w','a','w','w',
'w','a','w','w',
'a','a','k','m','k','k','r','s',
'k','m','m','k','h','t','m','a','k','s','k','w','m',
'h','y','k','m','w','n','n','k','t','y','n','a',
'm','n','n','a','t','m','k','k','a','n','a','k','r',
'n','a','t','r','k','h','k','n','k','t','s','w','s','t'
]

var sabisiiookamifull=new Array()
sabisiiookamifull['2']=[2,'(前奏)',11.541,0.3]
sabisiiookamifull['13']=[13.541,'まんげつの夜になると',6.431,0.3]
sabisiiookamifull['20']=[19.972,'どこからか聞こえる',6.392,0.3]
sabisiiookamifull['26']=[26.364,'こずれのむこう　森のおくから',6.430,0.3]
sabisiiookamifull['33']=[32.794,'とおぼえが聞こえる',6.358,0.3]
sabisiiookamifull['39']=[39.152,'わおーん',3.244,0.3]
sabisiiookamifull['42']=[42.396,'わおーん ',2.40,0.3]
sabisiiookamifull['45']=[44.796,'オオカミが来るぞ',4.000,0.3]
sabisiiookamifull['49']=[48.796,'キミも　こぶたも　あかずきんも',6.376,0.3]
sabisiiookamifull['55']=[55.172,'はやくみんなにげてよ　ねえ',6.416,0.3]
sabisiiookamifull['61']=[61.588,'むねのいたみがきえないから',5.583,0.3]
//sabisiiookamifull['67']=[67.171,'ねぇ　だれかボクのこと信じて',32.819,0.3]
sabisiiookamifull['67']=[67.171,'ねぇ　だれかボクのこと信じて',6.051,0.3]
//sabisiiookamifull['75']=[75.321,'(間奏)',24.669,0.3]
sabisiiookamifull['73']=[73.222,'♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪',26.768,0.3]
//sabisiiookamifull['73']=[75.222,'♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪',24.768,0.3]
sabisiiookamifull['100']=[99.990,'わおーん',3.215,0.3]
sabisiiookamifull['103']=[103.205,'わおーん',2.389,0.3]
sabisiiookamifull['105']=[105.594,'オオカミが来たぞ',3.996,0.3]
sabisiiookamifull['109']=[109.590,'ボクも　こやぎも　おばあちゃんも',6.399,0.3]
sabisiiookamifull['116']=[115.989,'はやくみんなにげなくちゃ',6.378,0.3]
sabisiiookamifull['122']=[122.367,'むねのいたみがきえないから',5.368,0.3]
sabisiiookamifull['128']=[127.735,'ねえ　みんなボクのことゆるして',7.466,0.3]
sabisiiookamifull['135']=[135.201,'ゆうひがおちて',3.203,0.3]
sabisiiookamifull['138']=[138.404,'月がのぼって',2.811,0.3]
sabisiiookamifull['141']=[141.215,'もうすぐオオカミが',3.179,0.3]
sabisiiookamifull['144']=[144.394,'もうすぐオオカミが・・',4.396,0.3]
sabisiiookamifull['149']=[148.790,'胸のつかえが　おちないから',6.378,0.3]
sabisiiookamifull['155']=[155.168,'だれかそのナイフで　さあ',6.430,0.3]
sabisiiookamifull['161']=[161.598,'いしのおもみでしずむ前に　ねえ',6.439,0.3]
sabisiiookamifull['168']=[168.037,'だれかボクのこと',3.157,0.3]
sabisiiookamifull['171']=[171.194,'だれかボクのこと・・',3.185,0.3]
sabisiiookamifull['174']=[174.379,'キミも　こぶたも　あかずきんも',12.813,0.3]
sabisiiookamifull['187']=[187.192,'ボクも　こやぎも　おばあちゃんも',9.018,0.3]
sabisiiookamifull['196']=[196.21,'end']

var sabisiiookamifull_n=new Array()
var sabisiiookamifull_n={
  "1":"",
  "13":"まんけつのよるになると",
  "20":"とこからかきこえる",
  "26":"こすれのむこうもりのおくから",
  "33":"とおほえかきこえる",
  "39":"わおーん",
  "42":"わおーん",
  "45":"おおかみかくるそ",
  "49":"きみもこふたもあかすきんも",
  "55":"はやくみんなにけてよねえ",
  "61":"むねのいたみかきえないから",
  "67":"ねえたれかほくのことしんして",
  "73":"♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪♪",
  "100":"わおーん",
  "103":"わおーん",
  "105":"おおかみかきたそ",
  "109":"ほくもこやきもおはあちやんも",
  "116":"はやくみんなにけなくちや",
  "122":"むねのいたみかきえないから",
  "128":"ねえみんなほくのことゆるして",
  "135":"ゆうひかおちて",
  "138":"つきかのほつて",
  "141":"もうすくおおかみか",
  "144":"もうすくおおかみか",
  "149":"むねのつかえかおちないから",
  "155":"たれかそのないふてさあ",
  "161":"いしのおもみてしすむまえにねえ",
  "168":"たれかほくのこと",
  "171":"たれかほくのこと",
  "174":"きみもこふたもあかすきんも",
  "187":"ほくもこやきもおはあちやんも",
  "196":"end"
  }

var sabisiiookamifull_s=new Array()
var sabisiiookamifull_s=[
13.841,14.264,14.698,15.095,15.496,15.893,16.297,16.684,17.106,17.484,17.763,
20.272,20.695,21.109,21.498,21.900,22.299,22.690,23.084,23.496,
26.664,27.074,27.485,27.881,28.286,28.679,28.944,29.862,30.263,30.676,31.086,31.476,31.879,32.142,
33.094,33.503,33.909,34.295,34.721,35.110,35.507,35.895,36.313,
39.452,40.259,41.067,42.257,
42.696,43.487,43.883,44.694,
45.096,45.494,45.901,46.297,46.695,47.105,47.476,47.872,
49.093,49.502,49.897,50.292,50.706,50.960,51.338,51.860,52.281,52.694,53.091,53.358,53.752,
55.472,55.734,55.891,56.286,56.549,56.705,56.965,57.472,57.893,58.188,58.606,58.860,
61.888,62.287,62.706,63.107,63.514,63.765,64.143,64.665,65.074,65.478,65.882,66.143,66.515,
67.471,67.77,68.309,68.575,68.718,69.105,69.352,69.507,69.767,70.284,70.54,70.697,70.963,71.321,
75.522,77.14,78.764,80.321,81.943,83.545,85.13,85.918,86.716,88.32,89.932,91.537,93.15,94.735,96.354,97.941,99.489,
100.290,101.123,101.899,103.082,
103.505,104.297,104.699,105.487,
105.894,106.301,106.719,107.107,107.511,107.895,108.314,108.685,
109.890,110.304,110.714,111.088,111.495,111.718,112.145,112.682,113.108,113.491,113.85,113.981,114.214,114.581,
116.289,116.560,116.705,117.092,117.349,117.492,117.775,118.287,118.700,118.962,119.386,119.535,
122.667,123.082,123.526,123.912,124.308,124.53,124.955,125.479,125.9,126.292,126.724,126.963,127.362,
128.35,128.534,129.131,129.372,129.512,129.9,130.139,130.285,130.569,131.105,131.338,131.502,131.808,132.186,
135.501,135.915,136.332,136.703,137.116,137.392,137.752,
138.704,139.115,139.513,139.942,140.343,140.6,140.955,
141.515,141.781,141.927,142.193,142.579,142.963,143.122,143.372,143.531,
144.694,144.968,145.122,145.403,145.811,146.171,146.327,146.589,146.767,
149.090,149.521,149.940,150.303,150.691,150.944,151.367,151.909,152.33,152.698,153.126,153.358,153.779,
155.468,155.744,155.892,156.313,156.562,156.72,156.998,157.534,157.937,158.19,158.718,
161.898,162.334,162.726,163.116,163.507,163.749,164.17,164.719,165.124,165.501,165.937,166.185,166.605,167.552,167.762,
168.337,168.567,168.73,169.114,169.361,169.506,169.804,170.342,
171.494,171.758,171.895,172.31,172.583,172.719,172.985,173.918,
174.679,175.107,175.509,175.917,176.291,176.546,176.964,177.493,177.896,178.286,178.707,178.982,179.375,
187.492,187.908,188.304,188.719,189.101,189.341,189.761,190.284,190.697,191.094,191.462,191.601,191.835,192.21]

var sabisiiookamifull_demo=new Array()
sabisiiookamifull_demo=[
'm','w','k','t','n','y','r','n','n','r','t',
't','k','k','r','k','k','k','a','r',
'k','s','r','n','m','k','a','m','r','n','a','k','k','r',
't','a','h','a','k','k','k','a','r',
'w','a','w','w',
'w','a','w','w',
'a','a','k','m','k','k','r','s',
'k','m','m','k','h','t','m','a','k','s','k','w','m',
'h','y','k','m','w','n','n','k','t','y','n','a',
'm','n','n','a','t','m','k','k','a','n','a','k','r',
'n','a','t','r','k','h','k','n','k','t','s','w','s','t',
'♪','♪','♪','♪','♪','♪','♪','♪','♪','♪','♪','♪','♪','♪','♪','♪','♪',
'w','a','w','w',
'w','a','w','w',
'a','a','k','m','k','k','t','s',
'h','k','m','k','y','k','m','a','h','a','t','y','w','m',
'h','y','k','m','w','n','n','k','n','k','t','y',
'm','n','n','a','t','m','k','k','a','n','a','k','r',
'n','a','m','w','n','h','k','n','k','t','y','r','s','t',
'y','a','h','k','a','t','t',
't','k','k','n','h','t','t',
'm','a','s','k','a','a','k','m','k',
'm','a','s','k','a','a','k','m','k',
'm','n','n','t','k','a','k','a','t','n','a','k','r',
't','r','k','s','n','n','a','h','t','s','a',
'a','s','n','a','m','m','t','s','s','m','m','a','n','n','a',
't','r','k','h','k','n','k','t',
't','r','k','h','k','n','k','t',
'k','m','m','k','h','t','m','a','k','s','k','w','m',
'h','k','m','k','y','k','m','a','h','a','t','y','w','m'
]

var syariraimonhard=new Array()
syariraimonhard['2']=[2,'(前奏)',13.248,300]
syariraimonhard['15']=[15.248,'たらったったったすったんたん！ ',1.647,300]
syariraimonhard['17']=[16.894,'笑って踊って行き着く先は座敷牢 ',4.994,300]
syariraimonhard['22']=[21.888,'夢も果ててかなしいな生き地獄 ',5.364,300]
syariraimonhard['27']=[27.252,'ははは ',1.252,300]
syariraimonhard['28']=[28.504,'たらったったったすったんたん！ ',1.665,300]
syariraimonhard['30']=[30.169,'もっと楽しく浮世を一緒にあゆみたい ',4.961,300]
syariraimonhard['35']=[35.13,'贅沢ものは音も無く死ぬがいい ',5.342,300]
syariraimonhard['40']=[40.472,'ほとけさま！ ',4.581,300]
syariraimonhard['45']=[45.053,'夏の暑さがみせる ',4.994,300]
syariraimonhard['50']=[50.048,'蜃気楼に僕らの人影ふたつ ',8.22,300]
syariraimonhard['58']=[58.268,'楽しいね うれしいな ',6.667,300]
syariraimonhard['65']=[64.934,'ここに僕らは生きているんだ ',12.76,300]
syariraimonhard['77']=[77.695,'葉　歌　穂　舎　野 ',12.031,300]
syariraimonhard['90']=[89.726,'たたんたたんたん　たたんたたんたん　たんたん',2.085,300]
syariraimonhard['92']=[91.811,'たたんたたんたん　たたんたたんたん　たんたん',2.059,300]
syariraimonhard['94']=[93.869,'だだんだだんだん　だだんだだんだん　だんだん',2.069,300]
syariraimonhard['96']=[95.938,'だだんだだんだん　だだんだだんだん　だんだん',2.085,300]
syariraimonhard['98']=[98.023,'てていてていてい　てていてていてい　ていてい',2.051,300]
syariraimonhard['100']=[100.074,'てていてていてい　てていてていてい　ていてい',2.066,300]
syariraimonhard['102']=[102.14,'へへいへへいへい　へへいへへいへい　へいへい',2.069,300]
syariraimonhard['104']=[104.208,'へへいへへいへい　へへいへへいへい　へいへい',2.061,300]
syariraimonhard['106']=[106.269,'釈迦よ ',13.269,300]
syariraimonhard['119']=[119.538,'ここまできたらすってんてん！ ',1.656,300]
syariraimonhard['121']=[121.194,'ふざけてさけんで行き着く先は仏の死 ',4.934,300]
syariraimonhard['126']=[126.128,'遺骨になって寂しいな修羅の道 ',5.395,300]
syariraimonhard['131']=[131.522,'ははは ',1.201,300]
syariraimonhard['133']=[132.723,'とどのつまりぱっぱらぱー！ ',1.676,300]
syariraimonhard['134']=[134.4,'僕が許し受けたなら恩知らず ',4.947,300]
syariraimonhard['139']=[139.347,'涙が流れるよ つらいよ ',5.548,300]
syariraimonhard['145']=[144.894,'ほとけさま！ ',4.399,300]
syariraimonhard['149']=[149.293,'夏の夜空が見せる',13.271,300]
syariraimonhard['154']=[154.341,'流れる星に僕らの未来が消える ',14.811,300]
syariraimonhard['162']=[162.564,'かなしいね いやだよね ',6.589,300]
syariraimonhard['169']=[169.152,'ずっと僕らは死にたくないよ ',6.686,300]
syariraimonhard['176']=[175.838,'たたんたたんたん　たたんたたんたん　たんたん',2.032,300]
syariraimonhard['178']=[177.871,'たたんたたんたん　たたんたたんたん　たんたん',2.104,300]
syariraimonhard['180']=[179.975,'だだんだだんだん　だだんだだんだん　だんだん',2.066,300]
syariraimonhard['182']=[182.04,'だだんだだんだん　だだんだだんだん　だんだん',2.042,300]
syariraimonhard['184']=[184.083,'てていてていてい　てていてていてい　ていてい',2.067,300]
syariraimonhard['186']=[186.149,'てていてていてい　てていてていてい　ていてい',2.079,300]
syariraimonhard['188']=[188.229,'へへいへへいへい　へへいへへいへい　へいへい',2.067,300]
syariraimonhard['190']=[190.295,'へへいへへいへい　へへいへへいへい　へいへい',34.888,300]
syariraimonhard['223']=[225.183,'一 心 頂 禮　(いっしんちょうらい) ',0.932,300]
syariraimonhard['224']=[226.115,'万 徳 円 満　(まんとくえんまん) ',1.024,300]
syariraimonhard['225']=[227.139,'釈 迦 如 来　(しゃーかーにょらい) ',0.838,300]
syariraimonhard['226']=[227.977,'真 身 舎 利　(しんじんしゃーり) ',0.825,300]
syariraimonhard['227']=[228.802,'本 地 法 身　(ほんぢほっしん) ',0.817,300]
syariraimonhard['228']=[229.619,'法 界 塔 婆　(ほっかいとうば) ',0.822,300]
syariraimonhard['229']=[230.441,'我 等 禮 敬　(がーとうらいきょう) ',0.834,300]
syariraimonhard['230']=[231.275,'為 我 現 身　(いーがーげんしん) ',0.832,300]
syariraimonhard['231']=[232.107,'入 我 我 入　(にゅーがーがーにゅう) ',0.84,300]
syariraimonhard['232']=[232.948,'仏 加 持 故　(ぶつがーじーこ) ',0.805,300]
syariraimonhard['233']=[233.752,'我 証 菩 提　(がーしょうぼーだい) ',0.824,300]
syariraimonhard['234']=[234.577,'以 仏 神 力　(いーぶつじんりき) ',0.822,300]
syariraimonhard['235']=[235.398,'利 益 衆 生　(りーやくしゅーじょう) ',0.789,300]
syariraimonhard['236']=[236.188,'発 菩 提 心　(ほつぼーだいしん) ',0.843,300]
syariraimonhard['237']=[237.031,'修 菩 薩 行　(しゅーぼーさつぎょう) ',0.848,300]
syariraimonhard['238']=[237.878,'同 入 円 寂　(どうにゅうえんじゃく) ',0.828,300]
syariraimonhard['239']=[238.707,'平 等 大 智　(びょうどうだいち) ',1.625,300]
syariraimonhard['240']=[240.332,'今 将 頂 禮　(こんしょうちょうらい) ',4.959,300]
syariraimonhard['242']=[245.292,'一 心 頂 禮　(いっしんちょうらい) ',0.817,300]
syariraimonhard['243']=[246.109,'万 徳 円 満　(まんとくえんまん) ',0.865,300]
syariraimonhard['244']=[246.974,'釈 迦 如 来　(しゃーかーにょらい) ',0.822,300]
syariraimonhard['245']=[247.796,'真 身 舎 利　(しんじんしゃーり) ',0.834,300]
syariraimonhard['246']=[248.629,'本 地 法 身　(ほんぢほっしん) ',0.825,300]
syariraimonhard['247']=[249.454,'法 界 塔 婆　(ほっかいとうば) ',0.859,300]
syariraimonhard['248']=[250.313,'我 等 禮 敬　(がーとうらいきょう) ',0.813,300]
syariraimonhard['249']=[251.125,'為 我 現 身　(いーがーげんしん) ',0.826,300]
syariraimonhard['250']=[251.952,'入 我 我 入　(にゅーがーがーにゅう) ',0.823,300]
syariraimonhard['251']=[252.774,'仏 加 持 故　(ぶつがーじーこ) ',0.814,300]
syariraimonhard['252']=[253.589,'我 証 菩 提　(がーしょうぼーだい) ',0.85,0.39]
syariraimonhard['253']=[254.448,'以 仏 神 力　(いーぶつじんりき) ',0.835,300]
syariraimonhard['254']=[255.283,'利 益 衆 生　(りーやくしゅーじょう) ',0.821,300]
syariraimonhard['255']=[256.104,'発 菩 提 心　(ほつぼーだいしん) ',0.825,300]
syariraimonhard['256']=[256.929,'修 菩 薩 行　(しゅーぼーさつぎょう) ',0.969,300]
syariraimonhard['257']=[257.898,'同 入 円 寂　(どうにゅうえんじゃく) ',0.745,300]
syariraimonhard['258']=[258.643,'平 等 大 智　(びょうどうだいち) ',1.58,300]
syariraimonhard['260']=[260.223,'今 将 頂 禮　(こんしょうちょうらい) ',4.975,300]
syariraimonhard['262']=[265.198,'一 心 頂 禮　(いっしんちょうらい) ',0.824,300]
syariraimonhard['263']=[266.022,'万 徳 円 満　(まんとくえんまん) ',0.823,300]
syariraimonhard['264']=[266.845,'釈 迦 如 来　(しゃーかーにょらい) ',0.859,300]
syariraimonhard['265']=[267.704,'真 身 舎 利　(しんじんしゃーり) ',0.805,300]
syariraimonhard['266']=[268.509,'本 地 法 身　(ほんぢほっしん) ',0.852,300]
syariraimonhard['267']=[269.36,'法 界 塔 婆　(ほっかいとうば) ',0.832,300]
syariraimonhard['268']=[270.192,'我 等 禮 敬　(がーとうらいきょう) ',0.822,300]
syariraimonhard['269']=[271.014,'為 我 現 身　(いーがーげんしん) ',0.815,300]
syariraimonhard['270']=[271.829,'入 我 我 入　(にゅーがーがーにゅう) ',0.824,300]
syariraimonhard['271']=[272.653,'仏 加 持 故　(ぶつがーじーこ) ',0.833,300]
syariraimonhard['272']=[273.486,'我 証 菩 提　(がーしょうぼーだい) ',0.824,300]
syariraimonhard['273']=[274.311,'以 仏 神 力　(いーぶつじんりき) ',0.825,300]
syariraimonhard['274']=[275.135,'利 益 衆 生　(りーやくしゅーじょう) ',0.822,300]
syariraimonhard['275']=[275.957,'発 菩 提 心　(ほつぼーだいしん) ',0.829,300]
syariraimonhard['276']=[276.787,'修 菩 薩 行　(しゅーぼーさつぎょう) ',0.799,300]
syariraimonhard['277']=[277.586,'同 入 円 寂　(どうにゅうえんじゃく) ',0.86,300]
syariraimonhard['278']=[278.445,'平 等 大 智　(びょうどうだいち) ',1.629,300]
syariraimonhard['280']=[280.074,'今 将 頂 禮　(こんしょうちょうらい) ',11.575,300]
syariraimonhard['289']=[291.649,'一 心 頂 禮　(いっしんちょうらい) ',0.857,300]
syariraimonhard['290']=[292.506,'万 徳 円 満　(まんとくえんまん) ',0.869,300]
syariraimonhard['291']=[293.375,'釈 迦 如 来　(しゃーかーにょらい) ',0.795,300]
syariraimonhard['292']=[294.17,'真 身 舎 利　(しんじんしゃーり) ',0.824,300]
syariraimonhard['293']=[294.994,'本 地 法 身　(ほんぢほっしん) ',0.824,300]
syariraimonhard['294']=[295.818,'法 界 塔 婆　(ほっかいとうば) ',0.842,300]
syariraimonhard['295']=[296.66,'我 等 禮 敬　(がーとうらいきょう) ',0.84,300]
syariraimonhard['296']=[297.5,'為 我 現 身　(いーがーげんしん) ',0.824,300]
syariraimonhard['297']=[298.324,'入 我 我 入　(にゅーがーがーにゅう) ',0.823,300]
syariraimonhard['298']=[299.147,'仏 加 持 故　(ぶつがーじーこ) ',0.824,300]
syariraimonhard['299']=[299.971,'我 証 菩 提　(がーしょうぼーだい) ',0.834,300]
syariraimonhard['300']=[300.805,'以 仏 神 力　(いーぶつじんりき) ',0.822,300]
syariraimonhard['301']=[301.627,'利 益 衆 生　(りーやくしゅーじょう) ',0.826,300]
syariraimonhard['302']=[302.453,'発 菩 提 心　(ほつぼーだいしん) ',0.823,300]
syariraimonhard['303']=[303.276,'修 菩 薩 行　(しゅーぼーさつぎょう) ',0.824,300]
syariraimonhard['304']=[304.101,'同 入 円 寂　(どうにゅうえんじゃく) ',0.83,300]
syariraimonhard['305']=[304.931,'平 等 大 智　(びょうどうだいち) ',1.631,300]
syariraimonhard['306']=[306.562,'今 将 頂 禮　(こんしょうちょうらい) ',7.486,300]
syariraimonhard['314']=[314.048,'end']


var syariraimonhard_n=new Array()
var syariraimonhard_n={
  "1":"",
'15':'たらつたつたつたすつたんたん',
'17':'わらつておとつていきつくさきはさしきろう',
'22':'ゆめもはててかなしいないきしこく',
'27':'ははは',
'28':'たらつたつたつたすつたんたん',
'30':'もつとたのしくうきよをいつしよにあゆみたい',
'35':'せいたくものはおともなくしぬかいい',
'40':'ほとけさま',
'45':'なつのあつさかみせる',
'50':'しんきろうにほくらのひとかけふたつ',
'58':'たのしいねうれしいな',
'65':'ここにほくらはいきているんた',
'77':'はかほしやの',
'90':'たたんたたんたんたたんたたんたんたんたん',
'92':'たたんたたんたんたたんたたんたんたんたん',
'94':'たたんたたんたんたたんたたんたんたんたん',
'96':'たたんたたんたんたたんたたんたんたんたん',
'98':'てていてていていてていてていていていてい',
'100':'てていてていていてていてていていていてい',
'102':'へへいへへいへいへへいへへいへいへいへい',
'104':'へへいへへいへいへへいへへいへいへいへい',
'106':'しやかよ',
'119':'ここまてきたらすつてんてん',
'121':'ふさけてさけんていきつくさきはほとけのし',
'126':'いこつになつてさみしいなしゆらのみち',
'131':'ははは',
'133':'ととのつまりはつはらはー',
'134':'ほくかゆるしうけたらなおんしらす',
'139':'なみたかなかれるよつらいよ',
'145':'ほとけさま',
'149':'なつのよそらかみせる',
'154':'なかれるほしにほくらのみらいかきえる',
'162':'かなしいねいやたよね',
'169':'すつとほくらはしにたくないよ',
'176':'たたんたたんたんたたんたたんたんたんたん',
'178':'たたんたたんたんたたんたたんたんたんたん',
'180':'たたんたたんたんたたんたたんたんたんたん',
'182':'たたんたたんたんたたんたたんたんたんたん',
'184':'てていてていていてていてていていていてい',
'186':'てていてていていてていてていていていてい',
'188':'へへいへへいへいへへいへへいへいへいへい',
'190':'へへいへへいへいへへいへへいへいへいへい',
'223':'いつしんちようらい',
'224':'まんとくえんまん',
'225':'しやーかーによらい',
'226':'しんしんしやーり',
'227':'ほんちほつしん',
'228':'ほつかいとうは',
'229':'かーとうらいきよう',
'230':'いーかーけんしん',
'231':'にゆーかーかーにゆう',
'232':'ふつかーしーこ',
'233':'かーしようほーたい',
'234':'いーふつしんりき',
'235':'りーやくしゆーしよう',
'236':'ほつほーたいしん',
'237':'しゆーほーさつきよう',
'238':'とうにゆうえんしやく',
'239':'ひようとうたいち',
'240':'こんしようちようらい',
'242':'いつしんちようらい',
'243':'まんとくえんまん',
'244':'しやーかーによらい',
'245':'しんしんしやーり',
'246':'ほんちほつしん',
'247':'ほつかいとうは',
'248':'かーとうらいきよう',
'249':'いーかーけんしん',
'250':'にゆーかーかーにゆう',
'251':'ふつかーしーこ',
'252':'かーしようほーたい',
'253':'いーふつしんりき',
'254':'りーやくしゆーしよう',
'255':'ほつほーたいしん',
'256':'しゆーほーさつきよう',
'257':'とうにゆうえんしやく',
'258':'ひようとうたいち',
'260':'こんしようちようらい',
'262':'いつしんちようらい',
'263':'まんとくえんまん',
'264':'しやーかーによらい',
'265':'しんしんしやーり',
'266':'ほんちほつしん',
'267':'ほつかいとうは',
'268':'かーとうらいきよう',
'269':'いーかーけんしん',
'270':'にゆーかーかーにゆう',
'271':'ふつかーしーこ',
'272':'かーしようほーたい',
'273':'いーふつしんりき',
'274':'りーやくしゆーしよう',
'275':'ほつほーたいしん',
'276':'しゆーほーさつきよう',
'277':'とうにゆうえんしやく',
'278':'ひようとうたいち',
'280':'こんしようちようらい',
'289':'いつしんちようらい',
'290':'まんとくえんまん',
'291':'しやーかーによらい',
'292':'しんしんしやーり',
'293':'ほんちほつしん',
'294':'ほつかいとうは',
'295':'かーとうらいきよう',
'296':'いーかーけんしん',
'297':'にゆーかーかーにゆう',
'298':'ふつかーしーこ',
'299':'かーしようほーたい',
'300':'いーふつしんりき',
'301':'りーやくしゆーしよう',
'302':'ほつほーたいしん',
'303':'しゆーほーさつきよう',
'304':'とうにゆうえんしやく',
'305':'ひようとうたいち',
'306':'こんしようちようらい',
"314":"end"
}

var syariraimonhard_s=new Array()
var syariraimonhard_s=[
15.548,15.645,15.742,15.839,15.936,16.033,16.13,16.227,16.324,16.421,16.518,16.615,16.712,16.809,
17.194,17.36,17.526,17.692,17.858,18.024,18.19,18.356,18.522,18.688,18.854,19.02,19.186,19.352,19.518,19.684,19.85,20.016,20.182,20.348,
22.188,22.391,22.594,22.797,23,23.203,23.406,23.609,23.812,24.015,24.218,24.421,24.624,24.827,25.03,25.233,
27.552,27.832,28.112,
28.804,28.893,28.982,29.071,29.16,29.249,29.338,29.427,29.516,29.605,29.694,29.783,29.872,29.961,
30.469,30.625,30.781,30.937,31.093,31.249,31.405,31.561,31.717,31.873,32.029,32.185,32.341,32.497,32.653,32.809,32.965,33.121,33.277,33.433,33.589,
35.43,35.625,35.82,36.015,36.21,36.405,36.6,36.795,36.99,37.185,37.38,37.575,37.77,37.965,38.16,38.355,38.55,
40.772,41.102,41.432,41.762,42.092,
45.353,45.763,46.173,46.583,46.993,47.403,47.813,48.223,48.633,49.043,
50.348,50.786,51.224,51.662,52.1,52.538,52.976,53.414,53.852,54.29,54.728,55.166,55.604,56.042,56.48,56.918,57.356,
58.568,59.068,59.568,60.068,60.568,61.068,61.568,62.068,62.568,63.068,
65.234,65.645,66.056,66.467,66.878,67.289,67.7,68.111,68.522,68.933,69.344,69.755,70.166,70.577,
77.995,79.929,81.863,83.797,85.731,87.665,
90.026,90.126,90.226,90.326,90.426,90.526,90.626,90.726,90.826,90.926,91.026,91.126,91.226,91.326,91.426,91.526,91.626,91.726,91.826,91.926,
92.111,92.209,92.307,92.405,92.503,92.601,92.699,92.797,92.895,92.993,93.091,93.189,93.287,93.385,93.483,93.581,93.679,93.777,93.875,93.973,
94.169,94.265,94.361,94.457,94.553,94.649,94.745,94.841,94.937,95.033,95.129,95.225,95.321,95.417,95.513,95.609,95.705,95.801,95.897,95.993,
96.238,96.341,96.444,96.547,96.65,96.753,96.856,96.959,97.062,97.165,97.268,97.371,97.474,97.577,97.68,97.783,97.886,97.989,98.092,98.195,
98.323,98.42,98.517,98.614,98.711,98.808,98.905,99.002,99.099,99.196,99.293,99.39,99.487,99.584,99.681,99.778,99.875,99.972,100.069,100.166,
100.374,100.468,100.562,100.656,100.75,100.844,100.938,101.032,101.126,101.22,101.314,101.408,101.502,101.596,101.69,101.784,101.878,101.972,102.066,102.16,
102.44,102.533,102.626,102.719,102.812,102.905,102.998,103.091,103.184,103.277,103.37,103.463,103.556,103.649,103.742,103.835,103.928,104.021,104.114,104.207,
104.508,104.6,104.692,104.784,104.876,104.968,105.06,105.152,105.244,105.336,105.428,105.52,105.612,105.704,105.796,105.888,105.98,106.072,106.164,106.256,
106.569,107.406,108.243,109.08,
119.838,119.942,120.046,120.15,120.254,120.358,120.462,120.566,120.67,120.774,120.878,120.982,121.086,
121.494,121.659,121.824,121.989,122.154,122.319,122.484,122.649,122.814,122.979,123.144,123.309,123.474,123.639,123.804,123.969,124.134,124.299,124.464,124.629,
126.428,126.614,126.8,126.986,127.172,127.358,127.544,127.73,127.916,128.102,128.288,128.474,128.66,128.846,129.032,129.218,129.404,129.59,
131.822,132.097,132.372,
133.023,133.148,133.273,133.398,133.523,133.648,133.773,133.898,134.023,134.148,134.273,134.398,
134.7,134.91,135.12,135.33,135.54,135.75,135.96,136.17,136.38,136.59,136.8,137.01,137.22,137.43,137.64,137.85,
139.647,139.905,140.163,140.421,140.679,140.937,141.195,141.453,141.711,141.969,142.227,142.485,142.743,
145.194,145.502,145.81,146.118,146.426,
149.593,150.009,150.425,150.841,151.257,151.673,152.089,152.505,152.921,153.337,
154.641,155.053,155.465,155.877,156.289,156.701,157.113,157.525,157.937,158.349,158.761,159.173,159.585,159.997,160.409,160.821,161.233,161.645,
162.864,163.361,163.858,164.355,164.852,165.349,165.846,166.343,166.84,167.337,
169.452,169.869,170.286,170.703,171.12,171.537,171.954,172.371,172.788,173.205,173.622,174.039,174.456,174.873,
176.138,176.234,176.33,176.426,176.522,176.618,176.714,176.81,176.906,177.002,177.098,177.194,177.29,177.386,177.482,177.578,177.674,177.77,177.866,177.962,
178.171,178.27,178.369,178.468,178.567,178.666,178.765,178.864,178.963,179.062,179.161,179.26,179.359,179.458,179.557,179.656,179.755,179.854,179.953,180.052,
180.275,180.372,180.469,180.566,180.663,180.76,180.857,180.954,181.051,181.148,181.245,181.342,181.439,181.536,181.633,181.73,181.827,181.924,182.021,182.118,
182.34,182.437,182.534,182.631,182.728,182.825,182.922,183.019,183.116,183.213,183.31,183.407,183.504,183.601,183.698,183.795,183.892,183.989,184.086,184.183,
184.383,184.479,184.575,184.671,184.767,184.863,184.959,185.055,185.151,185.247,185.343,185.439,185.535,185.631,185.727,185.823,185.919,186.015,186.111,186.207,
186.449,186.547,186.645,186.743,186.841,186.939,187.037,187.135,187.233,187.331,187.429,187.527,187.625,187.723,187.821,187.919,188.017,188.115,188.213,188.311,
188.529,188.623,188.717,188.811,188.905,188.999,189.093,189.187,189.281,189.375,189.469,189.563,189.657,189.751,189.845,189.939,190.033,190.127,190.221,190.315,
190.595,190.69,190.785,190.88,190.975,191.07,191.165,191.26,191.355,191.45,191.545,191.64,191.735,191.83,191.925,192.02,192.115,192.21,192.305,192.4,
225.483,225.588,225.693,225.798,225.903,226.008,226.113,226.218,226.323,
226.415,226.518,226.621,226.724,226.827,226.93,227.033,227.136,
227.439,227.508,227.577,227.646,227.715,227.784,227.853,227.922,227.991,
228.277,228.353,228.429,228.505,228.581,228.657,228.733,228.809,
229.102,229.19,229.278,229.366,229.454,229.542,229.63,
229.919,230.008,230.097,230.186,230.275,230.364,230.453,
230.741,230.811,230.881,230.951,231.021,231.091,231.161,231.231,231.301,
231.575,231.656,231.737,231.818,231.899,231.98,232.061,232.142,
232.407,232.469,232.531,232.593,232.655,232.717,232.779,232.841,232.903,232.965,
233.248,233.336,233.424,233.512,233.6,233.688,233.776,
234.052,234.122,234.192,234.262,234.332,234.402,234.472,234.542,234.612,
234.877,234.958,235.039,235.12,235.201,235.282,235.363,235.444,
235.698,235.763,235.828,235.893,235.958,236.023,236.088,236.153,236.218,236.283,
236.488,236.576,236.664,236.752,236.84,236.928,237.016,237.104,
237.331,237.399,237.467,237.535,237.603,237.671,237.739,237.807,237.875,237.943,
238.178,238.241,238.304,238.367,238.43,238.493,238.556,238.619,238.682,238.745,
239.007,239.161,239.315,239.469,239.623,239.777,239.931,240.085,
240.632,240.986,241.34,241.694,242.048,242.402,242.756,243.11,243.464,243.818,
245.592,245.669,245.746,245.823,245.9,245.977,246.054,246.131,246.208,
246.409,246.495,246.581,246.667,246.753,246.839,246.925,247.011,
247.274,247.35,247.426,247.502,247.578,247.654,247.73,247.806,247.882,
248.096,248.183,248.27,248.357,248.444,248.531,248.618,248.705,
248.929,249.023,249.117,249.211,249.305,249.399,249.493,
249.754,249.849,249.944,250.039,250.134,250.229,250.324,
250.613,250.683,250.753,250.823,250.893,250.963,251.033,251.103,251.173,
251.425,251.508,251.591,251.674,251.757,251.84,251.923,252.006,
252.252,252.316,252.38,252.444,252.508,252.572,252.636,252.7,252.764,252.828,
253.074,253.165,253.256,253.347,253.438,253.529,253.62,
253.889,253.961,254.033,254.105,254.177,254.249,254.321,254.393,254.465,
254.748,254.825,254.902,254.979,255.056,255.133,255.21,255.287,
255.583,255.645,255.707,255.769,255.831,255.893,255.955,256.017,256.079,256.141,
256.404,256.481,256.558,256.635,256.712,256.789,256.866,256.943,
257.229,257.294,257.359,257.424,257.489,257.554,257.619,257.684,257.749,257.814,
258.198,258.249,258.3,258.351,258.402,258.453,258.504,258.555,258.606,258.657,
258.943,259.091,259.239,259.387,259.535,259.683,259.831,259.979,
260.523,260.871,261.219,261.567,261.915,262.263,262.611,262.959,263.307,263.655,
265.498,265.568,265.638,265.708,265.778,265.848,265.918,265.988,266.058,
266.322,266.404,266.486,266.568,266.65,266.732,266.814,266.896,
267.145,267.216,267.287,267.358,267.429,267.5,267.571,267.642,267.713,
268.004,268.08,268.156,268.232,268.308,268.384,268.46,268.536,
268.809,268.901,268.993,269.085,269.177,269.269,269.361,
269.66,269.746,269.832,269.918,270.004,270.09,270.176,
270.492,270.56,270.628,270.696,270.764,270.832,270.9,270.968,271.036,
271.314,271.39,271.466,271.542,271.618,271.694,271.77,271.846,
272.129,272.192,272.255,272.318,272.381,272.444,272.507,272.57,272.633,272.696,
272.953,273.039,273.125,273.211,273.297,273.383,273.469,
273.786,273.855,273.924,273.993,274.062,274.131,274.2,274.269,274.338,
274.611,274.688,274.765,274.842,274.919,274.996,275.073,275.15,
275.435,275.498,275.561,275.624,275.687,275.75,275.813,275.876,275.939,276.002,
276.257,276.336,276.415,276.494,276.573,276.652,276.731,276.81,
277.087,277.15,277.213,277.276,277.339,277.402,277.465,277.528,277.591,277.654,
277.886,277.951,278.016,278.081,278.146,278.211,278.276,278.341,278.406,278.471,
278.745,278.899,279.053,279.207,279.361,279.515,279.669,279.823,
280.374,280.725,281.076,281.427,281.778,282.129,282.48,282.831,283.182,283.533,
291.949,292.023,292.097,292.171,292.245,292.319,292.393,292.467,292.541,
292.806,292.887,292.968,293.049,293.13,293.211,293.292,293.373,
293.675,293.742,293.809,293.876,293.943,294.01,294.077,294.144,294.211,
294.47,294.551,294.632,294.713,294.794,294.875,294.956,295.037,
295.294,295.383,295.472,295.561,295.65,295.739,295.828,
296.118,296.209,296.3,296.391,296.482,296.573,296.664,
296.96,297.028,297.096,297.164,297.232,297.3,297.368,297.436,297.504,
297.8,297.877,297.954,298.031,298.108,298.185,298.262,298.339,
298.624,298.681,298.738,298.795,298.852,298.909,298.966,299.023,299.08,299.137,
299.447,299.53,299.613,299.696,299.779,299.862,299.945,
300.271,300.339,300.407,300.475,300.543,300.611,300.679,300.747,300.815,
301.105,301.178,301.251,301.324,301.397,301.47,301.543,301.616,
301.927,301.989,302.051,302.113,302.175,302.237,302.299,302.361,302.423,302.485,
302.753,302.832,302.911,302.99,303.069,303.148,303.227,303.306,
303.576,303.637,303.698,303.759,303.82,303.881,303.942,304.003,304.064,304.125,
304.401,304.466,304.531,304.596,304.661,304.726,304.791,304.856,304.921,304.986,
305.231,305.384,305.537,305.69,305.843,305.996,306.149,306.302,
306.862,307.216,307.57,307.924,308.278,308.632,308.986,309.34,309.694,310.048]

var syariraimonnormal=new Array()
syariraimonnormal['2']=[2,'(前奏)',13.336,0.5]
syariraimonnormal['15']=[15.336,'たらった！ ',1.651,0.5]
syariraimonnormal['17']=[16.987,'笑って踊って行き着く先は座敷牢 ',4.961,0.5]
syariraimonnormal['22']=[21.948,'夢も果ててかなしいな生き地獄 ',5.362,0.5]
syariraimonnormal['27']=[27.31,'ははは ',1.261,0.5]
syariraimonnormal['28']=[28.572,'たらった！ ',1.664,0.5]
syariraimonnormal['30']=[30.236,'もっと楽しく浮世を一緒にあゆみたい ',4.969,0.5]
syariraimonnormal['35']=[35.205,'贅沢ものは音も無く死ぬがいい ',5.37,0.5]
syariraimonnormal['40']=[40.576,'ほとけさま！ ',4.546,0.5]
syariraimonnormal['45']=[45.121,'夏の暑さがみせる ',4.986,0.5]
syariraimonnormal['50']=[50.107,'蜃気楼に僕らの人影ふたつ ',8.29,0.5]
syariraimonnormal['58']=[58.397,'楽しいね うれしいな ',6.622,0.5]
syariraimonnormal['65']=[65.019,'ここに僕らは生きているんだ ',12.807,0.5]
syariraimonnormal['78']=[77.825,'葉　歌　穂　舎　野 ',11.998,0.5]
syariraimonnormal['90']=[89.823,'たた　たた　た　たた　たた　た　たた',2.075,0.5]
syariraimonnormal['92']=[91.899,'たた　たた　た　たた　たた　た　たた',2.032,0.5]
syariraimonnormal['94']=[93.93,'だだ　だだ　だ　だだ　だだ　だ　だだ',2.075,0.5]
syariraimonnormal['96']=[96.006,'だだ　だだ　だ　だだ　だだ　だ　だだ',2.088,0.5]
syariraimonnormal['98']=[98.093,'てて　てて　て　てて　てて　て　てて',2.051,0.5]
syariraimonnormal['100']=[100.145,'てて　てて　て　てて　てて　て　てて',2.086,0.5]
syariraimonnormal['102']=[102.231,'へへ　へへ　へ　へへ　へへ　へ　へへ',2.093,0.5]
syariraimonnormal['104']=[104.323,'へへ　へへ　へ　へへ　へへ　へ　へへ',1.939,0.5]
syariraimonnormal['106']=[106.262,'釈迦よ ',13.394,0.5]
syariraimonnormal['119']=[119.656,'ここまできたら！ ',1.604,0.5]
syariraimonnormal['121']=[121.26,'ふざけてさけんで行き着く先は仏の死 ',4.942,0.5]
syariraimonnormal['126']=[126.202,'遺骨になって寂しいな修羅の道 ',5.421,0.5]
syariraimonnormal['131']=[131.623,'ははは ',1.166,0.5]
syariraimonnormal['133']=[132.789,'とどのつまり！ ',1.71,0.5]
syariraimonnormal['134']=[134.499,'僕が許し受けたなら恩知らず ',4.988,0.5]
syariraimonnormal['139']=[139.487,'涙が流れるよ つらいよ ',5.365,0.5]
syariraimonnormal['145']=[144.852,'ほとけさま！ ',4.55,0.5]
syariraimonnormal['149']=[149.402,'夏の夜空が見せる',5.014,0.5]
syariraimonnormal['154']=[154.416,'流れる星に僕らの未来が消える ',8.247,0.5]
syariraimonnormal['162']=[162.663,'かなしいね いやだよね ',6.616,0.5]
syariraimonnormal['169']=[169.279,'ずっと僕らは死にたくないよ ',6.625,0.5]
syariraimonnormal['176']=[175.904,'たた　たた　た　たた　たた　た　たた',2.05,0.5]
syariraimonnormal['178']=[177.954,'たた　たた　た　たた　たた　た　たた',2.068,0.5]
syariraimonnormal['180']=[180.021,'だだ　だだ　だ　だだ　だだ　だ　だだ',2.076,0.5]
syariraimonnormal['182']=[182.098,'だだ　だだ　だ　だだ　だだ　だ　だだ',2.098,0.5]
syariraimonnormal['184']=[184.195,'てて　てて　て　てて　てて　て　てて',2.03,0.5]
syariraimonnormal['186']=[186.226,'てて　てて　て　てて　てて　て　てて',2.083,0.5]
syariraimonnormal['188']=[188.309,'へへ　へへ　へ　へへ　へへ　へ　へへ',2.07,0.5]
syariraimonnormal['190']=[190.379,'へへ　へへ　へ　へへ　へへ　へ　へへ',5,0.5]

syariraimonnormal['195']=[195.379,'(皆様お待たせしました。',30.204,0.5]
syariraimonnormal['199']=[199.379,'(ここからがこの曲の本番です。',0,0.5]
syariraimonnormal['202']=[202.379,'(せっかくなので盛り上げて参りましょう',0,0.5]
syariraimonnormal['204']=[204.379,'(Q.しゃりらいもんって何？',0,0.5]
syariraimonnormal['205']=[205.379,'(A.お経の名前です。',0,0.5]
syariraimonnormal['206']=[206.379,'(Q.何が書かれているの？',0,0.5]
syariraimonnormal['207']=[207.379,'(A.自分もよく知りません。（鉄風P）',0,0.5]
syariraimonnormal['208']=[208.379,'(A.自分もよく知りません。（機能美P）',0,0.5]
syariraimonnormal['209']=[209.379,'(Q.なにそれ、駄目でしょ。',0,0.5]
syariraimonnormal['210']=[210.379,'(A.ごたくはいい。とにかく唱えるんだ。',0,0.5]
syariraimonnormal['212']=[212.379,'(それではいきましょう。',0,0.5]
syariraimonnormal['214']=[214.379,'(鉄風Pが贈る仏陀なひととき。',0,0.5]
syariraimonnormal['216']=[216.379,'',0,0.5]




syariraimonnormal['223']=[225.583,'一 心 頂 禮　(いっしんちょうらい) ',0.8,0.5]
syariraimonnormal['224']=[226.383,'万 徳 円 満　(まんとくえんまん) ',0.804,0.5]
syariraimonnormal['225']=[227.187,'釈 迦 如 来　(しゃーかーにょらい) ',0.87,0.5]
syariraimonnormal['226']=[228.056,'真 身 舎 利　(しんじんしゃーり) ',0.847,0.5]
syariraimonnormal['227']=[228.903,'本 地 法 身　(ほんぢほっしん) ',0.807,0.5]
syariraimonnormal['228']=[229.71,'法 界 塔 婆　(ほっかいとうば) ',0.844,0.5]
syariraimonnormal['229']=[230.554,'我 等 禮 敬　(がーとうらいきょう) ',0.856,0.5]
syariraimonnormal['230']=[231.41,'為 我 現 身　(いーがーげんしん) ',0.762,0.5]
syariraimonnormal['231']=[232.171,'入 我 我 入　(にゅーがーがーにゅう) ',0.835,0.5]
syariraimonnormal['232']=[233.006,'仏 加 持 故　(ぶつがーじーこ) ',0.802,0.5]
syariraimonnormal['233']=[233.809,'我 証 菩 提　(がーしょうぼーだい) ',0.853,0.5]
syariraimonnormal['234']=[234.662,'以 仏 神 力　(いーぶつじんりき) ',0.804,0.5]
syariraimonnormal['235']=[235.466,'利 益 衆 生　(りーやくしゅーじょう) ',0.859,0.5]
syariraimonnormal['236']=[236.325,'発 菩 提 心　(ほつぼーだいしん) ',0.805,0.5]
syariraimonnormal['237']=[237.13,'修 菩 薩 行　(しゅーぼーさつぎょう) ',0.834,0.5]
syariraimonnormal['238']=[237.964,'同 入 円 寂　(どうにゅうえんじゃく) ',0.767,0.5]
syariraimonnormal['239']=[238.731,'平 等 大 智　(びょうどうだいち) ',1.759,0.5]
syariraimonnormal['240']=[240.49,'今 将 頂 禮　(こんしょうちょうらい) ',4.928,0.5]
syariraimonnormal['242']=[245.418,'一 心 頂 禮　(いっしんちょうらい) ',0.8,0.5]
syariraimonnormal['243']=[246.218,'万 徳 円 満　(まんとくえんまん) ',0.839,0.5]
syariraimonnormal['244']=[247.056,'釈 迦 如 来　(しゃーかーにょらい) ',0.834,0.5]
syariraimonnormal['245']=[247.89,'真 身 舎 利　(しんじんしゃーり) ',0.849,0.5]
syariraimonnormal['246']=[248.739,'本 地 法 身　(ほんぢほっしん) ',0.799,0.5]
syariraimonnormal['247']=[249.538,'法 界 塔 婆　(ほっかいとうば) ',0.843,0.5]
syariraimonnormal['248']=[250.38,'我 等 禮 敬　(がーとうらいきょう) ',0.83,0.5]
syariraimonnormal['249']=[251.211,'為 我 現 身　(いーがーげんしん) ',0.835,0.5]
syariraimonnormal['250']=[252.046,'入 我 我 入　(にゅーがーがーにゅう) ',0.821,0.5]
syariraimonnormal['251']=[252.867,'仏 加 持 故　(ぶつがーじーこ) ',0.817,0.5]
syariraimonnormal['252']=[253.684,'我 証 菩 提　(がーしょうぼーだい) ',0.849,0.5]
syariraimonnormal['253']=[254.532,'以 仏 神 力　(いーぶつじんりき) ',0.824,0.5]
syariraimonnormal['254']=[255.357,'利 益 衆 生　(りーやくしゅーじょう) ',0.85,0.5]
syariraimonnormal['255']=[256.206,'発 菩 提 心　(ほつぼーだいしん) ',0.833,0.5]
syariraimonnormal['256']=[257.039,'修 菩 薩 行　(しゅーぼーさつぎょう) ',0.803,0.5]
syariraimonnormal['257']=[257.842,'同 入 円 寂　(どうにゅうえんじゃく) ',0.747,0.5]
syariraimonnormal['258']=[258.589,'平 等 大 智　(びょうどうだいち) ',1.723,0.5]
syariraimonnormal['260']=[260.312,'今 将 頂 禮　(こんしょうちょうらい) ',4.988,0.5]
syariraimonnormal['262']=[265.3,'一 心 頂 禮　(いっしんちょうらい) ',0.786,0.5]
syariraimonnormal['263']=[266.086,'万 徳 円 満　(まんとくえんまん) ',0.822,0.5]
syariraimonnormal['264']=[266.908,'釈 迦 如 来　(しゃーかーにょらい) ',0.861,0.5]
syariraimonnormal['265']=[267.77,'真 身 舎 利　(しんじんしゃーり) ',0.832,0.5]
syariraimonnormal['266']=[268.601,'本 地 法 身　(ほんぢほっしん) ',0.833,0.5]
syariraimonnormal['267']=[269.435,'法 界 塔 婆　(ほっかいとうば) ',0.805,0.5]
syariraimonnormal['268']=[270.239,'我 等 禮 敬　(がーとうらいきょう) ',0.844,0.5]
syariraimonnormal['269']=[271.083,'為 我 現 身　(いーがーげんしん) ',0.797,0.5]
syariraimonnormal['270']=[271.881,'入 我 我 入　(にゅーがーがーにゅう) ',0.813,0.5]
syariraimonnormal['271']=[272.693,'仏 加 持 故　(ぶつがーじーこ) ',0.851,0.5]
syariraimonnormal['272']=[273.544,'我 証 菩 提　(がーしょうぼーだい) ',0.824,0.5]
syariraimonnormal['273']=[274.369,'以 仏 神 力　(いーぶつじんりき) ',0.856,0.5]
syariraimonnormal['274']=[275.224,'利 益 衆 生　(りーやくしゅーじょう) ',0.844,0.5]
syariraimonnormal['275']=[276.068,'発 菩 提 心　(ほつぼーだいしん) ',0.832,0.5]
syariraimonnormal['276']=[276.9,'修 菩 薩 行　(しゅーぼーさつぎょう) ',0.825,0.5]
syariraimonnormal['277']=[277.724,'同 入 円 寂　(どうにゅうえんじゃく) ',0.71,0.5]
syariraimonnormal['278']=[278.434,'平 等 大 智　(びょうどうだいち) ',1.761,0.5]
syariraimonnormal['280']=[280.195,'今 将 頂 禮　(こんしょうちょうらい) ',11.555,0.5]
syariraimonnormal['289']=[291.75,'一 心 頂 禮　(いっしんちょうらい) ',0.84,0.5]
syariraimonnormal['290']=[292.59,'万 徳 円 満　(まんとくえんまん) ',0.835,0.5]
syariraimonnormal['291']=[293.425,'釈 迦 如 来　(しゃーかーにょらい) ',0.813,0.5]
syariraimonnormal['292']=[294.237,'真 身 舎 利　(しんじんしゃーり) ',0.842,0.5]
syariraimonnormal['293']=[295.079,'本 地 法 身　(ほんぢほっしん) ',0.83,0.5]
syariraimonnormal['294']=[295.909,'法 界 塔 婆　(ほっかいとうば) ',0.853,0.5]
syariraimonnormal['295']=[296.762,'我 等 禮 敬　(がーとうらいきょう) ',0.804,0.5]
syariraimonnormal['296']=[297.565,'為 我 現 身　(いーがーげんしん) ',0.843,0.5]
syariraimonnormal['297']=[298.408,'入 我 我 入　(にゅーがーがーにゅう) ',0.813,0.5]
syariraimonnormal['298']=[299.221,'仏 加 持 故　(ぶつがーじーこ) ',0.798,0.5]
syariraimonnormal['299']=[300.019,'我 証 菩 提　(がーしょうぼーだい) ',0.853,0.5]
syariraimonnormal['300']=[300.872,'以 仏 神 力　(いーぶつじんりき) ',0.814,0.5]
syariraimonnormal['301']=[301.686,'利 益 衆 生　(りーやくしゅーじょう) ',0.825,0.5]
syariraimonnormal['302']=[302.511,'発 菩 提 心　(ほつぼーだいしん) ',0.829,0.5]
syariraimonnormal['303']=[303.341,'修 菩 薩 行　(しゅーぼーさつぎょう) ',0.824,0.5]
syariraimonnormal['304']=[304.165,'同 入 円 寂　(どうにゅうえんじゃく) ',0.727,0.5]
syariraimonnormal['305']=[304.892,'平 等 大 智　(びょうどうだいち) ',1.778,0.5]
syariraimonnormal['306']=[306.671,'今 将 頂 禮　(こんしょうちょうらい) ',7.829,0.5]
syariraimonnormal['315']=[314.502,'end']


var syariraimonnormal_n=new Array()
var syariraimonnormal_n={
  "1":"",
'15':'たらつた',
'17':'わらつておとつていきつくさきはさしきろう',
'22':'ゆめもはててかなしいないきしこく',
'27':'ははは',
'28':'たらつた',
'30':'もつとたのしくうきよをいつしよにあゆみたい',
'35':'せいたくものはおともなくしぬかいい',
'40':'ほとけさま',
'45':'なつのあつさかみせる',
'50':'しんきろうにほくらのひとかけふたつ',
'58':'たのしいねうれしいな',
'65':'ここにほくらはいきているんた',
'78':'はかほしやの',
'90':'たたたたたたたたたたたた',
'92':'たたたたたたたたたたたた',
'94':'たたたたたたたたたたたた',
'96':'たたたたたたたたたたたた',
'98':'てててててててててててて',
'100':'てててててててててててて',
'102':'へへへへへへへへへへへへ',
'104':'へへへへへへへへへへへへ',
'106':'しやかよ',
'119':'ここまてきたら',
'121':'ふさけてさけんていきつくさきはほとけのし',
'126':'いこつになつてさみしいなしゆらのみち',
'131':'ははは',
'133':'ととのつまり',
'134':'ほくかゆるしうけたらなおんしらす',
'139':'なみたかなかれるよつらいよ',
'145':'ほとけさま',
'149':'なつのよそらかみせる',
'154':'なかれるほしにほくらのみらいかきえる',
'162':'かなしいねいやたよね',
'169':'すつとほくらはしにたくないよ',
'176':'たたたたたたたたたたたた',
'178':'たたたたたたたたたたたた',
'180':'たたたたたたたたたたたた',
'182':'たたたたたたたたたたたた',
'184':'てててててててててててて',
'186':'てててててててててててて',
'188':'へへへへへへへへへへへへ',
'190':'へへへへへへへへへへへへ',
'223':'いつ',
'224':'まん',
'225':'しや',
'226':'しん',
'227':'ほん',
'228':'ほつ',
'229':'かー',
'230':'いー',
'231':'にゆ',
'232':'ふつ',
'233':'かー',
'234':'いー',
'235':'りー',
'236':'ほつ',
'237':'しゆ',
'238':'とう',
'239':'ひようとうたいち',
'240':'こんしようちようらい',
'242':'いつ',
'243':'まん',
'244':'しや',
'245':'しん',
'246':'ほん',
'247':'ほつ',
'248':'かー',
'249':'いー',
'250':'にゆ',
'251':'ふつ',
'252':'かー',
'253':'いー',
'254':'りー',
'255':'ほつ',
'256':'しゆ',
'257':'とう',
'258':'ひようとうたいち',
'260':'こんしようちようらい',
'262':'いつ',
'263':'まん',
'264':'しや',
'265':'しん',
'266':'ほん',
'267':'ほつ',
'268':'かー',
'269':'いー',
'270':'にゆ',
'271':'ふつ',
'272':'かー',
'273':'いー',
'274':'りー',
'275':'ほつ',
'276':'しゆ',
'277':'とう',
'278':'ひようとうたいち',
'280':'こんしようちようらい',
'289':'いつ',
'290':'まん',
'291':'しや',
'292':'しん',
'293':'ほん',
'294':'ほつ',
'295':'かー',
'296':'いー',
'297':'にゆ',
'298':'ふつ',
'299':'かー',
'300':'いー',
'301':'りー',
'302':'ほつ',
'303':'しゆ',
'304':'とう',
'305':'ひようとうたいち',
'306':'こんしようちようらい',
"315":"end"
}

var syariraimonnormal_s=new Array()
var syariraimonnormal_s=[
15.636,15.748,15.834,15.968,
17.287,17.368,17.488,17.568,17.692,17.779,17.902,17.988,18.113,18.183,18.308,18.382,18.514,18.7,18.839,18.919,19.381,19.761,20.416,20.59,
22.248,22.458,22.538,22.66,22.852,22.951,23.055,23.272,23.397,23.501,23.685,23.903,24.52,24.746,25.122,25.604,
27.61,28.03,28.425,
28.872,28.949,29.091,29.168,
30.536,30.641,30.853,30.94,31.06,31.149,31.271,31.36,31.472,31.565,31.649,31.78,31.869,31.966,32.045,32.123,32.254,32.605,33.034,33.63,33.866,
35.505,35.583,35.705,35.794,35.914,36.099,36.205,36.32,36.529,36.636,36.768,36.951,37.17,37.755,37.977,38.372,38.794,
40.876,41.297,41.71,42.143,42.541,
45.421,46.035,46.253,47.089,47.497,47.917,48.318,48.735,49.356,49.576,
50.407,50.798,51.23,51.627,52.028,52.872,53.694,54.106,54.536,54.93,55.357,55.946,56.181,56.786,57.022,57.451,57.856,
58.697,59.283,59.521,60.107,60.324,61.972,62.577,62.805,63.426,63.653,
65.319,65.915,66.151,66.983,67.385,67.824,68.202,68.641,69.036,69.41,69.832,70.279,70.867,71.102,
78.125,81.016,83.954,86.764,86.86,89.788,
90.123,90.211,90.449,90.535,90.737,90.939,91.034,91.245,91.369,91.568,91.78,91.972,
92.199,92.279,92.487,92.594,92.787,92.989,93.12,93.335,93.454,93.644,93.855,94.041,
94.23,94.33,94.557,94.651,94.863,95.072,95.188,95.379,95.495,95.687,95.915,96.1,
96.306,96.407,96.634,96.729,96.949,97.15,97.255,97.465,97.581,97.772,98.006,98.175,
98.393,98.5,98.711,98.806,99.009,99.211,99.323,99.535,99.654,99.839,100.057,100.223,
100.445,100.534,100.778,100.865,101.092,101.295,101.407,101.601,101.721,101.925,102.119,102.299,
102.531,102.635,102.863,102.967,103.145,103.362,103.459,103.667,103.793,103.992,104.197,104.396,
104.623,104.728,104.921,105.026,105.221,105.44,105.534,105.753,105.877,106.069,106.252,106.466,
106.562,106.691,109.121,109.934,
119.956,120.026,120.15,120.254,120.361,120.536,120.642,
121.56,121.655,121.779,121.859,121.988,122.085,122.2,122.289,122.403,122.487,122.603,122.698,122.822,123.004,123.112,123.224,123.636,124.022,124.697,124.881,
126.502,126.587,126.703,126.818,126.932,127.123,127.236,127.352,127.588,127.677,127.781,127.975,128.211,128.308,128.814,129.035,129.481,129.875,
131.923,132.293,132.729,
133.089,133.178,133.448,133.547,133.651,133.887,
134.799,134.886,135.105,135.201,135.324,135.534,135.631,135.743,135.97,136.043,136.269,136.47,136.908,137.295,137.933,138.119,
139.787,139.881,140.004,140.093,140.214,140.481,140.583,140.9,141.013,141.435,142.053,142.238,142.677,
145.152,145.548,145.981,146.389,146.848,
149.702,150.306,150.535,151.384,151.778,152.217,152.602,153.049,153.628,153.853,
154.716,155.09,155.501,155.903,156.342,156.956,157.174,157.99,158.419,158.828,159.244,159.68,160.25,160.478,161.111,161.336,161.738,162.139,
162.963,163.536,163.782,164.377,164.639,166.259,166.875,167.118,167.732,167.953,
169.579,170.185,170.414,171.245,171.666,172.069,172.489,172.927,173.288,173.689,174.084,174.525,175.183,175.415,
176.204,176.281,176.51,176.627,176.785,177.019,177.091,177.29,177.404,177.625,177.815,178.028,
178.254,178.344,178.572,178.675,178.869,179.08,179.156,179.41,179.483,179.701,179.901,180.105,
180.321,180.419,180.639,180.733,180.936,181.146,181.234,181.477,181.566,181.787,181.97,182.197,
182.398,182.484,182.696,182.793,182.994,183.215,183.3,183.547,183.635,183.843,184.057,184.274,
184.495,184.57,184.781,184.895,185.079,185.282,185.368,185.606,185.684,185.903,186.114,186.305,
186.526,186.639,186.822,186.946,187.13,187.331,187.409,187.662,187.759,188.005,188.179,188.398,
188.609,188.707,188.907,189.014,189.198,189.427,189.503,189.75,189.836,190.045,190.249,190.46,
190.679,190.774,190.985,191.099,191.273,191.5,191.57,191.825,191.914,192.141,192.317,192.552,
225.883,226.049,226.683,226.84,227.487,227.671,228.356,228.532,229.203,229.37,230.01,230.219,230.854,231.033,231.71,231.885,232.471,232.665,233.306,233.478,234.109,234.294,234.962,235.125,235.766,235.967,236.625,236.809,237.43,237.633,238.264,238.473,
239.031,239.13,239.305,239.523,239.735,239.953,240.199,240.384,
240.79,240.97,241.462,241.539,241.744,242.338,242.442,242.636,244.091,244.29,
245.718,245.895,246.518,246.711,247.356,247.551,248.19,248.399,249.039,249.243,249.838,250.055,250.68,250.88,251.511,251.729,252.346,252.545,253.167,253.366,253.984,254.156,254.832,255.017,255.657,255.855,256.506,256.707,257.339,257.533,258.142,258.346,
258.889,258.985,259.142,259.379,259.579,259.817,260,260.219,
260.612,260.834,261.366,261.464,261.657,262.19,262.305,262.498,263.978,264.163,
265.6,265.78,266.386,266.57,267.208,267.404,268.07,268.263,268.901,269.096,269.735,269.943,270.539,270.743,271.383,271.557,272.181,272.372,272.993,273.194,273.844,274.037,274.669,274.878,275.524,275.702,276.368,276.561,277.2,277.374,278.024,278.234,
278.734,278.839,279.038,279.251,279.467,279.675,279.889,280.083,
280.495,280.688,281.21,281.29,281.518,282.123,282.265,282.414,283.805,284.016,
292.05,292.235,292.89,293.086,293.725,293.897,294.537,294.757,295.379,295.58,296.209,296.415,297.062,297.238,297.865,298.077,298.708,298.891,299.521,299.689,300.319,300.528,301.172,301.339,301.986,302.188,302.811,303.021,303.641,303.818,304.465,304.702,
305.192,305.306,305.5,305.726,305.935,306.156,306.365,306.56,
306.971,307.182,307.698,307.784,307.996,308.575,308.673,308.862,310.287,310.502]

var syariraimonnormal_demo=new Array()
syariraimonnormal_demo=[
't','r','t','t',
'w','r','t','t','a','t','t','t','a','k','t','k','s','k','h','s','s','k','r','a',
'y','m','m','h','t','t','k','n','s','a','n','a','k','s','k','k',
'h','h','h',
't','r','t','t',
'm','t','t','t','n','s','k','a','k','y','w','a','t','s','y','n','a','y','m','t','a',
's','a','t','k','m','n','h','a','t','m','n','k','s','n','k','a','a',
'h','t','k','s','m',
'n','t','n','a','t','s','k','m','s','r',
's','w','k','r','a','n','h','k','r','n','h','t','k','k','h','t','t',
't','n','s','a','n','a','r','s','a','n',
'k','k','n','h','k','r','h','a','k','t','a','r','w','t',
'h','k','h','s','y','n',
't','t','t','t','t','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t','t','t','t','t',
'h','h','h','h','h','h','h','h','h','h','h','h',
'h','h','h','h','h','h','h','h','h','h','h','h',
's','y','k','y',
'k','k','m','t','k','t','r',
'h','s','k','t','s','k','w','t','a','k','t','k','s','k','h','h','t','k','n','s',
'a','k','t','n','n','t','t','s','m','s','a','n','s','y','r','n','m','t',
'h','h','h',
't','t','n','t','m','r',
'h','k','k','y','r','s','a','k','t','r','n','a','w','s','r','s',
'n','m','t','k','n','k','r','r','y','t','r','a','y',
'h','t','k','s','m',
'n','t','n','y','s','r','k','m','s','r',
'n','k','r','r','h','s','n','h','k','r','n','m','r','a','k','k','a','r',
'k','n','s','a','n','a','y','t','y','n',
's','t','t','h','k','r','h','s','n','t','k','n','a','y',
't','t','t','t','t','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t','t','t','t','t',
'h','h','h','h','h','h','h','h','h','h','h','h',
'h','h','h','h','h','h','h','h','h','h','h','h',
'a','t',
'm','w',
's','y',
's','w',
'h','w',
'h','t',
'k','w',
'a','w',
'n','w',
'h','t',
'k','w',
'a','w',
'r','w',
'h','t',
's','y',
't','a',
'h','y','a','t','a','t','a','t',
'k','w','s','y','a','t','y','a','r','a',
'a','t',
'm','w',
's','y',
's','w',
'h','w',
'h','t',
'k','w',
'a','w',
'n','w',
'h','t',
'k','w',
'a','w',
'r','w',
'h','t',
's','y',
't','a',
'h','y','a','t','a','t','a','t',
'k','w','s','y','a','t','y','a','r','a',
'a','t',
'm','w',
's','y',
's','w',
'h','w',
'h','t',
'k','w',
'a','w',
'n','w',
'h','t',
'k','w',
'a','w',
'r','w',
'h','t',
's','y',
't','a',
'h','y','a','t','a','t','a','t',
'k','w','s','y','a','t','y','a','r','a',
'a','t',
'm','w',
's','y',
's','w',
'h','w',
'h','t',
'k','w',
'a','w',
'n','w',
'h','t',
'k','w',
'a','w',
'r','w',
'h','t',
's','y',
't','a',
'h','y','a','t','a','t','a','t',
'k','w','s','y','a','t','y','a','r','a'
]

var syariraimoneasy=new Array()
syariraimoneasy['2']=[2,'(前奏)',13.336,0.5]
syariraimoneasy['15']=[15.336,'たらった！',1.651,0.5]
syariraimoneasy['17']=[16.987,'笑って踊って行き着く先は座敷牢',4.961,1]
syariraimoneasy['22']=[21.948,'夢も果ててかなしいな生き地獄',5.362,1]
syariraimoneasy['27']=[27.31,'ははは',1.261,0.5]
syariraimoneasy['28']=[28.572,'たらった！',1.664,0.5]
syariraimoneasy['30']=[30.236,'もっと楽しく浮世を一緒にあゆみたい',4.969,1]
syariraimoneasy['35']=[35.205,'贅沢ものは音も無く死ぬがいい',5.37,1]
syariraimoneasy['40']=[40.576,'ほとけさま！',4.546,0.5]
syariraimoneasy['45']=[45.121,'夏の暑さがみせる',4.986,0.5]
syariraimoneasy['50']=[50.107,'蜃気楼に僕らの人影ふたつ',8.29,0.5]
syariraimoneasy['58']=[58.397,'楽しいね うれしいな',6.622,0.5]
syariraimoneasy['65']=[65.019,'ここに僕らは生きているんだ',12.807,0.5]
syariraimoneasy['78']=[77.825,'葉　歌　穂　舎　野',11.998,0.5]
syariraimoneasy['90']=[89.823,'た　た　た　た　た　た　たた',2.075,0.5]
syariraimoneasy['92']=[91.899,'た　た　た　た　た　た　たた',2.032,0.5]
syariraimoneasy['94']=[93.93,'だ　だ　だ　だ　だ　だ　だだ',2.075,0.5]
syariraimoneasy['96']=[96.006,'だ　だ　だ　だ　だ　だ　だだ',2.088,0.5]
syariraimoneasy['98']=[98.093,'て　て　て　て　て　て　てて',2.051,0.5]
syariraimoneasy['100']=[100.145,'て　て　て　て　て　て　てて',2.086,0.5]
syariraimoneasy['102']=[102.231,'へ　へ　へ　へ　へ　へ　へへ',2.093,0.5]
syariraimoneasy['104']=[104.323,'へ　へ　へ　へ　へ　へ　へへ',1.939,0.5]
syariraimoneasy['106']=[106.262,'釈迦よ ',13.394,0.5]
syariraimoneasy['119']=[119.656,'ここまできたら！ ',1.604,0.5]
syariraimoneasy['121']=[121.26,'ふざけてさけんで行き着く先は仏の死 ',4.942,1]
syariraimoneasy['126']=[126.202,'遺骨になって寂しいな修羅の道 ',5.421,1]
syariraimoneasy['131']=[131.623,'ははは ',1.166,0.5]
syariraimoneasy['133']=[132.789,'とどのつまり！ ',1.71,0.5]
syariraimoneasy['134']=[134.499,'僕が許し受けたなら恩知らず ',4.988,1]
syariraimoneasy['139']=[139.487,'涙が流れるよ つらいよ ',5.365,1]
syariraimoneasy['145']=[144.852,'ほとけさま！ ',4.55,0.5]
syariraimoneasy['149']=[149.402,'夏の夜空が見せる',5.014,0.5]
syariraimoneasy['154']=[154.416,'流れる星に僕らの未来が消える ',8.247,0.5]
syariraimoneasy['162']=[162.663,'かなしいね いやだよね ',6.616,0.5]
syariraimoneasy['169']=[169.279,'ずっと僕らは死にたくないよ ',6.625,0.5]
syariraimoneasy['176']=[175.904,'た　た　た　た　た　た　たた',2.05,0.5]
syariraimoneasy['178']=[177.954,'た　た　た　た　た　た　たた',2.068,0.5]
syariraimoneasy['180']=[180.021,'だ　だ　だ　だ　だ　だ　だだ',2.076,0.5]
syariraimoneasy['182']=[182.098,'だ　だ　だ　だ　だ　だ　だだ',2.098,0.5]
syariraimoneasy['184']=[184.195,'て　て　て　て　て　て　てて',2.03,0.5]
syariraimoneasy['186']=[186.226,'て　て　て　て　て　て　てて',2.083,0.5]
syariraimoneasy['188']=[188.309,'へ　へ　へ　へ　へ　へ　へへ',2.07,0.5]
syariraimoneasy['190']=[190.379,'へ　へ　へ　へ　へ　へ　へへ',5,0.5]

syariraimoneasy['195']=[195.379,'(皆様お待たせしました。',30.204,0.5]
syariraimoneasy['199']=[199.379,'(ここからがこの曲の本番です。',0,0.5]
syariraimoneasy['202']=[202.379,'(せっかくなので盛り上げて参りましょう',0,0.5]
syariraimoneasy['204']=[204.379,'(Q.しゃりらいもんって何？',0,0.5]
syariraimoneasy['205']=[205.379,'(A.お経の名前です。',0,0.5]
syariraimoneasy['206']=[206.379,'(Q.何が書かれているの？',0,0.5]
syariraimoneasy['207']=[207.379,'(A.自分もよく知りません。（鉄風P）',0,0.5]
syariraimoneasy['208']=[208.379,'(A.自分もよく知りません。（機能美P）',0,0.5]
syariraimoneasy['209']=[209.379,'(Q.なにそれ、駄目でしょ。',0,0.5]
syariraimoneasy['210']=[210.379,'(A.ごたくはいい。とにかく唱えるんだ。',0,0.5]
syariraimoneasy['212']=[212.379,'(それではいきましょう。',0,0.5]
syariraimoneasy['214']=[214.379,'(鉄風Pが贈る仏陀なひととき。',0,0.5]
syariraimoneasy['216']=[216.379,'',0,0.5]




syariraimoneasy['223']=[225.583,'一 心 頂 禮　(いっしんちょうらい) ',0.8,0.5]
syariraimoneasy['224']=[226.383,'万 徳 円 満　(まんとくえんまん) ',0.804,0.5]
syariraimoneasy['225']=[227.187,'釈 迦 如 来　(しゃーかーにょらい) ',0.87,0.5]
syariraimoneasy['226']=[228.056,'真 身 舎 利　(しんじんしゃーり) ',0.847,0.5]
syariraimoneasy['227']=[228.903,'本 地 法 身　(ほんぢほっしん) ',0.807,0.5]
syariraimoneasy['228']=[229.71,'法 界 塔 婆　(ほっかいとうば) ',0.844,0.5]
syariraimoneasy['229']=[230.554,'我 等 禮 敬　(がーとうらいきょう) ',0.856,0.5]
syariraimoneasy['230']=[231.41,'為 我 現 身　(いーがーげんしん) ',0.762,0.5]
syariraimoneasy['231']=[232.171,'入 我 我 入　(にゅーがーがーにゅう) ',0.835,0.5]
syariraimoneasy['232']=[233.006,'仏 加 持 故　(ぶつがーじーこ) ',0.802,0.5]
syariraimoneasy['233']=[233.809,'我 証 菩 提　(がーしょうぼーだい) ',0.853,0.5]
syariraimoneasy['234']=[234.662,'以 仏 神 力　(いーぶつじんりき) ',0.804,0.5]
syariraimoneasy['235']=[235.466,'利 益 衆 生　(りーやくしゅーじょう) ',0.859,0.5]
syariraimoneasy['236']=[236.325,'発 菩 提 心　(ほつぼーだいしん) ',0.805,0.5]
syariraimoneasy['237']=[237.13,'修 菩 薩 行　(しゅーぼーさつぎょう) ',0.834,0.5]
syariraimoneasy['238']=[237.964,'同 入 円 寂　(どうにゅうえんじゃく) ',0.767,0.5]
syariraimoneasy['239']=[238.731,'平 等 大 智　(びょうどうだいち) ',1.759,1]
syariraimoneasy['240']=[240.49,'今 将 頂 禮　(こんしょうちょうらい) ',4.928,1]
syariraimoneasy['242']=[245.418,'一 心 頂 禮　(いっしんちょうらい) ',0.8,0.5]
syariraimoneasy['243']=[246.218,'万 徳 円 満　(まんとくえんまん) ',0.839,0.5]
syariraimoneasy['244']=[247.056,'釈 迦 如 来　(しゃーかーにょらい) ',0.834,0.5]
syariraimoneasy['245']=[247.89,'真 身 舎 利　(しんじんしゃーり) ',0.849,0.5]
syariraimoneasy['246']=[248.739,'本 地 法 身　(ほんぢほっしん) ',0.799,0.5]
syariraimoneasy['247']=[249.538,'法 界 塔 婆　(ほっかいとうば) ',0.843,0.5]
syariraimoneasy['248']=[250.38,'我 等 禮 敬　(がーとうらいきょう) ',0.83,0.5]
syariraimoneasy['249']=[251.211,'為 我 現 身　(いーがーげんしん) ',0.835,0.5]
syariraimoneasy['250']=[252.046,'入 我 我 入　(にゅーがーがーにゅう) ',0.821,0.5]
syariraimoneasy['251']=[252.867,'仏 加 持 故　(ぶつがーじーこ) ',0.817,0.5]
syariraimoneasy['252']=[253.684,'我 証 菩 提　(がーしょうぼーだい) ',0.849,0.5]
syariraimoneasy['253']=[254.532,'以 仏 神 力　(いーぶつじんりき) ',0.824,0.5]
syariraimoneasy['254']=[255.357,'利 益 衆 生　(りーやくしゅーじょう) ',0.85,0.5]
syariraimoneasy['255']=[256.206,'発 菩 提 心　(ほつぼーだいしん) ',0.833,0.5]
syariraimoneasy['256']=[257.039,'修 菩 薩 行　(しゅーぼーさつぎょう) ',0.803,0.5]
syariraimoneasy['257']=[257.842,'同 入 円 寂　(どうにゅうえんじゃく) ',0.747,0.5]
syariraimoneasy['258']=[258.589,'平 等 大 智　(びょうどうだいち) ',1.723,1]
syariraimoneasy['260']=[260.312,'今 将 頂 禮　(こんしょうちょうらい) ',4.988,1]
syariraimoneasy['262']=[265.3,'一 心 頂 禮　(いっしんちょうらい) ',0.786,0.5]
syariraimoneasy['263']=[266.086,'万 徳 円 満　(まんとくえんまん) ',0.822,0.5]
syariraimoneasy['264']=[266.908,'釈 迦 如 来　(しゃーかーにょらい) ',0.861,0.5]
syariraimoneasy['265']=[267.77,'真 身 舎 利　(しんじんしゃーり) ',0.832,0.5]
syariraimoneasy['266']=[268.601,'本 地 法 身　(ほんぢほっしん) ',0.833,0.5]
syariraimoneasy['267']=[269.435,'法 界 塔 婆　(ほっかいとうば) ',0.805,0.5]
syariraimoneasy['268']=[270.239,'我 等 禮 敬　(がーとうらいきょう) ',0.844,0.5]
syariraimoneasy['269']=[271.083,'為 我 現 身　(いーがーげんしん) ',0.797,0.5]
syariraimoneasy['270']=[271.881,'入 我 我 入　(にゅーがーがーにゅう) ',0.813,0.5]
syariraimoneasy['271']=[272.693,'仏 加 持 故　(ぶつがーじーこ) ',0.851,0.5]
syariraimoneasy['272']=[273.544,'我 証 菩 提　(がーしょうぼーだい) ',0.824,0.5]
syariraimoneasy['273']=[274.369,'以 仏 神 力　(いーぶつじんりき) ',0.856,0.5]
syariraimoneasy['274']=[275.224,'利 益 衆 生　(りーやくしゅーじょう) ',0.844,0.5]
syariraimoneasy['275']=[276.068,'発 菩 提 心　(ほつぼーだいしん) ',0.832,0.5]
syariraimoneasy['276']=[276.9,'修 菩 薩 行　(しゅーぼーさつぎょう) ',0.825,0.5]
syariraimoneasy['277']=[277.724,'同 入 円 寂　(どうにゅうえんじゃく) ',0.71,0.5]
syariraimoneasy['278']=[278.434,'平 等 大 智　(びょうどうだいち) ',1.761,1]
syariraimoneasy['280']=[280.195,'今 将 頂 禮　(こんしょうちょうらい) ',11.555,1]
syariraimoneasy['289']=[291.75,'一 心 頂 禮　(いっしんちょうらい) ',0.84,0.5]
syariraimoneasy['290']=[292.59,'万 徳 円 満　(まんとくえんまん) ',0.835,0.5]
syariraimoneasy['291']=[293.425,'釈 迦 如 来　(しゃーかーにょらい) ',0.813,0.5]
syariraimoneasy['292']=[294.237,'真 身 舎 利　(しんじんしゃーり) ',0.842,0.5]
syariraimoneasy['293']=[295.079,'本 地 法 身　(ほんぢほっしん) ',0.83,0.5]
syariraimoneasy['294']=[295.909,'法 界 塔 婆　(ほっかいとうば) ',0.853,0.5]
syariraimoneasy['295']=[296.762,'我 等 禮 敬　(がーとうらいきょう) ',0.804,0.5]
syariraimoneasy['296']=[297.565,'為 我 現 身　(いーがーげんしん) ',0.843,0.5]
syariraimoneasy['297']=[298.408,'入 我 我 入　(にゅーがーがーにゅう) ',0.813,0.5]
syariraimoneasy['298']=[299.221,'仏 加 持 故　(ぶつがーじーこ) ',0.798,0.5]
syariraimoneasy['299']=[300.019,'我 証 菩 提　(がーしょうぼーだい) ',0.853,0.5]
syariraimoneasy['300']=[300.872,'以 仏 神 力　(いーぶつじんりき) ',0.814,0.5]
syariraimoneasy['301']=[301.686,'利 益 衆 生　(りーやくしゅーじょう) ',0.825,0.5]
syariraimoneasy['302']=[302.511,'発 菩 提 心　(ほつぼーだいしん) ',0.829,0.5]
syariraimoneasy['303']=[303.341,'修 菩 薩 行　(しゅーぼーさつぎょう) ',0.824,0.5]
syariraimoneasy['304']=[304.165,'同 入 円 寂　(どうにゅうえんじゃく) ',0.727,0.5]
syariraimoneasy['305']=[304.892,'平 等 大 智　(びょうどうだいち) ',1.778,1]
syariraimoneasy['306']=[306.671,'今 将 頂 禮　(こんしょうちょうらい) ',7.829,1]
syariraimoneasy['315']=[314.502,'end']


var syariraimoneasy_n=new Array()
var syariraimoneasy_n={
  "1":"",
'15':'たらつた',
'17':'わらつておとつていきつくさきはさしきろう',
'22':'ゆめもはててかなしいないきしこく',
'27':'ははは',
'28':'たらつた',
'30':'もつとたのしくうきよをいつしよにあゆみたい',
'35':'せいたくものはおともなくしぬかいい',
'40':'ほとけさま',
'45':'なつのあつさかみせる',
'50':'しんきろうにほくらのひとかけふたつ',
'58':'たのしいねうれしいな',
'65':'ここにほくらはいきているんた',
'78':'はかほしやの',
'90':'たたたたたたたた',
'92':'たたたたたたたた',
'94':'たたたたたたたた',
'96':'たたたたたたたた',
'98':'てててててててて',
'100':'てててててててて',
'102':'へへへへへへへへ',
'104':'へへへへへへへへ',
'106':'しやかよ',
'119':'ここまてきたら',
'121':'ふさけてさけんていきつくさきはほとけのし',
'126':'いこつになつてさみしいなしゆらのみち',
'131':'ははは',
'133':'ととのつまり',
'134':'ほくかゆるしうけたらなおんしらす',
'139':'なみたかなかれるよつらいよ',
'145':'ほとけさま',
'149':'なつのよそらかみせる',
'154':'なかれるほしにほくらのみらいかきえる',
'162':'かなしいねいやたよね',
'169':'すつとほくらはしにたくないよ',
'176':'たたたたたたたた',
'178':'たたたたたたたた',
'180':'たたたたたたたた',
'182':'たたたたたたたた',
'184':'てててててててて',
'186':'てててててててて',
'188':'へへへへへへへへ',
'190':'へへへへへへへへ',
'223':'い',
'224':'ま',
'225':'し',
'226':'し',
'227':'ほ',
'228':'ほ',
'229':'か',
'230':'い',
'231':'に',
'232':'ふ',
'233':'か',
'234':'い',
'235':'り',
'236':'ほ',
'237':'し',
'238':'と',
'239':'ひようとうたいち',
'240':'こんしようちようらい',
'242':'い',
'243':'ま',
'244':'し',
'245':'し',
'246':'ほ',
'247':'ほ',
'248':'か',
'249':'い',
'250':'に',
'251':'ふ',
'252':'か',
'253':'い',
'254':'り',
'255':'ほ',
'256':'し',
'257':'と',
'258':'ひようとうたいち',
'260':'こんしようちようらい',
'262':'い',
'263':'ま',
'264':'し',
'265':'し',
'266':'ほ',
'267':'ほ',
'268':'か',
'269':'い',
'270':'に',
'271':'ふ',
'272':'か',
'273':'い',
'274':'り',
'275':'ほ',
'276':'し',
'277':'と',
'278':'ひようとうたいち',
'280':'こんしようちようらい',
'289':'い',
'290':'ま',
'291':'し',
'292':'し',
'293':'ほ',
'294':'ほ',
'295':'か',
'296':'い',
'297':'に',
'298':'ふ',
'299':'か',
'300':'い',
'301':'り',
'302':'ほ',
'303':'し',
'304':'と',
'305':'ひようとうたいち',
'306':'こんしようちようらい',
"315":"end"
}

var syariraimoneasy_s=new Array()
var syariraimoneasy_s=[
15.636,15.748,15.834,15.968,
17.287,17.368,17.488,17.568,17.692,17.779,17.902,17.988,18.113,18.183,18.308,18.382,18.514,18.7,18.839,18.919,19.381,19.761,20.416,20.59,
22.248,22.458,22.538,22.66,22.852,22.951,23.055,23.272,23.397,23.501,23.685,23.903,24.52,24.746,25.122,25.604,
27.61,28.03,28.425,
28.872,28.949,29.091,29.168,
30.536,30.641,30.853,30.94,31.06,31.149,31.271,31.36,31.472,31.565,31.649,31.78,31.869,31.966,32.045,32.123,32.254,32.605,33.034,33.63,33.866,
35.505,35.583,35.705,35.794,35.914,36.099,36.205,36.32,36.529,36.636,36.768,36.951,37.17,37.755,37.977,38.372,38.794,
40.876,41.297,41.71,42.143,42.541,
45.421,46.035,46.253,47.089,47.497,47.917,48.318,48.735,49.356,49.576,
50.407,50.798,51.23,51.627,52.028,52.872,53.694,54.106,54.536,54.93,55.357,55.946,56.181,56.786,57.022,57.451,57.856,
58.697,59.283,59.521,60.107,60.324,61.972,62.577,62.805,63.426,63.653,
65.319,65.915,66.151,66.983,67.385,67.824,68.202,68.641,69.036,69.41,69.832,70.279,70.867,71.102,
78.125,81.016,83.954,86.764,86.86,89.788,
/*
90.123,90.211,90.449,90.535,90.737,90.939,91.034,91.245,91.369,91.568,91.78,91.972,
92.199,92.279,92.487,92.594,92.787,92.989,93.12,93.335,93.454,93.644,93.855,94.041,
94.23,94.33,94.557,94.651,94.863,95.072,95.188,95.379,95.495,95.687,95.915,96.1,
96.306,96.407,96.634,96.729,96.949,97.15,97.255,97.465,97.581,97.772,98.006,98.175,
98.393,98.5,98.711,98.806,99.009,99.211,99.323,99.535,99.654,99.839,100.057,100.223,
100.445,100.534,100.778,100.865,101.092,101.295,101.407,101.601,101.721,101.925,102.119,102.299,
102.531,102.635,102.863,102.967,103.145,103.362,103.459,103.667,103.793,103.992,104.197,104.396,
104.623,104.728,104.921,105.026,105.221,105.44,105.534,105.753,105.877,106.069,106.252,106.466,
*/
90.123,90.449,90.737,90.939,91.245,91.568,91.78,91.972,
92.199,92.487,92.787,92.989,93.335,93.644,93.855,94.041,
94.23,94.557,94.863,95.072,95.379,95.687,95.915,96.1,
96.306,96.634,96.949,97.15,97.465,97.772,98.006,98.175,
98.393,98.711,99.009,99.211,99.535,99.839,100.057,100.223,
100.445,100.778,101.092,101.295,101.601,101.925,102.119,102.299,
102.531,102.863,103.145,103.362,103.667,103.992,104.197,104.396,
104.623,104.921,105.221,105.44,105.753,106.069,106.252,106.466,

106.562,106.691,109.121,109.934,
119.956,120.026,120.15,120.254,120.361,120.536,120.642,
121.56,121.655,121.779,121.859,121.988,122.085,122.2,122.289,122.403,122.487,122.603,122.698,122.822,123.004,123.112,123.224,123.636,124.022,124.697,124.881,
126.502,126.587,126.703,126.818,126.932,127.123,127.236,127.352,127.588,127.677,127.781,127.975,128.211,128.308,128.814,129.035,129.481,129.875,
131.923,132.293,132.729,
133.089,133.178,133.448,133.547,133.651,133.887,
134.799,134.886,135.105,135.201,135.324,135.534,135.631,135.743,135.97,136.043,136.269,136.47,136.908,137.295,137.933,138.119,
139.787,139.881,140.004,140.093,140.214,140.481,140.583,140.9,141.013,141.435,142.053,142.238,142.677,
145.152,145.548,145.981,146.389,146.848,
149.702,150.306,150.535,151.384,151.778,152.217,152.602,153.049,153.628,153.853,
154.716,155.09,155.501,155.903,156.342,156.956,157.174,157.99,158.419,158.828,159.244,159.68,160.25,160.478,161.111,161.336,161.738,162.139,
162.963,163.536,163.782,164.377,164.639,166.259,166.875,167.118,167.732,167.953,
169.579,170.185,170.414,171.245,171.666,172.069,172.489,172.927,173.288,173.689,174.084,174.525,175.183,175.415,
/*
176.204,176.281,176.51,176.627,176.785,177.019,177.091,177.29,177.404,177.625,177.815,178.028,
178.254,178.344,178.572,178.675,178.869,179.08,179.156,179.41,179.483,179.701,179.901,180.105,
180.321,180.419,180.639,180.733,180.936,181.146,181.234,181.477,181.566,181.787,181.97,182.197,
182.398,182.484,182.696,182.793,182.994,183.215,183.3,183.547,183.635,183.843,184.057,184.274,
184.495,184.57,184.781,184.895,185.079,185.282,185.368,185.606,185.684,185.903,186.114,186.305,
186.526,186.639,186.822,186.946,187.13,187.331,187.409,187.662,187.759,188.005,188.179,188.398,
188.609,188.707,188.907,189.014,189.198,189.427,189.503,189.75,189.836,190.045,190.249,190.46,
190.679,190.774,190.985,191.099,191.273,191.5,191.57,191.825,191.914,192.141,192.317,192.552,
*/
176.204,176.51,176.785,177.019,177.29,177.625,177.815,178.028,
178.254,178.572,178.869,179.08,179.41,179.701,179.901,180.105,
180.321,180.639,180.936,181.146,181.477,181.787,181.97,182.197,
182.398,182.696,182.994,183.215,183.547,183.843,184.057,184.274,
184.495,184.781,185.079,185.282,185.606,185.903,186.114,186.305,
186.526,186.822,187.13,187.331,187.662,188.005,188.179,188.398,
188.609,188.907,189.198,189.427,189.75,190.045,190.249,190.46,
190.679,190.985,191.273,191.5,191.825,192.141,192.317,192.552,

225.883,226.683,227.487,228.356,229.203,230.01,230.854,231.71,232.471,233.306,234.109,234.962,235.766,236.625,237.43,238.264,
239.031,239.13,239.305,239.523,239.735,239.953,240.199,240.384,
240.79,240.97,241.462,241.539,241.744,242.338,242.442,242.636,244.091,244.29,

245.718,246.518,247.356,248.19,249.039,249.838,250.68,251.511,252.346,253.167,253.984,254.832,255.657,256.506,257.339,258.142,
258.889,258.985,259.142,259.379,259.579,259.817,260,260.219,
260.612,260.834,261.366,261.464,261.657,262.19,262.305,262.498,263.978,264.163,

265.6,266.386,267.208,268.07,268.901,269.735,270.539,271.383,272.181,272.993,273.844,274.669,275.524,276.368,277.2,278.024,
278.734,278.839,279.038,279.251,279.467,279.675,279.889,280.083,
280.495,280.688,281.21,281.29,281.518,282.123,282.265,282.414,283.805,284.016,

292.05,292.89,293.725,294.537,295.379,296.209,297.062,297.865,298.708,299.521,300.319,301.172,301.986,302.811,303.641,304.465,
305.192,305.306,305.5,305.726,305.935,306.156,306.365,306.56,
306.971,307.182,307.698,307.784,307.996,308.575,308.673,308.862,310.287,310.502]

var syariraimoneasy_demo=new Array()
syariraimoneasy_demo=[
't','r','t','t',
'w','r','t','t','a','t','t','t','a','k','t','k','s','k','h','s','s','k','r','a',
'y','m','m','h','t','t','k','n','s','a','n','a','k','s','k','k',
'h','h','h',
't','r','t','t',
'm','t','t','t','n','s','k','a','k','y','w','a','t','s','y','n','a','y','m','t','a',
's','a','t','k','m','n','h','a','t','m','n','k','s','n','k','a','a',
'h','t','k','s','m',
'n','t','n','a','t','s','k','m','s','r',
's','w','k','r','a','n','h','k','r','n','h','t','k','k','h','t','t',
't','n','s','a','n','a','r','s','a','n',
'k','k','n','h','k','r','h','a','k','t','a','r','w','t',
'h','k','h','s','y','n',
't','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t',
'h','h','h','h','h','h','h','h',
'h','h','h','h','h','h','h','h',
's','y','k','y',
'k','k','m','t','k','t','r',
'h','s','k','t','s','k','w','t','a','k','t','k','s','k','h','h','t','k','n','s',
'a','k','t','n','n','t','t','s','m','s','a','n','s','y','r','n','m','t',
'h','h','h',
't','t','n','t','m','r',
'h','k','k','y','r','s','a','k','t','r','n','a','w','s','r','s',
'n','m','t','k','n','k','r','r','y','t','r','a','y',
'h','t','k','s','m',
'n','t','n','y','s','r','k','m','s','r',
'n','k','r','r','h','s','n','h','k','r','n','m','r','a','k','k','a','r',
'k','n','s','a','n','a','y','t','y','n',
's','t','t','h','k','r','h','s','n','t','k','n','a','y',
't','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t',
't','t','t','t','t','t','t','t',
'h','h','h','h','h','h','h','h',
'h','h','h','h','h','h','h','h',
'a',
'm',
's',
's',
'h',
'h',
'k',
'a',
'n',
'h',
'k',
'a',
'r',
'h',
's',
't',
'h','y','a','t','a','t','a','t',
'k','w','s','y','a','t','y','a','r','a',
'a',
'm',
's',
's',
'h',
'h',
'k',
'a',
'n',
'h',
'k',
'a',
'r',
'h',
's',
't',
'h','y','a','t','a','t','a','t',
'k','w','s','y','a','t','y','a','r','a',
'a',
'm',
's',
's',
'h',
'h',
'k',
'a',
'n',
'h',
'k',
'a',
'r',
'h',
's',
't',
'h','y','a','t','a','t','a','t',
'k','w','s','y','a','t','y','a','r','a',
'a',
'm',
's',
's',
'h',
'h',
'k',
'a',
'n',
'h',
'k',
'a',
'r',
'h',
's',
't',
'h','y','a','t','a','t','a','t',
'k','w','s','y','a','t','y','a','r','a'
]

var suzumeirocondensare=new Array()
suzumeirocondensare['0']=[0,"(前奏)",41.621,0.3,36.621,5]
suzumeirocondensare['2']=[2,'(前奏)',39.621,0.3,30.221,11.4]
suzumeirocondensare['41']=[41.621,'暮れ泥む夕陽',4.109,0.3]
suzumeirocondensare['46']=[45.73,'その変わらないオレンジの色',6.886,0.3]
suzumeirocondensare['52']=[52.616,'投影してゆく',4.076,0.3]
suzumeirocondensare['56']=[56.692,'今、幻想に交差してゆく',10.976,0.3]
suzumeirocondensare['67']=[67.668,'もしも、今ぼくがいなくなったとしても',6.849,0.3]
suzumeirocondensare['74']=[74.517,'この木洩れ陽は君を照らすから',5.512,0.3]
suzumeirocondensare['80']=[80.029,'木霊する言葉は吸い込まれて',7.169,0.3]
suzumeirocondensare['87']=[87.198,'空に溶けてゆく',6,0.3]
suzumeirocondensare['93']=[93.198,'(間奏)',8.779,0.3]
suzumeirocondensare['102']=[101.977,'「あなたの瞳が',5.455,0.3]
suzumeirocondensare['107']=[107.432,'かつて映し出そうとした',5.513,0.3]
suzumeirocondensare['113']=[112.945,'淡い光では',4.109,0.3]
suzumeirocondensare['117']=[117.054,'もう　この夜を照らせはしない」',10.946,0.3]
suzumeirocondensare['128']=[128,'そして、その優しい手の温もりだけが',6.866,0.3]
suzumeirocondensare['135']=[134.866,'僕の生命を輝かせている',5.492,0.3]
suzumeirocondensare['140']=[140.358,'だから君の言葉を探している',7.204,0.3]
suzumeirocondensare['147']=[147.562,'蜃気楼の中で',9,0.3]
suzumeirocondensare['156']=[156.562,'(間奏)',38.66,0.3,190.222,5]
suzumeirocondensare['195']=[195.222,'今、僕らが魅ていたその夢で',5.504,0.3]
suzumeirocondensare['201']=[200.726,'零れた星くずに手を伸ばした',5.473,0.3]
suzumeirocondensare['206']=[206.199,'木霊する言葉は吸い込まれて',7.177,0.3]
suzumeirocondensare['213']=[213.376,'空に溶けてゆく',7.395,0.3]
suzumeirocondensare['221']=[220.771,'end']

var suzumeirocondensare_n=new Array()
var suzumeirocondensare_n={
  "1":"",
'41':'くれなすむゆうひ',
'46':'そのかわらないおれんしのいろ',
'52':'とうえいしてゆく',
'56':'いまけんそうにこうさしてゆく',
'67':'もしもいまほくかいなくなつたとしても',
'74':'このこもれひはきみをてらすから',
'80':'こたますることははすいこまれて',
'87':'そらにとけてゆく',
'93':'',
'102':'あなたのひとみか',
'107':'かつてうつしたそうとした',
'113':'あわいひかりては',
'117':'もうこのよるをてらせはしない',
'128':'そしてそのやさしいてのぬくもりたけか',
'135':'ほくのいのちをかかやかせている',
'140':'たからきみのことはをさかしている',
'147':'しんきろうのなかて',
'156':'',
'195':'いまほくらかみていたそのゆめて',
'201':'こほれたほしくすにてをのはした',
'206':'こたますることははすいこまれて',
'213':'そらにとけてゆく',
"221":"end"
  }


var suzumeirocondensare_s=new Array()
var suzumeirocondensare_s=[
41.921,42.242,42.4,42.919,43.295,43.654,44.015,44.494,
46.03,46.382,47.412,47.746,47.905,48.393,48.773,48.927,49.273,49.901,50.498,51.146,51.523,51.68,
52.916,53.241,53.427,53.854,54.24,54.59,54.96,55.465,
56.992,57.366,58.374,58.741,58.889,59.382,59.733,59.887,60.407,60.974,61.451,62.129,62.489,62.659,
67.968,68.327,68.502,69.344,69.719,70.06,70.394,70.727,71.077,71.402,71.725,72.102,72.445,72.761,73.131,73.459,73.81,74.169,
74.817,75.186,75.372,75.826,76.185,76.545,76.913,77.246,77.568,77.919,78.278,78.596,78.957,79.294,79.644,
80.329,80.682,80.857,81.356,81.698,82.03,82.39,82.731,83.053,83.396,83.767,84.098,84.441,84.806,85.157,
87.498,87.672,87.875,88.338,88.866,89.549,89.951,90.143,
102.277,102.618,102.793,103.3,103.658,104.01,104.333,104.842,
107.732,108.083,108.251,108.75,109.136,109.319,109.636,110.276,110.828,111.509,111.869,112.046,
113.245,113.596,113.792,114.252,114.639,114.979,115.331,115.796,
117.354,117.713,118.722,119.064,119.236,119.755,120.096,120.273,120.604,121.235,121.799,122.487,122.837,123.042,
128.3,128.654,128.839,129.698,130.054,130.408,130.75,131.11,131.424,131.75,132.109,132.433,132.775,133.108,133.448,133.8,134.148,134.5,
135.166,135.507,135.665,136.182,136.525,136.884,137.218,137.557,137.916,138.26,138.592,138.926,139.276,139.627,139.997,
140.658,141.001,141.169,141.675,142.026,142.368,142.711,143.059,143.42,143.754,144.112,144.427,144.789,145.128,145.47,145.653,
147.862,148.009,148.222,148.746,148.957,149.273,149.948,150.298,150.464,
195.522,195.89,196.233,196.547,196.898,197.251,197.565,197.905,198.257,198.626,198.94,199.288,199.639,199.983,200.345,
201.026,201.368,201.525,201.999,202.349,202.707,203.076,203.408,203.733,204.101,204.425,204.786,205.118,205.46,205.827,
206.499,206.835,206.999,207.465,207.843,208.227,208.561,208.921,209.235,209.594,209.909,210.251,210.596,210.935,211.312,
213.676,213.842,214.037,214.499,214.991,215.717,216.129,216.771]

var suzumeirocondensare_demo=new Array()
suzumeirocondensare_demo=[
'k','r','n','s','m','y','a','h',
's','n','k','w','r','n','a','a','r','w','s','n','a','r',
't','a','a','a','s','t','y','k',
'a','m','k','w','s','a','n','k','a','s','s','t','y','k',
'm','s','m','a','m','h','k','k','a','n','k','n','t','t','t','s','t','m',
'k','n','k','m','r','h','h','k','m','w','t','r','s','k','r',
'k','t','m','s','r','k','t','h','h','s','a','k','m','r','t',
's','r','n','t','k','t','y','k',
'a','n','t','n','h','t','m','k',
'k','t','t','a','t','s','t','s','a','t','s','t',
'a','w','a','h','k','r','t','h',
'm','a','k','n','y','r','w','t','r','s','h','s','n','a',
's','s','t','s','n','y','s','s','a','t','n','n','k','m','r','t','k','k',
'h','k','n','a','n','t','w','k','k','y','k','s','t','a','r',
't','k','r','k','m','n','k','t','h','w','s','k','s','t','a','r',
's','w','k','r','a','n','n','k','t',
'a','m','h','k','r','k','m','t','a','t','s','n','y','m','t',
'k','h','r','t','h','s','k','s','n','t','w','n','h','s','t',
'k','t','m','s','r','k','t','h','h','s','a','k','m','r','t',
's','r','n','t','k','t','y','k'
]

var imaginativejourney=new Array()
imaginativejourney['0']=[0,'(前奏)',36.636,0,31.836,4.8]
imaginativejourney['2']=[2,'(前奏)',34.636,0,31.836,4.8]
//imaginativejourney['2']=[2,'(前奏)',34.636,0,46.245,5]
//imaginativejourney['17']=[17,'(森を抜けるとそこは...)',10,0.4]
//imaginativejourney['27']=[27,'(...電子世界の妖精が住む大きなまちでした)',9.636,0.4]
imaginativejourney['36']=[36.636,'ここはどこだろう',4.187,0.4]
imaginativejourney['41']=[40.823,'いつの間にか抜けた先に',5.422,0.4]
imaginativejourney['46']=[46.245,'光が降り注ぐ場所をみつけました',8.9,0.4]
imaginativejourney['55']=[55.145,'(間奏)',19.814,0.4,69.661,5.398]
imaginativejourney['75']=[75.059,'生き物たちはみな',4.794,0.4]
imaginativejourney['80']=[79.853,'ぬるぬる動きます',4.785,0.5]
imaginativejourney['84']=[84.638,'それはそれはとても高い天井には',4.827,0.8]
imaginativejourney['89']=[89.465,'青と白の模様が描かれています',4.807,0.8]
imaginativejourney['94']=[94.272,'電子世界の忘れられた片隅に',5.362,0.6]
imaginativejourney['99']=[99.634,'存在する懐かしいリアル',4.229,0.6]
imaginativejourney['104']=[103.864,'永遠に動かない太陽が',4.785,0.4]
imaginativejourney['108']=[108.648,'私たちを引き留める',6.007,0.4]
imaginativejourney['114']=[114.655,'いつか旅してきた場所も',4.804,0.4]
imaginativejourney['119']=[119.459,'いつか辿りつくあの場所も',4.811,0.4]
imaginativejourney['124']=[124.27,'自由であることは変わりないんだ',5.7,0.4]
imaginativejourney['132']=[129.97,'(間奏)',21.591,0.4,151.162,2.399]
imaginativejourney['151']=[151.561,'るらりらるら　るらりるら',4.795,0.3]
imaginativejourney['156']=[156.356,'るらりらるら　るらりるら',4.795,0.3]
imaginativejourney['161']=[161.151,'るらりらるら　るらりるら',4.804,0.3]
imaginativejourney['166']=[165.955,'るらりらるら　るらりるら',4.791,0.3]
imaginativejourney['171']=[170.746,'るらりらるら　るらりるら',4.803,0.3]
imaginativejourney['175']=[175.549,'るらりらるら　るらりるら',4.802,0.3]
imaginativejourney['180']=[180.351,'るらりらるら　るらりるら',4.782,0.3]
imaginativejourney['185']=[185.133,'るらりらるら　るらりるら',4.804,0.3]
imaginativejourney['190']=[189.937,'「私はいまどこにいるのでしょうか」',9.584,0.4]
imaginativejourney['199']=[199.521,'「ここはあなたの行きつく先です」',9.619,0.4]
imaginativejourney['209']=[209.14,'「私はいまどこにいるのでしょうか」',9.603,0.4]
imaginativejourney['219']=[218.744,'「ここはあなたの行きつく先です」',9.295,0.4]
imaginativejourney['228']=[228.038,'うたい',4.829,0.3]
imaginativejourney['233']=[232.867,'おどり',4.808,0.3]
imaginativejourney['237']=[237.675,'かたり',4.769,0.3]
imaginativejourney['242']=[242.443,'わらい',4.85,0.3]
imaginativejourney['247']=[247.294,'うたい',4.765,0.3]
imaginativejourney['252']=[252.059,'おどり',4.796,0.3]
imaginativejourney['257']=[256.854,'かたり',4.791,0.3]
imaginativejourney['261']=[261.645,'わらい',4.636,0.3]
imaginativejourney['266']=[266.281,'end']

var imaginativejourney_n=new Array()
var imaginativejourney_n={
  "1":"",
'36':'ここはとこたろう',
'41':'いつのまにかぬけたさきに',
'46':'ひかりかふりそそくはしよをみつけました',
'55':'',
'75':'いきものたちはみな',
'80':'ぬるぬるうこきます',
'84':'それはそれはとてもたかいてんしようには',
'89':'あおとしろのもようかえかかれています',
'94':'てんしせかいのわすれられたかたすみに',
'99':'そんさいするなつかしいりある',
'104':'えいえんにうこかないたいようか',
'108':'わたしたちをひきとめる',
'114':'いつかたひしてきたはしよも',
'119':'いつかたとりつくあのはしよも',
'124':'しゆうてあることはかわりないんた',
'132':'',
'151':'るらりらるらるらりるら',
'156':'るらりらるらるらりるら',
'161':'るらりらるらるらりるら',
'166':'るらりらるらるらりるら',
'171':'るらりらるらるらりるら',
'175':'るらりらるらるらりるら',
'180':'るらりらるらるらりるら',
'185':'るらりらるらるらりるら',
'190':'わたしはいまとこにいるのてしようか',
'199':'ここはあなたのいきつくさきてす',
'209':'わたしはいまとこにいるのてしようか',
'219':'ここはあなたのいきつくさきてす',
'228':'うたい',
'233':'おとり',
'237':'かたり',
'242':'わらい',
'247':'うたい',
'252':'おとり',
'257':'かたり',
'261':'わらい',
'266':'end'
}

var imaginativejourney_s=new Array()
var imaginativejourney_s=[
36.936,37.532,37.679,38.433,38.748,39.022,39.521,39.959,
41.123,41.218,41.422,42.07,42.36,42.482,42.936,43.225,43.515,43.822,44.285,44.75,
46.545,46.687,46.835,47.126,47.789,47.94,48.052,48.347,48.669,49.096,50.481,50.56,50.771,51.31,51.63,51.919,52.215,52.678,53.108,
75.359,75.46,75.637,75.76,76.225,76.538,76.682,79.247,79.51,
80.153,80.257,80.416,80.976,81.249,81.346,81.879,81.976,82.055,
84.938,85.087,85.218,86.182,86.305,86.454,87.347,87.477,87.619,87.924,88.056,88.144,88.345,88.492,88.775,88.903,88.978,89.134,89.275,
89.765,89.905,90.036,90.204,90.343,90.439,90.614,90.941,91.063,91.22,92.122,92.251,92.411,92.76,93.042,93.375,93.486,93.673,
94.572,94.687,94.853,94.975,95.455,95.755,95.903,96.947,97.104,97.243,97.401,97.533,97.671,97.83,98.137,98.47,98.75,99.04,
99.934,100.073,100.213,100.37,100.521,100.659,101.151,101.282,101.441,101.757,101.867,102.186,102.5,102.647,
104.164,104.279,104.446,104.596,104.743,105.338,105.488,105.637,105.917,106.242,106.835,107.46,107.758,108.056,108.345,
108.948,109.097,109.238,109.395,109.86,110.305,110.763,110.893,111.059,111.516,111.952,
114.955,115.097,115.271,115.55,115.876,116.165,116.48,116.761,117.048,117.374,117.655,117.769,117.963,
119.759,119.89,120.063,120.371,120.494,120.659,120.934,121.256,121.553,121.867,122.158,122.483,122.622,122.785,
124.57,124.843,125.148,125.447,125.762,126.079,126.375,126.656,126.969,127.557,127.689,127.867,128.461,128.61,128.741,128.907,
151.861,152.298,152.446,152.867,153.052,153.638,154.273,154.702,154.864,155.277,155.44,
156.656,157.098,157.239,157.678,157.834,158.412,159.06,159.489,159.658,160.087,160.244,
161.451,161.871,162.031,162.479,162.626,163.242,163.838,164.301,164.448,164.887,165.036,
166.255,166.682,166.84,167.277,167.429,168.032,168.664,169.094,169.251,169.691,169.847,
171.046,171.475,171.644,172.098,172.247,172.834,173.438,173.893,174.04,174.489,174.665,
175.849,176.302,176.433,176.908,177.065,177.646,178.25,178.695,178.862,179.301,179.457,
180.651,181.089,181.255,181.69,181.858,182.446,183.05,183.488,183.654,184.065,184.231,
185.433,185.898,186.046,186.484,186.625,187.247,187.861,188.307,188.463,188.895,189.06,
190.237,191.174,191.323,191.445,192.383,192.489,192.636,193.122,193.224,193.512,193.821,194.432,194.729,195.003,195.088,196.241,198.648,
199.821,200.785,200.906,201.066,201.959,202.091,202.256,202.685,202.818,203.443,203.741,204.063,204.337,204.666,205.849,
209.44,210.354,210.495,210.651,211.579,211.674,211.85,212.313,212.435,212.736,213.034,213.663,213.965,214.224,214.315,215.441,217.878,
219.044,219.971,220.076,220.26,221.138,221.296,221.464,221.883,222.014,222.628,222.924,223.239,223.539,223.839,225.062,
228.338,228.45,228.645,
233.167,233.305,233.47,
237.975,238.114,238.282,
242.743,242.892,243.066,
247.594,247.735,247.891,
252.359,252.509,252.674,
257.154,257.312,257.477,
261.945,262.096,262.281
]

var imaginativejourney_demo=new Array()
imaginativejourney_demo=[
'k','k','h','t','k','t','r','a',
'a','t','n','m','n','k','n','k','t','s','k','n',
'h','k','r','k','h','r','s','s','k','h','s','y','w','m','t','k','m','s','t',
'a','k','m','n','t','t','h','m','n',
'n','r','n','r','a','k','k','m','s',
's','r','h','s','r','h','t','t','m','t','k','a','t','w','s','y','a','n','h',
'a','a','t','s','r','n','m','y','a','k','a','k','k','r','t','a','m','s',
't','w','s','s','k','a','n','w','s','r','r','r','t','k','t','s','m','n',
's','w','s','a','s','r','n','t','k','s','a','r','a','r',
'a','a','a','w','n','a','k','k','n','a','t','a','y','a','k',
'w','t','s','t','t','w','h','k','t','m','r',
'a','t','k','t','h','s','t','k','t','h','s','y','m',
'a','t','k','t','t','r','t','k','a','n','h','s','y','m',
's','y','a','t','a','r','k','t','h','k','w','r','n','a','w','t',
'r','r','r','r','r','r','r','r','r','r','r',
'r','r','r','r','r','r','r','r','r','r','r',
'r','r','r','r','r','r','r','r','r','r','r',
'r','r','r','r','r','r','r','r','r','r','r',
'r','r','r','r','r','r','r','r','r','r','r',
'r','r','r','r','r','r','r','r','r','r','r',
'r','r','r','r','r','r','r','r','r','r','r',
'r','r','r','r','r','r','r','r','r','r','r',
'w','t','s','h','a','m','t','k','n','a','r','n','t','s','y','a','k',
'k','k','h','a','n','t','n','a','k','t','k','s','k','t','s',
'w','t','s','h','a','m','t','k','n','a','r','n','t','s','y','a','k',
'k','k','h','a','n','t','n','a','k','t','k','s','k','t','s',
'a','t','a',
'a','t','r',
'k','t','r',
'w','r','a',
'a','t','a',
'a','t','r',
'k','t','r',
'w','r','a'
]

var quiet=new Array()
quiet['0']=[0,'(前奏)',24.991,0.3,19.991,5]
quiet['2']=[2,'(前奏)',22.991,0.3,19.991,5]
quiet['25']=[24.991,'誰も知らない道に　足音ふたつ',12.117,0.3]
quiet['37']=[37.108,'夜に落ちてく雪に　灯りがこぼれていく',13.45,0.3]
quiet['50']=[50.559,'繋がってゆく日々をそっと描いたなら',12.132,0.3]
quiet['62']=[62.691,'消えないように夢をみる',10.655,0.3]
quiet['73']=[73.346,'手を伸ばせば広がっていく',6.072,0.3]
quiet['79']=[79.418,'声にならない時を過ごす',6.089,0.3]
quiet['85']=[85.507,'いつの間にか重なってゆく',6.085,0.3]
quiet['91']=[91.592,'影の形をなぞる',18.473,0.3]
quiet['110']=[110.065,'オレンジ色の街に　足音ふたつ',11.891,0.3]
quiet['122']=[121.956,'見上げた空にひとつ　涙がこぼれていく',13.666,0.3]
quiet['135']=[135.622,'繋がってゆく朝をそっと迎えたなら',12.162,0.3]
quiet['148']=[147.784,'消えないように夢をみる',10.6,0.3]
quiet['158']=[158.384,'手を伸ばせば広がっていく',6.099,0.3]
quiet['164']=[164.483,'声にならない時を過ごす',6.08,0.3]
quiet['170']=[170.563,'いつの間にか重なってゆく',6.072,0.3]
quiet['176']=[176.635,'二人の道をなぞる',6.482,0.3]
quiet['183']=[183.117,'静かに奏でた　ふたつのメロディ',12.102,0.3]
quiet['195']=[195.219,'夜空に浮かべた　言葉を重ねて',15.705,0.3]
quiet['211']=[210.924,'end']

var quiet_n=new Array()
quiet_n={
  "1":"",
'25':'たれもしらないみちにあしおとふたつ',
'37':'よるにおちてくゆきにあかりかこほれていく',
'50':'つなかつてゆくひひをそつとえかいたなら',
'62':'きえないようにゆめをみる',
'73':'てをのはせはひろかつていく',
'79':'こえにならないときをすこす',
'85':'いつのまにかかさなつてゆく',
'91':'かけのかたちをなそる',
'110':'おれんしいろのまちにあしおとふたつ',
'122':'みあけたそらにひとつなみたかこほれていく',
'135':'つなかつてゆくあさをそつとむかえたなら',
'148':'きえないようにゆめをみる',
'158':'てをのはせはひろかつていく',
'164':'こえにならないときをすこす',
'170':'いつのまにかかさなつてゆく',
'176':'ふたりのみちをなそる',
'183':'しすかにかなてたふたつのめろてい',
'195':'よそらにうかへたことはをかさねて',
'211':'end'
}
var quiet_s=new Array()
quiet_s=[
25.291,25.469,25.825,25.992,26.56,26.938,27.342,29.596,29.988,30.54,32.626,33.021,33.371,34.143,34.904,35.657,36.444,
37.408,37.594,37.962,38.138,38.697,39.047,39.454,41.763,42.132,42.682,44.795,45.179,45.549,46.284,46.68,47.046,47.791,48.589,48.765,48.974,
50.859,51.228,51.602,51.953,52.382,53.137,53.873,54.64,55.412,55.772,56.133,56.491,56.902,57.719,58.086,58.803,59.171,59.968,60.923,
62.991,63.38,63.772,64.142,64.527,65.272,66.043,66.787,67.163,67.749,68.314,69.081,
73.646,74.023,74.407,74.785,75.364,75.896,76.686,77.038,77.421,77.791,78.211,78.588,79.184,
79.718,80.095,80.463,80.867,81.444,82.023,82.384,82.803,83.512,84.317,84.695,85.047,85.203,
85.807,86.148,86.56,86.947,87.525,88.066,88.83,89.208,89.583,89.952,90.364,90.739,91.302,
91.892,92.283,92.635,93.046,93.569,94.138,94.911,95.655,96.408,97.178,
110.365,110.514,110.899,111.06,111.657,111.99,112.407,114.703,115.054,115.623,117.716,118.112,118.496,119.231,119.968,120.731,121.512,
122.256,122.658,123.026,123.254,123.779,124.146,124.507,126.809,127.188,127.756,129.85,130.229,130.639,131.347,131.742,132.112,132.909,133.653,133.827,134.02,
135.922,136.301,136.667,137.02,137.439,138.165,138.972,139.741,140.48,140.864,141.225,141.61,141.97,142.748,143.099,143.861,144.263,145.053,145.974,
148.084,148.451,148.846,149.206,149.583,150.318,151.106,151.86,152.22,152.815,153.376,154.156,
158.684,159.07,159.466,159.832,160.419,160.964,161.741,162.102,162.496,162.865,163.287,163.645,164.195,
164.783,165.186,165.536,165.95,166.49,167.05,167.419,167.813,168.543,169.356,169.742,170.092,170.286,
170.863,171.239,171.599,171.978,172.597,173.143,173.903,174.299,174.683,175.043,175.447,175.814,176.392,
176.935,177.32,177.699,178.1,178.628,179.195,179.973,180.693,181.465,182.244,
183.417,184.172,184.9,185.679,186.434,187.193,187.958,188.71,189.479,190.209,190.981,191.741,192.486,192.874,193.659,194.403,
195.519,196.296,197.026,197.83,198.565,199.329,200.074,200.863,201.651,202.396,203.149,203.895,204.62,205.024,205.768,206.924
]

var quiet_demo=new Array()
quiet_demo=[
't','r','m','s','r','n','a','m','t','n','a','s','a','t','h','t','t',
'y','r','n','a','t','t','k','y','k','n','a','k','r','k','k','h','r','t','a','k',
't','n','k','t','t','y','k','h','h','w','s','t','t','a','k','a','t','n','r',
'k','a','n','a','y','a','n','y','m','w','m','r',
't','w','n','h','s','h','h','r','k','t','t','a','k',
'k','a','n','n','r','n','a','t','k','w','s','k','s',
'a','t','n','m','n','k','k','s','n','t','t','y','k',
'k','k','n','k','t','t','w','n','s','r',
'a','r','w','s','a','r','n','m','t','n','a','s','a','t','h','t','t',
'm','a','k','t','s','r','n','h','t','t','n','m','t','k','k','h','r','t','a','k',
't','n','k','t','t','y','k','a','s','w','s','t','t','m','k','a','t','n','r',
'k','a','n','a','y','a','n','y','m','w','m','r',
't','w','n','h','s','h','h','r','k','t','t','a','k',
'k','a','n','n','r','n','a','t','k','w','s','k','s',
'a','t','n','m','n','k','k','s','n','t','t','y','k',
'h','t','r','n','m','t','w','n','s','r',
's','s','k','n','k','n','t','t','h','t','t','n','m','r','t','a',
'y','s','r','n','a','k','h','t','k','t','h','w','k','s','n','t'
]

var sorairoradio=new Array()
sorairoradio['0']=[0,'(前奏)',23.92,0.3,18.92,5]
sorairoradio['2']=[2,'(前奏)',21.92,0.3,18.92,5]
sorairoradio['24']=[23.92,'さあ今日もお届け',5.885,0.3]
sorairoradio['30']=[29.805,'耳を澄ませておいて！',5.041,0.3]
sorairoradio['35']=[34.846,'雨の朝を彩るように',5.677,0.3]
sorairoradio['40']=[40.523,'空に音の虹をかけてく',11.31,0.3]
sorairoradio['52']=[51.834,'桜の舞う風に乗りどこまでも届くラジオ',11.399,0.3]
sorairoradio['63']=[63.233,'昼も夜もそっと耳を澄ませば',8.19,0.3]
sorairoradio['71']=[71.423,'すぐに空が聞こえるよ',15.377,0.3]
sorairoradio['87']=[86.8,'午前中の雨',5.745,0.3]
sorairoradio['92']=[92.545,'水たまりに映る空',5.128,0.3]
sorairoradio['97']=[97.673,'遠く響くの',2.725,0.3]
sorairoradio['100']=[100.398,'雨上がりの雲のすきま　から',7.473,0.3]
sorairoradio['108']=[107.871,'聞こえる？',24.786,0.3]
sorairoradio['132']=[132.657,'オレンジ空の涙色も',5.904,0.3]
sorairoradio['138']=[138.561,'優しい歌で君を包むよ',10.374,0.3]
sorairoradio['149']=[148.935,'空を泳ぐ星に乗り流れる空色ラジオ',11.398,0.3]
sorairoradio['160']=[160.333,'夜空に舞う昨日の夢の続き　君へと',11.478,0.3]
sorairoradio['172']=[171.811,'君のもとへいつだって届くよ空色ラジオ',11.41,0.3]
sorairoradio['183']=[183.221,'どんな空も君だけの歌にかえて',8.208,0.3]
sorairoradio['191']=[191.429,'すぐに届けにいくよ',13.23,0.3]
sorairoradio['204']=[204.659,'届けにいくよ',6.597,0.3]
sorairoradio['211']=[211.256,'end']

var sorairoradio_n=new Array()
sorairoradio_n={
  "1":"",
'24':'さあきようもおととけ',
'30':'みみをすませておいて',
'35':'あめのあさをいろとるように',
'40':'そらにおとのにしをかけてく',
'52':'さくらのまうかせにのりとこまてもととくらしお',
'63':'ひるもよるもそつとみみをすませは',
'71':'すくにそらかきこえるよ',
'87':'こせんしゆうのあめ',
'92':'みすたまりにうつるそら',
'97':'とおくひひくの',
'100':'あめあかりのくものすきまから',
'108':'きこえる',
'132':'おれんしそらのなみたいろも',
'138':'やさしいうたてきみをつつむよ',
'149':'そらをおよくほしにのりなかれるそらいろらしお',
'160':'よそらにまうきのうのゆめのつつききみへと',
'172':'きみのもとへいつたつてととくよそらいろらしお',
'183':'とんなそらもきみたけのうたにかえて',
'191':'すくにととけにいくよ',
'204':'ととけにいくよ',
'211':'end'
}
var sorairoradio_s=new Array()
sorairoradio_s=[
24.22,24.605,24.73,24.833,25.129,25.647,26.033,26.207,26.567,26.926,
30.105,30.253,30.439,30.789,31.37,31.728,31.909,32.269,32.439,32.604,
35.146,35.645,36.019,36.334,36.537,36.888,37.246,37.817,38.167,38.527,38.711,39.043,39.395,
40.823,41.357,41.725,42.073,42.277,42.619,43.02,43.334,43.695,46.035,46.191,46.543,47.219,
52.134,52.325,52.824,52.993,53.351,53.683,55.129,55.647,55.839,56.19,56.551,57.969,58.473,58.87,59.037,59.387,59.752,60.098,60.465,60.823,62.059,62.246,
63.533,63.699,64.24,64.416,64.776,65.099,66.339,66.736,67.097,67.449,67.623,67.965,68.378,68.727,69.096,69.408,
71.723,71.897,72.284,73.519,73.878,74.062,74.403,74.753,75.112,76.567,76.751,
87.1,87.488,87.651,88.019,88.229,88.565,88.914,89.083,89.456,
92.845,93.214,93.345,93.697,94.243,94.627,94.784,95.126,96.213,96.378,96.749,
97.973,98.509,98.893,99.254,99.41,99.767,100.137,
100.698,101.048,101.4,101.582,101.925,102.283,103.684,104.23,104.613,104.938,105.141,105.667,106.033,106.549,
108.171,108.331,108.706,109.251,
132.957,133.133,133.516,133.692,134.042,134.406,134.769,135.111,135.296,135.673,135.85,136.192,136.586,
138.861,139.234,139.399,139.898,140.285,140.652,140.824,141.722,142.089,142.262,143.139,143.32,143.708,146.537,
149.235,149.431,149.949,150.119,150.488,150.812,152.224,152.774,152.978,153.338,153.703,155.098,155.642,156.016,156.211,156.571,156.931,157.287,157.666,157.999,159.197,159.392,
160.633,160.828,161.36,161.563,161.92,162.256,163.483,163.876,164.237,164.401,164.744,165.095,165.462,165.82,166.198,166.532,168.907,169.071,169.458,170.853,
172.111,172.279,172.78,172.97,173.349,173.688,175.083,175.645,175.846,176.205,176.564,177.947,178.493,178.884,179.052,179.419,179.796,180.129,180.514,180.899,182.056,182.258,
183.521,183.704,184.22,184.423,184.764,185.104,185.992,186.358,186.752,187.113,187.269,187.638,187.979,188.33,188.699,189.037,189.39,
191.729,191.905,192.248,193.533,193.921,194.111,194.454,194.798,195.155,196.531,
204.959,205.338,205.487,205.837,206.195,206.555,207.256
]

var sorairoradio_demo=new Array()
sorairoradio_demo=[
's','a','k','y','a','m','a','t','t','k',
'm','m','w','s','m','s','t','a','a','t',
'a','m','n','a','s','w','a','r','t','r','y','a','n',
's','r','n','a','t','n','n','s','w','k','k','t','k',
's','k','r','n','m','a','k','s','n','n','r','t','k','m','t','m','t','t','k','r','s','a',
'h','r','m','y','r','m','s','t','t','m','m','w','s','m','s','h',
's','k','n','s','r','k','k','k','a','r','y',
'k','s','w','s','y','a','n','a','m',
'm','s','t','m','r','n','a','t','r','s','r',
't','a','k','h','h','k','n',
'a','m','a','k','r','n','k','m','n','s','k','m','k','r',
'k','k','a','r',
'a','r','w','s','s','r','n','n','m','t','a','r','m',
'y','s','s','a','a','t','t','k','m','w','t','t','m','y',
's','r','w','a','y','k','h','s','n','n','r','n','k','r','r','s','r','a','r','r','s','a',
'y','s','r','n','m','a','k','n','a','n','y','m','n','t','t','k','k','m','h','t',
'k','m','n','m','t','h','a','t','t','t','t','t','t','k','y','s','r','a','r','r','s','a',
't','w','n','s','r','m','k','m','t','k','n','a','t','n','k','a','t',
's','k','n','t','t','k','n','a','k','y',
't','t','k','n','a','k','y'
]

var setunacycle=new Array()
setunacycle['0']=[0,'(前奏)',31.968,0.3,26.968,5]
setunacycle['2']=[2,'(前奏)',29.968,0.3,26.968,5]
setunacycle['32']=[31.968,'魔法にかけられたみたいだったな',5.363,0.3]
setunacycle['37']=[37.331,'隣を向けばあったその笑顔',5.372,0.3]
setunacycle['43']=[42.703,'並んで歩いた　制服の色',5.248,0.3]
setunacycle['48']=[47.951,'横目で見ながら日常のサイクル　回す',5.399,0.5]
setunacycle['53']=[53.35,'流れる月日の前に',5.283,0.3]
setunacycle['58']=[58.632,'僕らは立ち尽くしてた',5.139,0.3]
setunacycle['64']=[63.771,'出会いも別れもあるなんて',2.692,0.5]
setunacycle['66']=[66.462,'あの頃は気にもしなかった',4.346,0.5]
setunacycle['71']=[70.808,'桜が散るたびに思い出すよ',5.213,0.3]
setunacycle['76']=[76.021,'借りた教科書の落書きと',2.619,0.5]
setunacycle['78']=[78.64,'言えなかった一言',2.86,0.3]
setunacycle['81']=[81.5,'なくした大切な宝物と',5.169,0.3]
setunacycle['86']=[86.669,'また会えるように歩いていこう',2.462,0.5]
setunacycle['89']=[89.131,'魔法が解ける前に',24.212,0.3]
setunacycle['113']=[113.343,'追い出されるまで話し込んだ',5.3,0.3]
setunacycle['118']=[118.643,'駅前のファーストフード店',5.381,0.3]
setunacycle['124']=[124.024,'久しぶりに見たらなくなってた',5.277,0.3]
setunacycle['129']=[129.301,'知らずに途切れた思い出の続き　探す',5.357,0.5]
setunacycle['134']=[134.658,'別々に歩む道を',5.332,0.3]
setunacycle['140']=[139.99,'仕方ないと思うほど',5.15,0.3]
setunacycle['145']=[145.14,'胸をついた思いは',2.691,0.3]
setunacycle['148']=[147.831,'日毎にまた募るんだ',4.291,0.3]
setunacycle['152']=[152.122,'秋が染まるたびに思い出すよ',5.197,0.3]
setunacycle['157']=[157.319,'ふざけあった教室と',2.672,0.4]
setunacycle['160']=[159.991,'笑って泣いた日のこと',2.855,0.4]
setunacycle['163']=[162.846,'なくした大切な宝物は',5.141,0.3]
setunacycle['168']=[167.987,'変わらないで光ってる',2.499,0.4]
setunacycle['170']=[170.487,'涙を誘うくらいに',26.188,0.3]
setunacycle['196']=[196.675,'出会えたことが偶然じゃないなら',4.424,0.4]
setunacycle['201']=[201.099,'別れもそういうものなのかな',7.034,0.3]
setunacycle['208']=[208.133,'雪が積もるたびに思い出すよ',5.126,0.3]
setunacycle['213']=[213.259,'はしゃいだ君の声　言えなかった一言',5.54,0.5]
setunacycle['219']=[218.799,'今はもう届かないこの声も',5.165,0.3]
setunacycle['224']=[223.964,'伝えていたなら　変わっていたかな',5.347,0.3]
setunacycle['229']=[229.311,'なんてね、分かってる',2.495,0.3]
setunacycle['232']=[231.806,'歩いていかなくちゃ',6.954,0.3]
setunacycle['238']=[238.76,'end']

var setunacycle_n=new Array()
setunacycle_n={
  "1":"",
'32':'まほうにかけられたみたいたつたな',
'37':'となりをむけはあつたそのえかお',
'43':'ならんてあるいたせいふくのいろ',
'48':'よこめてみなからにちしようのさいくるまわす',
'53':'なかれるつきひのまえに',
'58':'ほくらはたちつくしてた',
'64':'てあいもわかれもあるなんて',
'66':'あのころはきにもしなかつた',
'71':'さくらかちるたひにおもいたすよ',
'76':'かりたきようかしよのらくかきと',
'78':'いえなかつたひとこと',
'81':'なくしたたいせつなたからものと',
'86':'またあえるようにあるいていこう',
'89':'まほうかとけるまえに',
'113':'おいたされるまてはなしこんた',
'118':'えきまえのふあーすとふーとてん',
'124':'ひさしふりにみたらなくなつてた',
'129':'しらすにときれたおもいてのつつきさかす',
'134':'へつへつにあゆむみちを',
'140':'しかたないとおもうほと',
'145':'むねをついたおもいは',
'148':'ひことにまたつのるんた',
'152':'あきかそまるたひにおもいたすよ',
'157':'ふさけあつたきようしつと',
'160':'わらつてないたひのこと',
'163':'なくしたたいせつなたからものは',
'168':'かわらないてひかつてる',
'170':'なみたをさそうくらいに',
'196':'てあえたことかくうせんしやないなら',
'201':'わかれもそういうものなのかな',
'208':'ゆきかつもつたひにおもいたすよ',
'213':'はしやいやきみのこえいえなかつたひとこと',
'219':'いまはもうととかないこのこえも',
'224':'つたえていたならかわつていたかな',
'229':'なんてねわかつてる',
'232':'あるいていかなくちや',
'238':'end'
}

var setunacycle_s=new Array()
setunacycle_s=[
32.268,32.481,32.769,32.963,33.303,33.62,33.981,34.284,34.617,34.951,35.126,35.449,35.658,35.825,35.922,36.107,
37.631,37.789,38.141,38.307,38.654,38.965,39.312,39.594,39.76,39.944,40.303,40.442,40.961,41.302,41.461,
43.003,43.15,43.457,43.644,43.957,44.3,44.648,44.955,45.271,45.611,45.769,46.129,46.297,46.619,46.787,
48.251,48.398,48.784,48.941,49.301,49.626,49.959,50.299,50.615,50.932,51.088,51.177,51.3,51.447,51.613,51.923,52.122,52.271,52.616,52.763,52.946,
53.65,54.144,54.48,54.814,54.963,55.452,55.803,56.136,56.32,56.767,56.941,
58.932,59.422,59.791,60.103,60.262,60.738,61.096,61.428,61.76,62.287,62.453,
64.071,64.217,64.39,64.616,64.738,64.94,65.08,65.284,65.439,65.58,65.947,66.107,66.282,
66.762,66.938,67.28,67.479,67.631,67.814,67.955,68.076,68.224,68.329,68.611,68.758,68.945,
71.108,71.451,71.791,72.136,72.459,72.792,73.134,73.467,73.808,74.113,74.456,74.771,75.112,75.611,75.779,
76.321,76.474,76.611,76.725,76.846,76.953,77.11,77.241,77.346,77.453,77.628,77.758,77.943,78.082,78.274,
78.94,79.135,79.439,79.645,79.783,79.949,80.299,80.469,80.799,80.966,
81.8,82.131,82.437,82.789,83.103,83.447,83.788,84.118,84.471,84.777,85.142,85.451,85.776,86.284,86.451,
86.969,87.099,87.309,87.414,87.616,87.755,87.939,88.045,88.213,88.299,88.448,88.579,88.763,88.877,89.073,
89.431,89.752,90.251,90.456,90.946,91.13,91.445,91.638,91.778,91.962,
113.643,113.812,114.11,114.257,114.608,114.933,115.326,115.626,115.929,116.458,116.774,116.937,117.282,117.437,
118.943,119.11,119.443,119.591,119.934,120.186,120.256,120.563,120.913,121.248,121.598,121.755,122.271,122.623,122.797,
124.324,124.473,124.813,124.957,125.298,125.638,125.945,126.271,126.594,126.907,127.099,127.591,127.769,127.925,128.109,
129.601,129.791,130.121,130.279,130.629,130.939,131.288,131.631,131.962,132.279,132.463,132.794,132.936,133.287,133.443,133.594,133.951,134.111,134.269,
134.958,135.451,135.792,136.125,136.301,136.783,137.123,137.466,137.622,138.079,138.239,
140.29,140.77,141.119,141.445,141.62,142.1,142.459,142.758,143.118,143.627,143.81,
145.44,145.599,145.974,146.13,146.272,146.448,146.803,146.939,147.252,147.612,
148.131,148.271,148.645,148.802,148.96,149.129,149.486,149.629,149.958,150.1,150.268,
152.422,152.774,153.123,153.448,153.776,154.098,154.414,154.763,155.114,155.459,155.793,156.137,156.444,156.969,157.134,
157.619,157.793,158.124,158.303,158.459,158.613,158.922,158.992,159.168,159.307,159.457,159.617,
160.291,160.456,160.598,160.78,160.948,161.124,161.288,161.637,161.802,162.154,162.331,
163.146,163.471,163.799,164.109,164.45,164.784,165.124,165.449,165.782,166.107,166.432,166.774,167.091,167.623,167.781,
168.287,168.429,168.804,168.953,169.129,169.286,169.473,169.611,169.785,169.926,170.296,
170.787,171.122,171.628,171.803,172.293,172.467,172.599,172.802,172.943,173.082,173.284,
196.975,197.15,197.3,197.481,197.649,197.955,198.129,198.7,198.849,199.006,199.137,199.356,199.425,199.586,199.946,200.093,200.285,
201.399,201.749,202.107,202.467,202.763,203.107,203.448,203.754,204.114,204.439,204.77,205.114,205.419,205.604,
208.433,208.765,209.109,209.449,209.8,210.127,210.476,210.792,211.141,211.457,211.79,212.116,212.44,212.93,213.104,
213.559,213.708,213.813,213.944,214.112,214.27,214.611,214.952,215.294,215.6,216.231,216.423,216.783,216.949,217.107,217.274,217.616,217.783,218.114,218.292,
219.099,219.438,219.78,220.13,220.481,220.777,221.127,221.443,221.784,222.12,222.424,222.783,223.08,223.607,223.776,
224.264,224.44,224.774,224.942,225.293,225.632,225.975,226.3,226.911,227.086,227.418,227.604,227.954,228.304,228.629,228.953,
229.611,229.778,230.127,230.258,230.626,230.917,231.109,231.258,231.599,
232.106,232.449,232.956,233.132,233.604,233.79,234.131,234.297,234.605,234.76
]

var setunacycle_demo=new Array()
setunacycle_demo=[
'm','h','a','n','k','k','r','r','t','m','t','a','t','t','t','n',
't','n','r','w','m','k','h','a','t','t','s','n','a','k','a',
'n','r','w','t','a','r','a','t','s','a','h','k','n','a','r',
'y','k','m','t','m','n','k','r','n','t','s','y','a','n','s','a','k','r','m','w','s',
'n','k','r','r','t','k','h','n','m','a','n',
'h','k','r','h','t','t','t','k','s','t','t',
't','a','a','m','w','k','r','m','a','r','n','w','t',
'a','n','k','r','h','k','n','m','s','n','k','t','t',
's','k','r','k','t','r','t','h','n','a','m','a','t','s','y',
'k','r','t','k','y','a','k','s','y','n','r','k','k','k','t',
'a','a','n','k','t','t','h','t','k','r',
'n','k','s','t','t','a','s','t','n','t','k','r','m','n','t',
'm','t','a','a','r','y','a','n','a','r','a','t','a','k','a',
'm','h','a','k','t','k','r','m','a','n',
'a','a','t','s','r','r','m','t','h','n','s','k','w','t',
'a','k','m','a','n','h','a','w','s','t','h','w','t','t','w',
'h','s','s','h','r','n','m','t','r','n','k','n','t','t','t',
's','r','s','n','t','k','r','t','a','m','a','t','n','t','t','k','s','k','s',
'h','t','h','t','n','a','y','m','m','t','w',
's','k','t','n','a','t','a','m','a','h','t',
'm','n','w','t','a','t','a','m','a','h',
'h','k','t','n','m','t','t','n','r','w','t',
'a','k','k','s','m','r','t','h','n','a','m','a','t','s','y',
'h','s','k','a','t','t','k','y','a','s','t','t',
'w','r','t','t','n','a','t','h','n','k','t',
'n','k','s','t','t','a','s','t','n','t','k','r','m','n','h',
'k','w','r','n','a','t','h','k','t','t','r',
'n','m','t','w','s','s','a','k','r','a','n',
't','a','a','t','k','t','k','k','a','s','w','s','y','n','a','n','r',
'w','k','r','m','s','a','a','a','m','n','n','n','k','n',
'y','k','k','t','m','t','t','h','n','a','m','a','t','s','y',
'h','s','y','a','y','k','m','n','k','a','a','a','n','k','t','t','h','t','k','t',
'a','m','h','m','a','t','t','k','n','a','k','n','k','a','m',
't','t','a','t','a','t','n','r','k','w','t','t','a','t','k','n',
'n','w','t','n','w','k','t','t','r',
'a','r','a','t','a','k','n','k','t','y'

]

/*
var shiningstar=new Array()
shiningstar['1']=[1.3,'(前奏)',18.47,0.3,16.97,1]
shiningstar['19']=[19.47,'ただ風に揺られて',3.06,0.3]
shiningstar['22']=[22.53,'何も考えずに',3.02,0.3]
shiningstar['25']=[25.55,'ただ雲を眺めて',3.06,0.3]
shiningstar['28']=[28.61,'過ごすのもいいよね',3.02,0.3]
shiningstar['31']=[31.63,'誰しも何かしら',3.03,0.3]
shiningstar['34']=[34.66,'使命を抱えてる',3.04,0.3]
shiningstar['37']=[37.7,'ただそれだけのこと',3.04,0.3]
shiningstar['40']=[40.74,'悩むのはもうやめた',3.2,0.3]
shiningstar['43']=[43.94,'さざなみの音に癒やされてく',5.89,0.3]
shiningstar['49']=[49.83,'軌跡を運ぶ風の音',3.03,0.3]
shiningstar['52']=[52.86,'時を閉じ込めて',4.4,0.3]
shiningstar['56']=[57.26,'シャイニングスター綴れば',2.87,0.3]
shiningstar['59']=[60.13,'夢に眠る幻が掌に降り注ぐ',6.44,0.3]
shiningstar['66']=[66.57,'新たな世界へ',2.81,0.3]
shiningstar['69']=[69.38,'I\'ll beleave of my sensation',2.91,0.3]
shiningstar['71']=[72.29,'果てしない道の向こうで',3.19,0.3]
shiningstar['75']=[75.48,'瞼の裏に映る',3.24,0.3]
shiningstar['78']=[78.72,'一滴の光',3.02,0.3]
shiningstar['81']=[81.74,'トキメキを感じて',8.05,0.3]
shiningstar['89']=[90.09,'(間奏)',11.72,0.3,99.01,1]
shiningstar['101']=[101.51,'貴方が触れる全て',2.88,0.3]
shiningstar['104']=[104.39,'幸せであるように',3.21,0.3]
shiningstar['107']=[107.6,'今生きる喜びを',2.83,0.3]
shiningstar['110']=[110.43,'忘れてしまわないよう',3.23,0.3]
shiningstar['113']=[113.66,'月の光 隠す雲は揺らぎ',6.06,0.3]
shiningstar['119']=[119.72,'自由の翼は今も',3.04,0.3]
shiningstar['122']=[122.76,'大空を翔る',4.38,0.3]
shiningstar['126']=[127.14,'シャイニングスター綴れば',2.82,0.3]
shiningstar['129']=[129.96,'無限のイマジネーション',3.24,0.3]
shiningstar['132']=[133.2,'魔法が使えるような',3.26,0.3]
shiningstar['136']=[136.46,'世界が広がる',2.83,0.3]
shiningstar['138']=[139.29,'I\'ll beleave of my sensation',2.83,0.3]
shiningstar['141']=[142.12,'今も降り募る想いよ',3.21,0.3]
shiningstar['145']=[145.33,'切なさやトキメキが',3.26,0.3]
shiningstar['148']=[148.59,'心の真ん中で',3.06,0.3]
shiningstar['151']=[151.65,'熱いメロディになる',8.02,0.3]
shiningstar['159']=[159.97,'(間奏)',22.15,0.3,179.32,1]
shiningstar['181']=[181.82,'シャイニングスター綴れば',2.85,0.3]
shiningstar['184']=[184.67,'無限のイマジネーション',3.21,0.3]
shiningstar['187']=[187.88,'魔法が使えるような',3.24,0.3]
shiningstar['190']=[191.12,'世界が広がる',2.86,0.3]
shiningstar['193']=[193.98,'I\'ll beleave of my sensation',2.84,0.3]
shiningstar['196']=[196.82,'今も降り募る想いよ',3.22,0.3]
shiningstar['199']=[200.04,'切なさやトキメキが輝き出す',5.63,0.3]
shiningstar['205']=[205.67,'シャイニングスター綴れば',3.3,0.3]
shiningstar['208']=[208.97,'夢に眠る幻が掌に降り注ぐ',6.46,0.3]
shiningstar['215']=[215.43,'新たな世界へ',2.87,0.3]
shiningstar['218']=[218.3,'I\'ll beleave of my sensation',2.84,0.3]
shiningstar['220']=[221.14,'果てしない道の向こうで',3.22,0.3]
shiningstar['224']=[224.36,'瞼の裏に映る',3.25,0.3]
shiningstar['227']=[227.61,'一滴の光',3.04,0.3]
shiningstar['230']=[230.65,'トキメキを感じて',6.44,0.3]
shiningstar['236']=[237.09,'LaLaLa ',3.01,0.3]
shiningstar['239']=[240.1,'LaLaLa ',3.05,0.3]
shiningstar['242']=[243.15,'LaLaLa ',3.03,0.3]
shiningstar['245']=[246.18,'LaLaLa ',7.85,0.3]
shiningstar['253']=[254.03,'end',0,0.3]




var shiningstar_n=new Array()
var shiningstar_n={
  '1':'',
  '19':'たたかせにゆられて',
  '22':'なにもかんかえすに',
  '25':'たたくもをなかめて',
  '28':'すこすのもいいよね',
  '31':'たれしもなにかしら',
  '34':'しめいをかかえてる',
  '37':'たたそれたけのこと',
  '40':'なやむのはもうやめた',
  '43':'ささなみのおとにいやされてく',
  '49':'きせきをはこふかせのね',
  '52':'ときをとしこめて',
  '56':'しやいにんくすたーつつれは',
  '59':'ゆめにねむるまほろしかてのひらにふりそそく',
  '66':'あらたなせかいへ',
  '69':'あひおませ',
  '71':'はてしないみちのむこうて',
  '75':'まふたのうらにうつる',
  '78':'ひとしすくのひかり',
  '81':'ときめきをかんして',
  '89':'',
  '101':'あなたかふれるすへて',
  '104':'しあわせてあるように',
  '107':'いまいきるよろこひを',
  '110':'わすれてしまわないよう',
  '113':'つきのひかりかくすくもはゆらき',
  '119':'しゆうのつはさはいまも',
  '122':'おおそらをかける',
  '126':'しやいにんくすたーつつれは',
  '129':'むけんのいましねーしよん',
  '132':'まほうかつかえるような',
  '136':'せかいかひろかる',
  '138':'あひおませ',
  '141':'いまもふりつのるおもいよ',
  '145':'せつなさやときめきか',
  '148':'こころのまんなかて',
  '151':'あついめろていになる',
  '159':'',
  '181':'しやいにんくすたーつつれは',
  '184':'むけんのいましねーしよん',
  '187':'まほうかつかえるような',
  '190':'せかいかひろかる',
  '193':'あひおませ',
  '196':'いまもふりつのるおもいよ',
  '199':'せつなさやときめきかかかやきたす',
  '205':'しやいにんくすたーつつれは',
  '208':'ゆめにねむるまほろしかてのひらにふりそそく',
  '215':'あらたなせかいへ',
  '218':'あひおませ',
  '220':'はてしないみちのむこうて',
  '224':'まふたのうらにうつる',
  '227':'ひとしすくのひかり',
  '230':'ときめきをかんして',
  '236':'ららららららら',
  '239':'らららららららららら',
  '242':'ららららららら',
  '245':'ららららららららら',
  '253':'end'
}
*/

var shiningstar=new Array()
shiningstar['1']=[1.3,'(前奏)','',18.47,0.3,16.97]
shiningstar['19']=[19.47,'ただ風に揺られて','たたかせにゆられて',3.06,0.3]
shiningstar['22']=[22.53,'何も考えずに','なにもかんかえすに',3.02,0.3]
shiningstar['25']=[25.55,'ただ雲を眺めて','たたくもをなかめて',3.06,0.3]
shiningstar['28']=[28.61,'過ごすのもいいよね','すこすのもいいよね',3.02,0.3]
shiningstar['31']=[31.63,'誰しも何かしら','たれしもなにかしら',3.03,0.3]
shiningstar['34']=[34.66,'使命を抱えてる','しめいをかかえてる',3.04,0.3]
shiningstar['37']=[37.7,'ただそれだけのこと','たたそれたけのこと',3.04,0.3]
shiningstar['40']=[40.74,'悩むのはもうやめた','なやむのはもうやめた',3.2,0.3]
shiningstar['43']=[43.94,'さざなみの音に癒やされてく','ささなみのおとにいやされてく',5.89,0.3]
shiningstar['49']=[49.83,'軌跡を運ぶ風の音','きせきをはこふかせのね',3.03,0.3]
shiningstar['52']=[52.86,'時を閉じ込めて','ときをとしこめて',4.4,0.3]
shiningstar['56']=[57.26,'シャイニングスター綴れば','しやいにんくすたーつつれは',2.87,0.3]
shiningstar['59']=[60.13,'夢に眠る幻が掌に降り注ぐ','ゆめにねむるまほろしかてのひらにふりそそく',6.44,0.3]
shiningstar['66']=[66.57,'新たな世界へ','あらたなせかいへ',2.81,0.3]
shiningstar['69']=[69.38,'I\'ll beleave of my sensation','あひおませ',2.91,0.3]
shiningstar['71']=[72.29,'果てしない道の向こうで','はてしないみちのむこうて',3.19,0.3]
shiningstar['75']=[75.48,'瞼の裏に映る','まふたのうらにうつる',3.24,0.3]
shiningstar['78']=[78.72,'一滴の光','ひとしすくのひかり',3.02,0.3]
shiningstar['81']=[81.74,'トキメキを感じて','ときめきをかんして',8.05,0.3]
shiningstar['89']=[90.09,'(間奏)','',11.72,0.3,99.01]
shiningstar['101']=[101.51,'貴方が触れる全て','あなたかふれるすへて',2.88,0.3]
shiningstar['104']=[104.39,'幸せであるように','しあわせてあるように',3.21,0.3]
shiningstar['107']=[107.6,'今生きる喜びを','いまいきるよろこひを',2.83,0.3]
shiningstar['110']=[110.43,'忘れてしまわないよう','わすれてしまわないよう',3.23,0.3]
shiningstar['113']=[113.66,'月の光 隠す雲は揺らぎ','つきのひかりかくすくもはゆらき',6.06,0.3]
shiningstar['119']=[119.72,'自由の翼は今も','しゆうのつはさはいまも',3.04,0.3]
shiningstar['122']=[122.76,'大空を翔る','おおそらをかける',4.38,0.3]
shiningstar['126']=[127.14,'シャイニングスター綴れば','しやいにんくすたーつつれは',2.82,0.3]
shiningstar['129']=[129.96,'無限のイマジネーション','むけんのいましねーしよん',3.24,0.3]
shiningstar['132']=[133.2,'魔法が使えるような','まほうかつかえるような',3.26,0.3]
shiningstar['136']=[136.46,'世界が広がる','せかいかひろかる',2.83,0.3]
shiningstar['138']=[139.29,'I\'ll beleave of my sensation','あひおませ',2.83,0.3]
shiningstar['141']=[142.12,'今も降り募る想いよ','いまもふりつのるおもいよ',3.21,0.3]
shiningstar['145']=[145.33,'切なさやトキメキが','せつなさやときめきか',3.26,0.3]
shiningstar['148']=[148.59,'心の真ん中で','こころのまんなかて',3.06,0.3]
shiningstar['151']=[151.65,'熱いメロディになる','あついめろていになる',8.02,0.3]
shiningstar['159']=[159.97,'(間奏)','',22.15,0.3,179.32]
shiningstar['181']=[181.82,'シャイニングスター綴れば','しやいにんくすたーつつれは',2.85,0.3]
shiningstar['184']=[184.67,'無限のイマジネーション','むけんのいましねーしよん',3.21,0.3]
shiningstar['187']=[187.88,'魔法が使えるような','まほうかつかえるような',3.24,0.3]
shiningstar['190']=[191.12,'世界が広がる','せかいかひろかる',2.86,0.3]
shiningstar['193']=[193.98,'I\'ll beleave of my sensation','あひおませ',2.84,0.3]
shiningstar['196']=[196.82,'今も降り募る想いよ','いまもふりつのるおもいよ',3.22,0.3]
shiningstar['199']=[200.04,'切なさやトキメキが輝き出す','せつなさやときめきかかかやきたす',5.63,0.3]
shiningstar['205']=[205.67,'シャイニングスター綴れば','しやいにんくすたーつつれは',3.3,0.3]
shiningstar['208']=[208.97,'夢に眠る幻が掌に降り注ぐ','ゆめにねむるまほろしかてのひらにふりそそく',6.46,0.3]
shiningstar['215']=[215.43,'新たな世界へ','あらたなせかいへ',2.87,0.3]
shiningstar['218']=[218.3,'I\'ll beleave of my sensation','あひおませ',2.84,0.3]
shiningstar['220']=[221.14,'果てしない道の向こうで','はてしないみちのむこうて',3.22,0.3]
shiningstar['224']=[224.36,'瞼の裏に映る','まふたのうらにうつる',3.25,0.3]
shiningstar['227']=[227.61,'一滴の光','ひとしすくのひかり',3.04,0.3]
shiningstar['230']=[230.65,'トキメキを感じて','ときめきをかんして',6.44,0.3]
shiningstar['236']=[237.09,'LaLaLa ','ららららららら',3.01,0.3]
shiningstar['239']=[240.1,'LaLaLa ','らららららららららら',3.05,0.3]
shiningstar['242']=[243.15,'LaLaLa ','ららららららら',3.03,0.3]
shiningstar['245']=[246.18,'LaLaLa ','ららららららららら',7.85,0.3]
shiningstar['253']=[254.03,'end','end',0,0.3]


var shiningstar_s=new Array()
shiningstar_s=[
  19.77,19.97,20.54,20.74,21.34,21.53,21.72,21.9,22.08,
  22.83,23.02,23.19,23.38,23.55,23.94,24.31,24.71,24.89,
  25.85,26.03,26.62,26.81,27.4,27.59,27.75,27.95,28.13,
  28.91,29.1,29.47,29.65,30.02,30.38,30.76,31.14,31.33,
  31.93,32.12,32.71,32.9,33.46,33.66,33.84,34.05,34.21,
  34.96,35.14,35.33,35.51,35.71,36.11,36.49,36.87,37.06,
  38,38.19,38.78,38.96,39.53,39.74,39.91,40.11,40.28,
  41.04,41.22,41.61,41.79,42.18,42.55,42.76,42.93,43.3,43.5,
  44.24,44.63,45.02,45.42,45.61,47.14,47.31,47.69,48.07,48.45,48.64,49.01,49.2,49.55,
  50.13,50.35,50.61,50.9,51.11,51.38,51.65,51.86,52.14,52.42,52.61,
  53.16,53.36,53.64,53.95,54.15,54.41,54.7,54.89,
  57.56,57.65,57.77,57.95,58.14,58.33,58.49,58.59,58.69,58.88,59.27,59.66,59.84,
  60.43,60.6,60.78,60.98,61.37,61.55,61.93,62.3,62.69,62.88,63.06,63.64,63.82,64.02,64.42,64.59,64.97,65.34,65.73,65.91,66.27,
  66.87,67.06,67.25,67.64,68.01,68.4,68.77,68.96,
  69.68,70.08,70.46,70.64,71.04,
  72.59,72.79,72.95,73.13,73.32,73.5,73.7,74.11,74.48,74.84,75.03,75.22,
  75.78,75.97,76.17,76.56,76.75,77.14,77.5,77.87,78.05,78.43,
  79.02,79.21,79.39,79.77,80.15,80.52,80.9,81.08,81.48,
  82.04,82.21,82.6,82.99,83.37,83.76,84.54,84.92,85.09,
  101.81,102,102.59,102.77,103.14,103.32,103.53,103.71,103.9,104.09,
  104.69,104.85,105.05,105.22,105.43,105.61,105.99,106.38,106.76,106.94,
  107.9,108.07,108.45,108.63,108.83,109.42,109.61,109.79,109.99,110.17,
  110.73,110.9,111.11,111.28,111.48,111.67,112.05,112.43,112.81,113.2,113.39,
  113.96,114.16,114.52,114.9,115.3,115.47,117,117.15,117.55,117.94,118.33,118.52,118.89,119.07,119.43,
  120.02,120.23,120.48,120.77,120.99,121.27,121.53,121.76,122.02,122.3,122.51,
  123.06,123.26,123.51,123.8,124.02,124.28,124.57,124.78,
  127.44,127.51,127.62,127.81,128.02,128.21,128.36,128.45,128.56,128.76,129.16,129.52,129.72,
  130.26,130.45,130.61,130.81,131.19,131.39,131.79,132.16,132.54,132.73,132.81,132.91,
  133.5,133.68,133.89,134.28,134.46,134.83,135.21,135.6,135.79,135.97,136.17,
  136.76,136.94,137.13,137.51,137.89,138.27,138.65,138.83,
  139.59,139.95,140.32,140.51,140.89,
  142.42,142.61,142.8,143.01,143.39,143.56,143.95,144.12,144.31,144.71,144.89,145.07,
  145.63,145.81,146.04,146.43,146.62,146.98,147.37,147.75,147.95,148.31,
  148.89,149.09,149.27,149.67,150.03,150.4,150.78,150.98,151.37,
  151.95,152.13,152.49,152.87,153.23,153.62,153.78,154.39,154.78,154.97,
  182.12,182.2,182.32,182.51,182.69,182.89,183.06,183.15,183.28,183.46,183.84,184.21,184.4,
  184.97,185.16,185.33,185.54,185.91,186.1,186.48,186.86,187.24,187.43,187.51,187.62,
  188.18,188.37,188.59,188.95,189.15,189.54,189.92,190.29,190.48,190.66,190.86,
  191.42,191.6,191.8,192.18,192.57,192.93,193.31,193.5,
  194.28,194.64,195.02,195.2,195.59,
  197.12,197.32,197.5,197.69,198.07,198.28,198.63,198.83,199.02,199.4,199.57,199.77,
  200.34,200.52,200.71,201.11,201.3,201.66,202.03,202.41,202.6,202.99,203.59,203.77,203.98,204.35,204.73,205.1,
  205.97,206.04,206.38,206.76,206.93,207.16,207.34,207.43,207.54,207.73,208.13,208.49,208.68,
  209.27,209.46,209.64,209.85,210.23,210.41,210.8,211.18,211.56,211.75,211.93,212.49,212.68,212.9,213.29,213.47,213.85,214.24,214.6,214.79,215.17,
  215.73,215.92,216.12,216.49,216.85,217.24,217.63,217.82,
  218.6,218.96,219.34,219.52,219.91,
  221.44,221.61,221.79,221.99,222.17,222.36,222.56,222.95,223.32,223.71,223.9,224.09,
  224.66,224.84,225.05,225.45,225.63,226,226.4,226.77,226.95,227.33,
  227.91,228.09,228.27,228.63,229.01,229.39,229.76,229.95,230.36,
  230.95,231.12,231.5,231.86,232.23,232.62,233.38,233.75,233.95,
  237.39,237.55,237.73,237.95,238.1,238.31,238.51,
  240.4,240.57,240.77,240.96,241.17,241.35,241.53,241.91,242.11,242.3,
  243.45,243.63,243.82,244.01,244.2,244.41,244.58,
  246.48,246.66,246.86,247.04,247.23,247.41,247.58,248.58,249.33
]										

var shiningstar_demo=new Array()
shiningstar_demo=[
  't','t','k','s','n','y','r','r','t',
'n','n','m','k','w','k','a','s','n',
't','t','k','m','w','n','k','m','t',
's','k','s','n','m','a','a','y','n',
't','r','s','m','n','n','k','s','r',
's','m','a','w','k','k','a','t','r',
't','t','s','r','t','k','n','k','t',
'n','y','m','n','h','m','a','y','m','t',
's','s','n','m','n','a','t','n','a','y','s','r','t','k',
'k','s','k','w','h','k','h','k','s','n','n',
't','k','w','t','s','k','m','t',
's','y','a','n','w','k','s','t','w','t','t','r','h',
'y','m','n','n','m','r','m','h','r','s','k','t','n','h','r','n','h','r','s','s','k',
'a','r','t','n','s','k','a','h',
'a','h','a','m','s',
'h','t','s','n','a','m','t','n','m','k','a','t',
'm','h','t','n','a','r','n','a','t','r',
'h','t','s','s','k','n','h','k','r',
't','k','m','k','w','k','w','s','t',
'a','n','t','k','h','r','r','s','h','t',
's','a','w','s','t','a','r','y','a','n',
'a','m','a','k','r','y','r','k','h','w',
'w','s','r','t','s','m','w','n','a','y','a',
't','k','n','h','k','r','k','k','s','k','m','h','y','r','k',
's','y','a','n','t','h','s','h','a','m','m',
'a','a','s','r','w','k','k','r',
's','y','a','n','w','k','s','t','w','t','t','r','h',
'm','k','w','n','a','m','s','n','w','s','y','w',
'm','h','a','k','t','k','a','r','y','a','n',
's','k','a','k','h','r','k','r',
'a','h','a','m','s',
'a','m','m','h','r','t','n','r','a','m','a','y',
's','t','n','s','y','t','k','m','k','k',
'k','k','r','n','m','w','n','k','t',
'a','t','a','m','r','t','a','n','n','r',
's','y','a','n','w','k','s','t','w','t','t','r','h',
'm','k','w','n','a','m','s','n','w','s','y','w',
'm','h','a','k','t','k','a','r','y','a','n',
's','k','a','k','h','r','k','r',
'a','h','a','m','s',
'a','m','m','h','r','t','n','r','a','m','a','y',
's','t','n','s','y','t','k','m','k','k','k','k','y','k','t','s',
's','y','a','n','w','k','s','t','w','t','t','r','h',
'y','m','n','n','m','r','m','h','r','s','k','t','n','h','r','n','h','r','s','s','k',
'a','r','t','n','s','k','a','h',
'a','h','a','m','s',
'h','t','s','n','a','m','t','n','m','k','a','t',
'm','h','t','n','a','r','n','a','t','r',
'h','t','s','s','k','n','h','k','r',
't','k','m','k','w','k','w','s','t',
'r','r','r','r','r','r','r',
'r','r','r','r','r','r','r','r','r','r',
'r','r','r','r','r','r','r',
'r','r','r','r','r','r','r','r','r'
]

var ichinenniichidonoichigofestival=new Array()
ichinenniichidonoichigofestival['1']=[1.3,'(前奏)','',17.05,0.3,15.55]
ichinenniichidonoichigofestival['17']=[18.05,'水曜日限定 二層のショートケーキ','すいようひけんていにそうのしよーとけーき',7.21,0.3]
ichinenniichidonoichigofestival['24']=[25.26,'駅前曲がり角 ピンク色シュークリーム','えきまえまかりかとひんくいろしゆーくりーむ',7.23,0.3]
ichinenniichidonoichigofestival['32']=[32.49,'相性ばっちりのさくさくミルフィーユ','あいしようはつちりのさくさくみるふいーゆ',7.25,0.3]
ichinenniichidonoichigofestival['39']=[39.74,'ソースひとつ落とせば 色付く白いPlate','そーすひとつおとせはいろつくしろいふれーと',6.28,0.3]
ichinenniichidonoichigofestival['45']=[46.02,'初めて出会った日から運命だと感じて','はしめててあつたひからうんめいたとかんして',7.64,0.3]
ichinenniichidonoichigofestival['53']=[53.66,'毎日増えるレパートリー いちご!いちえ! Foo♡♥','まいにちふえるれはーとりーいちこいちえふ',6.76,0.3]
ichinenniichidonoichigofestival['60']=[60.42,'とろけるような恋の味 あまくすっぱく','とろけるようなこいのあしあまくすつはく',7.28,0.3]
ichinenniichidonoichigofestival['67']=[67.7,'心弾むfestivalは 期間限定なの?','こころはすむふえすていはるはきかんけいていなの',7.19,0.3]
ichinenniichidonoichigofestival['74']=[74.89,'寂しがる私のこと 慰めてくれる','さひしかるわたしのことなくさめてくれる',6.53,0.3]
ichinenniichidonoichigofestival['81']=[81.42,'来年も会えるからって でも（ダメ!）','らいねんもあえるからつてても',4.85,0.3]
ichinenniichidonoichigofestival['85']=[86.27,'今年は明日まで!','ことしはあしたまて',4.13,0.3]
ichinenniichidonoichigofestival['90']=[90.4,'はー…','はー',0.95,0.3]
ichinenniichidonoichigofestival['91']=[91.35,'今週も疲れたな～','こんしゆうもつかれたな',2.2,0.3]
ichinenniichidonoichigofestival['93']=[93.55,'はっ、今日はトリプルアイス30%オフの日ではないか！','はつきようはとりふるあいすさんしゆつはーせんとおふのひてはないか',5.11,0.3]
ichinenniichidonoichigofestival['98']=[98.66,'（いっつも選ぶの）結構迷っちゃうんだよね～','けつこうまよつちやうんたよね',1.84,0.3]
ichinenniichidonoichigofestival['100']=[100.5,'（いらっしゃいませ～）あっすいません','あつすいません',1.49,0.3]
ichinenniichidonoichigofestival['101']=[101.99,'（えっと）カップのトリプルで…','かつふのとりふるて',1.86,0.3]
ichinenniichidonoichigofestival['103']=[103.85,'（あ、お持ち帰りで）','',0.74,0.3]
ichinenniichidonoichigofestival['104']=[104.59,'一段目が…','いちたんめか',1.34,0.3]
ichinenniichidonoichigofestival['105']=[105.93,'えー…','えー',1.02,0.3]
ichinenniichidonoichigofestival['106']=[106.95,'ストロベリー＆ストロベリー','すとろへりーあんとすとろへりー',2.05,0.3]
ichinenniichidonoichigofestival['108']=[109,'（えっと、）二段目がスペシャルストロベリーで','にたんめかすへしやるすとろへりーて',2.83,0.3]
ichinenniichidonoichigofestival['111']=[111.83,'三段目が超ウルトラプレミアムストロベリーで','さんたんめかちよううるとらふれみあうすとろへりーて',3.91,0.3]
ichinenniichidonoichigofestival['115']=[115.74,'これと同じものをあと三つお願いします','これとおなしものをあとみつつおねかいします',7.26,0.3]
ichinenniichidonoichigofestival['122']=[123,'end','end',0,0.3]




var ichinenniichidonoichigofestival_s=new Array()
ichinenniichidonoichigofestival_s=[
  18.35,18.58,18.83,19.05,19.3,19.49,19.93,20.16,20.38,21.26,21.5,21.73,21.95,22.19,22.29,22.4,22.64,22.85,23.06,24,
  25.56,25.77,26.04,26.51,26.71,27.14,27.37,27.59,27.83,28.28,28.48,28.72,29.17,29.39,30.32,30.45,30.54,30.76,30.97,31.2,31.64,
  32.79,33.01,33.26,33.37,33.48,33.7,33.93,34.38,34.6,34.83,35.71,35.94,36.15,36.38,36.62,37.07,37.3,37.55,37.75,38.43,
  40.04,40.24,40.44,40.91,41.12,41.36,41.58,41.81,42.04,42.28,42.95,43.16,43.6,43.82,44.73,44.94,45.18,45.41,45.63,45.85,46.11,
  46.32,46.77,47.44,47.66,48.1,48.32,48.55,49.24,49.72,49.94,50.15,50.61,50.84,51.05,51.29,51.51,51.95,52.83,53.05,53.25,53.49,
  53.96,54.67,54.89,55.09,55.35,55.58,55.99,56.49,56.7,56.93,57.15,57.37,57.6,57.81,58.04,58.26,58.5,58.72,59.17,60.03,
  60.72,60.96,61.21,61.86,62.54,62.64,62.76,63.69,63.92,64.13,64.37,64.59,65.05,65.26,65.47,65.94,66.17,66.41,67.08,
  68,68.18,68.43,69.1,69.78,70,70.45,70.54,70.66,70.91,71.01,71.13,71.35,71.58,72.27,72.49,72.7,73.16,73.4,73.61,73.82,74.05,74.52,
  75.19,75.62,76.29,76.98,77.2,77.65,77.89,78.09,78.33,78.56,78.79,78.99,79.47,79.7,79.93,80.4,80.64,80.86,81.26,
  81.72,82.19,82.42,82.64,83.07,83.31,83.53,83.77,84.01,84.13,84.22,84.45,85.31,85.54,
  86.57,87.15,87.83,88.04,88.49,88.94,89.17,89.62,90.07,
  90.7,90.9,
  91.65,91.87,92.04,92.14,92.28,92.49,92.65,92.88,93.1,93.36,
  93.85,94.02,94.4,94.49,94.56,94.67,94.95,95.07,95.17,95.3,95.42,95.56,95.67,95.92,96.07,96.18,96.28,96.35,96.45,96.56,96.71,96.79,96.9,96.99,97.11,97.24,97.38,97.51,97.65,97.76,97.88,97.99,
  98.96,99.08,99.19,99.32,99.47,99.57,99.66,99.78,99.85,99.97,100.06,100.16,100.25,100.37,
  100.8,100.91,101.26,101.4,101.53,101.66,101.74,
  102.29,102.44,102.57,102.73,102.95,103.13,103.25,103.39,103.52,
  104.89,105.04,105.16,105.29,105.4,105.56,
  106.23,106.44,
  107.25,107.35,107.44,107.56,107.66,107.79,107.88,107.99,108.09,108.21,108.31,108.43,108.53,108.63,108.74,
  109.3,109.43,109.61,109.75,109.94,110.47,110.61,110.7,110.82,110.91,111.02,111.13,111.25,111.35,111.49,111.58,111.7,
  112.13,112.29,112.44,112.56,112.7,112.87,113.36,113.49,113.59,113.71,113.82,113.94,114.03,114.14,114.25,114.37,114.48,114.63,114.74,114.86,114.97,115.1,115.2,115.31,115.42,
  116.04,116.17,116.28,116.39,116.48,116.59,116.69,116.78,116.89,117.1,117.23,117.33,117.42,117.54,117.66,117.77,117.87,117.98,118.09,118.19,118.3  
]

var ichinenniichidonoichigofestival_demo=new Array()
ichinenniichidonoichigofestival_demo=[
  's','a','y','a','h','k','w','t','a','n','s','a','n','s','y','w','t','k','w','k',
  'a','k','m','a','m','k','r','k','t','h','w','k','a','r','s','y','w','k','r','w','m',
  'a','a','s','y','a','h','t','t','r','n','s','k','s','k','m','r','h','a','w','y',
  's','w','s','h','t','t','a','t','s','h','a','r','t','k','s','r','a','h','r','w','t',
  'h','s','m','t','t','a','t','t','h','k','r','a','w','m','a','t','t','k','w','s','t',
  'm','a','n','t','h','a','r','r','h','w','t','r','w','a','t','k','a','t','a','h',
  't','r','k','r','y','a','n','k','a','n','a','s','a','m','k','s','t','h','k',
  'k','k','r','h','s','m','h','a','s','t','a','h','r','h','k','k','w','k','a','t','a','n','n',
  's','h','s','k','r','w','t','s','n','k','t','n','k','s','m','t','k','r','r',
  'r','a','n','w','m','a','a','r','k','r','t','t','t','m',
  'k','t','s','h','a','s','t','m','t',
  'h','w',
  'k','w','s','y','a','m','t','k','r','t','n',
  'h','t','k','y','a','h','t','r','h','r','a','a','s','s','w','s','y','t','h','w','s','w','t','a','h','n','h','t','h','n','a','k',
  'k','t','k','a','m','y','t','t','y','a','w','t','y','n',
  'a','t','s','a','m','s','w',
  'k','t','h','n','t','r','h','r','t',
  'a','t','t','w','m','k',
  'a','w',
  's','t','r','h','r','w','a','w','t','s','t','r','h','r','w',
  'n','t','w','m','k','s','h','s','y','r','s','t','r','h','r','w','t',
  's','w','t','w','m','k','t','y','a','a','r','t','r','h','r','m','a','a','s','t','r','h','r','w','t',
  'k','r','t','a','n','s','m','n','w','a','t','m','t','t','a','n','k','a','s','m','s'
  
]