var title=new Array()
var kasi=new Array()  //メイン歌詞
var kasi_n=new Array() //歌詞ひらがな
var kasi_s=new Array()  //歌詞文字秒数
var kasi_demo=new Array()  //オートモード用にアルファベットを保管する配列
var kasi_now=0  //現在の歌詞文字数
var kasi_s_now=0
var kasi_count=0  //現在の歌詞漢字表示行
var kasi_s_count=0
var kasi_n_count=0  //現在の歌詞ひらがな表示行
var kasi_emotime=1 //エモーショナルポイントの猶予秒
var emo_ten=0  //歌詞文字秒数評価点
var combo_ten=0 //現在のCOMBO数
var max_combo=0  //MAXCOMBO数
var playing=""
var startbutton=""
var playagain=new Array()  //playagain用の曲情報配列
var mozi_time_now
var mozi_time_num2
var mozi_time_now2
var test=""
var testvolume=1
var musicstarter="no"
var test2

var now_select_music
var now_select_videoid



var music_list = [
  {
    music:"shiningstar",
    url:"Qd01-6xVSHk",
    level:"4",
    title:"シャイニングスター",
    artist:"魔王魂",
    credit:"作詞作曲：森田交一　唄：試歩",
    minsec:"0.07"
  },
  {
    music:"ichinenniichidonoichigofestival",
    url:"gqw8efOS6NE",
    level:"7",
    title:"一年に一度のいちごふぇすてぃばる",
    artist:"龍崎一",
    credit:"曲：龍崎一　歌/詞：TOYro",
    minsec:"0.07"
  },
  {
    music:"aimaitrip",
    url:"g_BJo2GpTSw",
    level:"8",
    title:"曖昧トリップ (with 桃箱 & miko)",
    artist:"Yunomi",
    credit:"Yunomi - Aimai Trip (with Momobako & Miko) <br> Music & Lyrics: Yunomi <br> Vocals: 桃箱 & miko <br> Artwork: きあと",
    minsec:"0.07"
  },
  {
    music:"aimaitrip_easy",
    url:"g_BJo2GpTSw",
    level:"1",
    title:"曖昧トリップ (with 桃箱 & miko)",
    artist:"Yunomi",
    credit:"Yunomi - Aimai Trip (with Momobako & Miko) <br> Music & Lyrics: Yunomi <br> Vocals: 桃箱 & miko <br> Artwork: きあと",
    minsec:"0.45"
  },



]

//beatinangel['2']=[2,'(前奏)',16.981,0.3]
//タイトル[開始秒（整数）]=[開始秒,表示メッセージ,表示時間,判定秒数,（スキップ先秒）,（スキップ表示時間）]



var shiningstar=new Array()
shiningstar['1']=[1.3,'(前奏)','',18.17,0.3,17.16]
shiningstar['19']=[19.47,'ただ風に揺られて','たたかせにゆられて',3.06,0.3]
shiningstar['22']=[22.53,'何も考えずに','なにもかんかえすに',3.02,0.3]
shiningstar['25']=[25.55,'ただ雲を眺めて','たたくもをなかめて',3.06,0.3]
shiningstar['28']=[28.61,'過ごすのもいいよね','すこすのもいいよね',3.02,0.3]
shiningstar['31']=[31.63,'誰しも何かしら','たれしもなにかしら',3.03,0.3]
shiningstar['34']=[34.66,'使命を抱えてる','しめいをかかえてる',3.04,0.3]
shiningstar['37']=[37.7,'ただそれだけのこと','たたそれたけのこと',3.04,0.3]
shiningstar['40']=[40.74,'悩むのはもうやめた','なやむのはもうやめた',3.2,0.3]
shiningstar['43']=[43.94,'さざなみの音に癒やされてく','ささなみのおとにいやされてく',5.89,0.3]
shiningstar['49']=[49.83,'軌跡を運ぶ風の音','きせきをはこふかせのね',3.03,0.3]
shiningstar['52']=[52.86,'時を閉じ込めて','ときをとしこめて',4.4,0.3]
shiningstar['56']=[57.26,'シャイニングスター綴れば','しやいにんくすたーつつれは',2.87,0.3]
shiningstar['59']=[60.13,'夢に眠る幻が掌に降り注ぐ','ゆめにねむるまほろしかてのひらにふりそそく',6.44,0.3]
shiningstar['66']=[66.57,'新たな世界へ','あらたなせかいへ',2.81,0.3]
shiningstar['69']=[69.38,'I\'ll beleave of my sensation','あひおませ',2.91,0.3]
shiningstar['71']=[72.29,'果てしない道の向こうで','はてしないみちのむこうて',3.19,0.3]
shiningstar['75']=[75.48,'瞼の裏に映る','まふたのうらにうつる',3.24,0.3]
shiningstar['78']=[78.72,'一滴の光','ひとしすくのひかり',3.02,0.3]
shiningstar['81']=[81.74,'トキメキを感じて','ときめきをかんして',8.05,0.3]
shiningstar['89']=[90.09,'(間奏)','',11.72,0.3,99.01]
shiningstar['101']=[101.51,'貴方が触れる全て','あなたかふれるすへて',2.88,0.3]
shiningstar['104']=[104.39,'幸せであるように','しあわせてあるように',3.21,0.3]
shiningstar['107']=[107.6,'今生きる喜びを','いまいきるよろこひを',2.83,0.3]
shiningstar['110']=[110.43,'忘れてしまわないよう','わすれてしまわないよう',3.23,0.3]
shiningstar['113']=[113.66,'月の光 隠す雲は揺らぎ','つきのひかりかくすくもはゆらき',6.06,0.3]
shiningstar['119']=[119.72,'自由の翼は今も','しゆうのつはさはいまも',3.04,0.3]
shiningstar['122']=[122.76,'大空を翔る','おおそらをかける',4.38,0.3]
shiningstar['126']=[127.14,'シャイニングスター綴れば','しやいにんくすたーつつれは',2.82,0.3]
shiningstar['129']=[129.96,'無限のイマジネーション','むけんのいましねーしよん',3.24,0.3]
shiningstar['132']=[133.2,'魔法が使えるような','まほうかつかえるような',3.26,0.3]
shiningstar['136']=[136.46,'世界が広がる','せかいかひろかる',2.83,0.3]
shiningstar['138']=[139.29,'I\'ll beleave of my sensation','あひおませ',2.83,0.3]
shiningstar['141']=[142.12,'今も降り募る想いよ','いまもふりつのるおもいよ',3.21,0.3]
shiningstar['145']=[145.33,'切なさやトキメキが','せつなさやときめきか',3.26,0.3]
shiningstar['148']=[148.59,'心の真ん中で','こころのまんなかて',3.06,0.3]
shiningstar['151']=[151.65,'熱いメロディになる','あついめろていになる',8.02,0.3]
shiningstar['159']=[159.97,'(間奏)','',22.15,0.3,179.32]
shiningstar['181']=[181.82,'シャイニングスター綴れば','しやいにんくすたーつつれは',2.85,0.3]
shiningstar['184']=[184.67,'無限のイマジネーション','むけんのいましねーしよん',3.21,0.3]
shiningstar['187']=[187.88,'魔法が使えるような','まほうかつかえるような',3.24,0.3]
shiningstar['190']=[191.12,'世界が広がる','せかいかひろかる',2.86,0.3]
shiningstar['193']=[193.98,'I\'ll beleave of my sensation','あひおませ',2.84,0.3]
shiningstar['196']=[196.82,'今も降り募る想いよ','いまもふりつのるおもいよ',3.22,0.3]
shiningstar['199']=[200.04,'切なさやトキメキが輝き出す','せつなさやときめきかかかやきたす',5.63,0.3]
shiningstar['205']=[205.67,'シャイニングスター綴れば','しやいにんくすたーつつれは',3.3,0.3]
shiningstar['208']=[208.97,'夢に眠る幻が掌に降り注ぐ','ゆめにねむるまほろしかてのひらにふりそそく',6.46,0.3]
shiningstar['215']=[215.43,'新たな世界へ','あらたなせかいへ',2.87,0.3]
shiningstar['218']=[218.3,'I\'ll beleave of my sensation','あひおませ',2.84,0.3]
shiningstar['220']=[221.14,'果てしない道の向こうで','はてしないみちのむこうて',3.22,0.3]
shiningstar['224']=[224.36,'瞼の裏に映る','まふたのうらにうつる',3.25,0.3]
shiningstar['227']=[227.61,'一滴の光','ひとしすくのひかり',3.04,0.3]
shiningstar['230']=[230.65,'トキメキを感じて','ときめきをかんして',6.44,0.3]
shiningstar['236']=[237.09,'LaLaLa ','ららららららら',3.01,0.3]
shiningstar['239']=[240.1,'LaLaLa ','らららららららららら',3.05,0.3]
shiningstar['242']=[243.15,'LaLaLa ','ららららららら',3.03,0.3]
shiningstar['245']=[246.18,'LaLaLa ','ららららららららら',7.85,0.3]
shiningstar['253']=[254.03,'end','',0,0.3]


var shiningstar_s=new Array()
shiningstar_s=[
  19.77,19.97,20.54,20.74,21.34,21.53,21.72,21.9,22.08,
  22.83,23.02,23.19,23.38,23.55,23.94,24.31,24.71,24.89,
  25.85,26.03,26.62,26.81,27.4,27.59,27.75,27.95,28.13,
  28.91,29.1,29.47,29.65,30.02,30.38,30.76,31.14,31.33,
  31.93,32.12,32.71,32.9,33.46,33.66,33.84,34.05,34.21,
  34.96,35.14,35.33,35.51,35.71,36.11,36.49,36.87,37.06,
  38,38.19,38.78,38.96,39.53,39.74,39.91,40.11,40.28,
  41.04,41.22,41.61,41.79,42.18,42.55,42.76,42.93,43.3,43.5,
  44.24,44.63,45.02,45.42,45.61,47.14,47.31,47.69,48.07,48.45,48.64,49.01,49.2,49.55,
  50.13,50.35,50.61,50.9,51.11,51.38,51.65,51.86,52.14,52.42,52.61,
  53.16,53.36,53.64,53.95,54.15,54.41,54.7,54.89,
  57.56,57.65,57.77,57.95,58.14,58.33,58.49,58.59,58.69,58.88,59.27,59.66,59.84,
  60.43,60.6,60.78,60.98,61.37,61.55,61.93,62.3,62.69,62.88,63.06,63.64,63.82,64.02,64.42,64.59,64.97,65.34,65.73,65.91,66.27,
  66.87,67.06,67.25,67.64,68.01,68.4,68.77,68.96,
  69.68,70.08,70.46,70.64,71.04,
  72.59,72.79,72.95,73.13,73.32,73.5,73.7,74.11,74.48,74.84,75.03,75.22,
  75.78,75.97,76.17,76.56,76.75,77.14,77.5,77.87,78.05,78.43,
  79.02,79.21,79.39,79.77,80.15,80.52,80.9,81.08,81.48,
  82.04,82.21,82.6,82.99,83.37,83.76,84.54,84.92,85.09,
  101.81,102,102.59,102.77,103.14,103.32,103.53,103.71,103.9,104.09,
  104.69,104.85,105.05,105.22,105.43,105.61,105.99,106.38,106.76,106.94,
  107.9,108.07,108.45,108.63,108.83,109.42,109.61,109.79,109.99,110.17,
  110.73,110.9,111.11,111.28,111.48,111.67,112.05,112.43,112.81,113.2,113.39,
  113.96,114.16,114.52,114.9,115.3,115.47,117,117.15,117.55,117.94,118.33,118.52,118.89,119.07,119.43,
  120.02,120.23,120.48,120.77,120.99,121.27,121.53,121.76,122.02,122.3,122.51,
  123.06,123.26,123.51,123.8,124.02,124.28,124.57,124.78,
  127.44,127.51,127.62,127.81,128.02,128.21,128.36,128.45,128.56,128.76,129.16,129.52,129.72,
  130.26,130.45,130.61,130.81,131.19,131.39,131.79,132.16,132.54,132.73,132.81,132.91,
  133.5,133.68,133.89,134.28,134.46,134.83,135.21,135.6,135.79,135.97,136.17,
  136.76,136.94,137.13,137.51,137.89,138.27,138.65,138.83,
  139.59,139.95,140.32,140.51,140.89,
  142.42,142.61,142.8,143.01,143.39,143.56,143.95,144.12,144.31,144.71,144.89,145.07,
  145.63,145.81,146.04,146.43,146.62,146.98,147.37,147.75,147.95,148.31,
  148.89,149.09,149.27,149.67,150.03,150.4,150.78,150.98,151.37,
  151.95,152.13,152.49,152.87,153.23,153.62,153.78,154.39,154.78,154.97,
  182.12,182.2,182.32,182.51,182.69,182.89,183.06,183.15,183.28,183.46,183.84,184.21,184.4,
  184.97,185.16,185.33,185.54,185.91,186.1,186.48,186.86,187.24,187.43,187.51,187.62,
  188.18,188.37,188.59,188.95,189.15,189.54,189.92,190.29,190.48,190.66,190.86,
  191.42,191.6,191.8,192.18,192.57,192.93,193.31,193.5,
  194.28,194.64,195.02,195.2,195.59,
  197.12,197.32,197.5,197.69,198.07,198.28,198.63,198.83,199.02,199.4,199.57,199.77,
  200.34,200.52,200.71,201.11,201.3,201.66,202.03,202.41,202.6,202.99,203.59,203.77,203.98,204.35,204.73,205.1,
  205.97,206.04,206.38,206.76,206.93,207.16,207.34,207.43,207.54,207.73,208.13,208.49,208.68,
  209.27,209.46,209.64,209.85,210.23,210.41,210.8,211.18,211.56,211.75,211.93,212.49,212.68,212.9,213.29,213.47,213.85,214.24,214.6,214.79,215.17,
  215.73,215.92,216.12,216.49,216.85,217.24,217.63,217.82,
  218.6,218.96,219.34,219.52,219.91,
  221.44,221.61,221.79,221.99,222.17,222.36,222.56,222.95,223.32,223.71,223.9,224.09,
  224.66,224.84,225.05,225.45,225.63,226,226.4,226.77,226.95,227.33,
  227.91,228.09,228.27,228.63,229.01,229.39,229.76,229.95,230.36,
  230.95,231.12,231.5,231.86,232.23,232.62,233.38,233.75,233.95,
  237.39,237.55,237.73,237.95,238.1,238.31,238.51,
  240.4,240.57,240.77,240.96,241.17,241.35,241.53,241.91,242.11,242.3,
  243.45,243.63,243.82,244.01,244.2,244.41,244.58,
  246.48,246.66,246.86,247.04,247.23,247.41,247.58,248.58,249.33
]										

var shiningstar_demo=new Array()
shiningstar_demo=[
  't','t','k','s','n','y','r','r','t',
'n','n','m','k','w','k','a','s','n',
't','t','k','m','w','n','k','m','t',
's','k','s','n','m','a','a','y','n',
't','r','s','m','n','n','k','s','r',
's','m','a','w','k','k','a','t','r',
't','t','s','r','t','k','n','k','t',
'n','y','m','n','h','m','a','y','m','t',
's','s','n','m','n','a','t','n','a','y','s','r','t','k',
'k','s','k','w','h','k','h','k','s','n','n',
't','k','w','t','s','k','m','t',
's','y','a','n','w','k','s','t','w','t','t','r','h',
'y','m','n','n','m','r','m','h','r','s','k','t','n','h','r','n','h','r','s','s','k',
'a','r','t','n','s','k','a','h',
'a','h','a','m','s',
'h','t','s','n','a','m','t','n','m','k','a','t',
'm','h','t','n','a','r','n','a','t','r',
'h','t','s','s','k','n','h','k','r',
't','k','m','k','w','k','w','s','t',
'a','n','t','k','h','r','r','s','h','t',
's','a','w','s','t','a','r','y','a','n',
'a','m','a','k','r','y','r','k','h','w',
'w','s','r','t','s','m','w','n','a','y','a',
't','k','n','h','k','r','k','k','s','k','m','h','y','r','k',
's','y','a','n','t','h','s','h','a','m','m',
'a','a','s','r','w','k','k','r',
's','y','a','n','w','k','s','t','w','t','t','r','h',
'm','k','w','n','a','m','s','n','w','s','y','w',
'm','h','a','k','t','k','a','r','y','a','n',
's','k','a','k','h','r','k','r',
'a','h','a','m','s',
'a','m','m','h','r','t','n','r','a','m','a','y',
's','t','n','s','y','t','k','m','k','k',
'k','k','r','n','m','w','n','k','t',
'a','t','a','m','r','t','a','n','n','r',
's','y','a','n','w','k','s','t','w','t','t','r','h',
'm','k','w','n','a','m','s','n','w','s','y','w',
'm','h','a','k','t','k','a','r','y','a','n',
's','k','a','k','h','r','k','r',
'a','h','a','m','s',
'a','m','m','h','r','t','n','r','a','m','a','y',
's','t','n','s','y','t','k','m','k','k','k','k','y','k','t','s',
's','y','a','n','w','k','s','t','w','t','t','r','h',
'y','m','n','n','m','r','m','h','r','s','k','t','n','h','r','n','h','r','s','s','k',
'a','r','t','n','s','k','a','h',
'a','h','a','m','s',
'h','t','s','n','a','m','t','n','m','k','a','t',
'm','h','t','n','a','r','n','a','t','r',
'h','t','s','s','k','n','h','k','r',
't','k','m','k','w','k','w','s','t',
'r','r','r','r','r','r','r',
'r','r','r','r','r','r','r','r','r','r',
'r','r','r','r','r','r','r',
'r','r','r','r','r','r','r','r','r'
]

var ichinenniichidonoichigofestival=new Array()
ichinenniichidonoichigofestival['1']=[1.3,'(前奏)','',16.75,0.3,14.63]
ichinenniichidonoichigofestival['17']=[18.05,'水曜日限定 二層のショートケーキ','すいようひけんていにそうのしよーとけーき',7.21,0.3]
ichinenniichidonoichigofestival['24']=[25.26,'駅前曲がり角 ピンク色シュークリーム','えきまえまかりかとひんくいろしゆーくりーむ',7.23,0.3]
ichinenniichidonoichigofestival['32']=[32.49,'相性ばっちりのさくさくミルフィーユ','あいしようはつちりのさくさくみるふいーゆ',7.25,0.3]
ichinenniichidonoichigofestival['39']=[39.74,'ソースひとつ落とせば 色付く白いPlate','そーすひとつおとせはいろつくしろいふれーと',6.28,0.3]
ichinenniichidonoichigofestival['45']=[46.02,'初めて出会った日から運命だと感じて','はしめててあつたひからうんめいたとかんして',7.64,0.3]
ichinenniichidonoichigofestival['53']=[53.66,'毎日増えるレパートリー いちご!いちえ! Foo♡♥','まいにちふえるれはーとりーいちこいちえふ',6.76,0.3]
ichinenniichidonoichigofestival['60']=[60.42,'とろけるような恋の味 あまくすっぱく','とろけるようなこいのあしあまくすつはく',7.28,0.3]
ichinenniichidonoichigofestival['67']=[67.7,'心弾むfestivalは 期間限定なの?','こころはすむふえすていはるはきかんけいていなの',7.19,0.3]
ichinenniichidonoichigofestival['74']=[74.89,'寂しがる私のこと 慰めてくれる','さひしかるわたしのことなくさめてくれる',6.53,0.3]
ichinenniichidonoichigofestival['81']=[81.42,'来年も会えるからって でも（ダメ!）','らいねんもあえるからつてても',4.85,0.3]
ichinenniichidonoichigofestival['85']=[86.27,'今年は明日まで!','ことしはあしたまて',4.13,0.3]
ichinenniichidonoichigofestival['90']=[90.4,'はー…','はー',0.95,0.3]
ichinenniichidonoichigofestival['91']=[91.35,'今週も疲れたな～','こんしゆうもつかれたな',2.2,0.3]
ichinenniichidonoichigofestival['93']=[93.55,'はっ、今日はトリプルアイス30%オフの日ではないか！','はつきようはとりふるあいすさんしゆつはーせんとおふのひてはないか',5.11,0.3]
ichinenniichidonoichigofestival['98']=[98.66,'（いっつも選ぶの）結構迷っちゃうんだよね～','けつこうまよつちやうんたよね',1.84,0.3]
ichinenniichidonoichigofestival['100']=[100.5,'（いらっしゃいませ～）あっすいません','あつすいません',1.49,0.3]
ichinenniichidonoichigofestival['101']=[101.99,'（えっと）カップのトリプルで…','かつふのとりふるて',1.86,0.3]
ichinenniichidonoichigofestival['103']=[103.85,'（あ、お持ち帰りで）','',0.74,0.3]
ichinenniichidonoichigofestival['104']=[104.59,'一段目が…','いちたんめか',1.34,0.3]
ichinenniichidonoichigofestival['105']=[105.93,'えー…','えー',1.02,0.3]
ichinenniichidonoichigofestival['106']=[106.95,'ストロベリー＆ストロベリー','すとろへりーあんとすとろへりー',2.05,0.3]
ichinenniichidonoichigofestival['108']=[109,'（えっと、）二段目がスペシャルストロベリーで','にたんめかすへしやるすとろへりーて',2.83,0.3]
ichinenniichidonoichigofestival['111']=[111.83,'三段目が超ウルトラプレミアムストロベリーで','さんたんめかちよううるとらふれみあうすとろへりーて',3.91,0.3]
ichinenniichidonoichigofestival['115']=[115.74,'これと同じものをあと三つお願いします','これとおなしものをあとみつつおねかいします',7.26,0.3]
ichinenniichidonoichigofestival['122']=[123,'end','',0,0.3]





var ichinenniichidonoichigofestival_s=new Array()
ichinenniichidonoichigofestival_s=[
  18.35,18.58,18.83,19.05,19.3,19.49,19.93,20.16,20.38,21.26,21.5,21.73,21.95,22.19,22.29,22.4,22.64,22.85,23.06,24,
  25.56,25.77,26.04,26.51,26.71,27.14,27.37,27.59,27.83,28.28,28.48,28.72,29.17,29.39,30.32,30.45,30.54,30.76,30.97,31.2,31.64,
  32.79,33.01,33.26,33.37,33.48,33.7,33.93,34.38,34.6,34.83,35.71,35.94,36.15,36.38,36.62,37.07,37.3,37.55,37.75,38.43,
  40.04,40.24,40.44,40.91,41.12,41.36,41.58,41.81,42.04,42.28,42.95,43.16,43.6,43.82,44.73,44.94,45.18,45.41,45.63,45.85,46.11,
  46.32,46.77,47.44,47.66,48.1,48.32,48.55,49.24,49.72,49.94,50.15,50.61,50.84,51.05,51.29,51.51,51.95,52.83,53.05,53.25,53.49,
  53.96,54.67,54.89,55.09,55.35,55.58,55.99,56.49,56.7,56.93,57.15,57.37,57.6,57.81,58.04,58.26,58.5,58.72,59.17,60.03,
  60.72,60.96,61.21,61.86,62.54,62.64,62.76,63.69,63.92,64.13,64.37,64.59,65.05,65.26,65.47,65.94,66.17,66.41,67.08,
  68,68.18,68.43,69.1,69.78,70,70.45,70.54,70.66,70.91,71.01,71.13,71.35,71.58,72.27,72.49,72.7,73.16,73.4,73.61,73.82,74.05,74.52,
  75.19,75.62,76.29,76.98,77.2,77.65,77.89,78.09,78.33,78.56,78.79,78.99,79.47,79.7,79.93,80.4,80.64,80.86,81.26,
  81.72,82.19,82.42,82.64,83.07,83.31,83.53,83.77,84.01,84.13,84.22,84.45,85.31,85.54,
  86.57,87.15,87.83,88.04,88.49,88.94,89.17,89.62,90.07,
  90.7,90.9,
  91.65,91.87,91.97,92.08,92.2,92.32,92.45,92.52,92.69,92.91,93.28,
  93.85,94.02,94.4,94.49,94.56,94.67,94.95,95.07,95.17,95.3,95.42,95.56,95.67,95.92,96.07,96.18,96.28,96.35,96.45,96.56,96.71,96.79,96.9,96.99,97.11,97.24,97.38,97.51,97.65,97.76,97.88,97.99,
  98.96,99.08,99.19,99.32,99.47,99.57,99.66,99.78,99.85,99.97,100.06,100.16,100.25,100.37,
  100.8,100.91,101.26,101.4,101.53,101.66,101.74,
  102.29,102.44,102.57,102.73,102.95,103.13,103.25,103.39,103.52,
  104.89,105.04,105.16,105.29,105.4,105.56,
  106.23,106.44,
  107.25,107.35,107.44,107.56,107.66,107.79,107.88,107.99,108.09,108.21,108.31,108.43,108.53,108.63,108.74,
  109.3,109.43,109.61,109.75,109.94,110.47,110.61,110.7,110.82,110.91,111.02,111.13,111.25,111.35,111.49,111.58,111.7,
  112.13,112.29,112.44,112.56,112.7,112.87,113.36,113.49,113.59,113.71,113.82,113.94,114.03,114.14,114.25,114.37,114.48,114.63,114.74,114.86,114.97,115.1,115.2,115.31,115.42,
  116.04,116.17,116.28,116.39,116.48,116.59,116.69,116.78,116.89,117.1,117.23,117.33,117.42,117.54,117.66,117.77,117.87,117.98,118.09,118.19,118.3
  ]

var ichinenniichidonoichigofestival_demo=new Array()
ichinenniichidonoichigofestival_demo=[
  's','a','y','a','h','k','w','t','a','n','s','a','n','s','y','w','t','k','w','k',
  'a','k','m','a','m','k','r','k','t','h','w','k','a','r','s','y','w','k','r','w','m',
  'a','a','s','y','a','h','t','t','r','n','s','k','s','k','m','r','h','a','w','y',
  's','w','s','h','t','t','a','t','s','h','a','r','t','k','s','r','a','h','r','w','t',
  'h','s','m','t','t','a','t','t','h','k','r','a','w','m','a','t','t','k','w','s','t',
  'm','a','n','t','h','a','r','r','h','w','t','r','w','a','t','k','a','t','a','h',
  't','r','k','r','y','a','n','k','a','n','a','s','a','m','k','s','t','h','k',
  'k','k','r','h','s','m','h','a','s','t','a','h','r','h','k','k','w','k','a','t','a','n','n',
  's','h','s','k','r','w','t','s','n','k','t','n','k','s','m','t','k','r','r',
  'r','a','n','w','m','a','a','r','k','r','t','t','t','m',
  'k','t','s','h','a','s','t','m','t',
  'h','w',
  'k','w','s','y','a','m','t','k','r','t','n',
  'h','t','k','y','a','h','t','r','h','r','a','a','s','s','w','s','y','t','h','w','s','w','t','a','h','n','h','t','h','n','a','k',
  'k','t','k','a','m','y','t','t','y','a','w','t','y','n',
  'a','t','s','a','m','s','w',
  'k','t','h','n','t','r','h','r','t',
  'a','t','t','w','m','k',
  'a','w',
  's','t','r','h','r','w','a','w','t','s','t','r','h','r','w',
  'n','t','w','m','k','s','h','s','y','r','s','t','r','h','r','w','t',
  's','w','t','w','m','k','t','y','a','a','r','t','r','h','r','m','a','a','s','t','r','h','r','w','t',
  'k','r','t','a','n','s','m','n','w','a','t','m','t','t','a','n','k','a','s','m','s'
  
]

var aimaitrip=new Array()
aimaitrip['1']=[1.3,'(前奏)','',13.51,0.3,11.16]
aimaitrip['14']=[14.81,'繋ぎ止めてたのは現実感','つなきとめてたのはけんしつかん',1.83,0.5]
aimaitrip['16']=[16.64,'今を生きる堅実さ','いまをいきるけんしつさ',1.94,0.4]
aimaitrip['18']=[18.58,'腰に巻いたロープは喪失感のハサミで切れていった','こしにまいたろーふはそうしつかんのはさみてきれていつた',3.79,0.5]
aimaitrip['22']=[22.37,'自宅を囲む私服警察官','したくをかこむしふくけいさつかん',1.86,0.5]
aimaitrip['23']=[24.23,'華麗すぎる併殺打','かれいすきるへいさつた',1.95,0.4]
aimaitrip['25']=[26.18,'記憶も曖昧なる前日譚に紡がれた旋律は','きおくもあいまいなるせんしつたんにつむかれたせんりつは',3.85,0.5]
aimaitrip['29']=[30.03,'心の奥に眠った さらり溶ける君の歌','こころのおくにねむつたさらりとけるきみのうた',7.58,0.3]
aimaitrip['37']=[37.61,'明日と今の波間に揺れて旅立つのさ','あすといまのなみまにゆれてたひたつのさ',7.84,0.3]
aimaitrip['45']=[45.45,'甘いシュガーに君のくれた','あまいしゆかーにきみのくれた',3.62,0.3]
aimaitrip['48']=[49.07,'魔法をかけたら大体ホリック','まほうをかけたらたいたいほりつく',4.02,0.3]
aimaitrip['52']=[53.09,'ほらいつまでも夢の中','ほらいつまてもゆめのなか',3.56,0.3]
aimaitrip['56']=[56.65,'続きを見たいのさ 曖昧トリップ','つつきをみたいのさあいまいとりつふ',6.96,0.3]
aimaitrip['63']=[63.91,'（間奏）','',12.1,0.3,73.21]
aimaitrip['75']=[75.71,'未だ書き残してく逃亡録','いまたかきのこしてくとうほうろく',1.9,0.5]
aimaitrip['77']=[77.61,'あるいは妄想語録','あるいはもうそうころく',1.88,0.4]
aimaitrip['79']=[79.49,'枯渇感こそ僕の原動力','こかつかんこそほくのけんとうりよく',1.91,0.5]
aimaitrip['81']=[81.4,'脚はまだ動く老木','あしはまたうこくろうほく',1.95,0.4]
aimaitrip['83']=[83.35,'行くあてなどないが目指している','いくあてなとないかめさしている',1.86,0.5]
aimaitrip['84']=[85.21,'さながらフェアリーテイル','さなからふえありーている',1.91,0.4]
aimaitrip['86']=[87.12,'何がリアルだってわかっているつもりでも迷っている','なにかりあるたつてわかつているつもりてもまよつている',3.82,0.5]
aimaitrip['90']=[90.94,'いつの間にかしまった白紙の地図に今更','いつのまにかしまつたはくしのちすにいまさら',7.68,0.3]
aimaitrip['98']=[98.62,'震えるペンを走らせて　さあ旅立つのさ','ふるえるへんをはしらせてさあたひたつのさ',8.9,0.3]
aimaitrip['107']=[107.82,'（間奏）','',14.19,0.3,119.21]
aimaitrip['121']=[121.71,'甘いシュガーに君のくれた','あまいしゆかーにきみのくれた',3.53,0.3]
aimaitrip['124']=[125.24,'魔法をかけたら大体ホリック','まほうをかけたらたいたいほりつく',4.04,0.3]
aimaitrip['128']=[129.28,'ほらいつまでも夢の中','ほらいつまてもゆめのなか',3.58,0.3]
aimaitrip['132']=[132.86,'続きを見たいのさ 曖昧トリップ','つつきをみたいのさあいまいとりつふ',5.92,0.3]
aimaitrip['138']=[139.08,'（間奏）','',13.38,0.3,149.66]
aimaitrip['151']=[152.16,'甘いシュガーに君のくれた','あまいしゆかーにきみのくれた',3.52,0.3]
aimaitrip['155']=[155.68,'魔法をかけたら大体ホリック','まほうをかけたらたいたいほりつく',4.08,0.3]
aimaitrip['159']=[159.76,'ほらいつまでも夢の中','ほらいつまてもゆめのなか',3.55,0.3]
aimaitrip['163']=[163.31,'続きを見たいのさ 曖昧トリップ','つつきをみたいのさあいまいとりつふ',4.96,0.3]
aimaitrip['167']=[168.27,'end','',0,0.6]




var aimaitrip_s=new Array()
aimaitrip_s=[
  15.11,15.22,15.34,15.45,15.55,15.68,15.78,16.02,16.12,16.25,16.36,16.48,16.56,16.68,16.79,
  16.94,17.04,17.15,17.27,17.4,17.5,17.65,17.77,17.89,18,18.11,
  18.88,19,19.11,19.24,19.34,19.47,19.57,19.7,19.8,19.93,20.04,20.18,20.28,20.41,20.51,20.77,20.88,21,21.1,21.22,21.33,21.46,21.56,21.69,21.8,21.91,22.02,
  22.67,22.78,22.89,22.99,23.11,23.23,23.35,23.46,23.57,23.7,23.81,23.93,24.05,24.17,24.28,24.4,
  24.53,24.65,24.78,24.89,25.02,25.13,25.25,25.37,25.49,25.59,25.73,
  26.48,26.58,26.7,26.82,26.93,27.04,27.16,27.28,27.4,27.51,27.63,27.76,27.87,28,28.12,28.25,28.36,28.48,28.61,28.73,28.86,28.97,29.08,29.21,29.31,29.42,29.54,
  30.33,30.56,31.03,31.49,31.73,31.96,32.2,32.44,32.91,33.13,33.36,34.12,34.34,34.83,35.04,35.29,35.53,35.76,36.01,36.24,36.71,37.19,
  37.91,38.14,38.59,39.07,39.29,39.56,39.76,40.03,40.51,40.77,40.99,41.47,41.91,42.65,42.89,43.13,43.37,43.6,43.83,
  45.75,45.98,46.23,46.48,46.56,46.7,46.93,47.18,47.4,47.65,47.89,48.15,48.26,48.48,
  49.37,49.58,49.81,50.03,50.3,50.52,50.99,51.23,51.47,51.57,51.7,51.82,51.94,52.06,52.17,52.29,
  53.39,53.6,53.85,54.09,54.33,54.82,55.05,55.29,55.52,55.77,55.87,56.09,
  56.95,57.18,57.4,57.64,57.89,58.13,58.37,58.61,58.83,59.09,59.19,59.32,59.45,59.57,59.67,59.79,59.91,
  76.01,76.13,76.24,76.36,76.48,76.59,76.71,76.81,76.93,77.05,77.17,77.28,77.4,77.51,77.62,77.75,
  77.91,78.02,78.13,78.26,78.36,78.48,78.6,78.71,78.83,79.08,79.17,
  79.79,79.89,80,80.12,80.23,80.34,80.46,80.58,80.69,80.83,80.94,81.06,81.18,81.3,81.43,81.5,81.58,
  81.7,81.8,81.93,82.06,82.17,82.3,82.41,82.53,82.65,82.77,82.88,82.99,
  83.65,83.75,83.87,83.99,84.1,84.23,84.33,84.44,84.56,84.68,84.8,84.91,85.03,85.15,85.27,
  85.51,85.63,85.74,85.86,85.96,86.06,86.13,86.25,86.34,86.46,86.56,86.7,
  87.42,87.53,87.64,87.76,87.87,88,88.11,88.22,88.34,88.47,88.58,88.69,88.82,88.95,89.06,89.34,89.45,89.58,89.69,89.8,89.92,90.02,90.14,90.26,90.37,90.48,
  91.24,91.47,91.95,92.42,92.65,92.89,93.16,93.39,93.86,94.36,95.1,95.32,95.78,96.01,96.25,96.47,96.73,96.98,97.21,97.7,98.17,
  98.92,99.13,99.58,100.09,100.3,100.55,100.77,101.02,101.49,101.71,101.96,102.42,102.9,103.15,103.61,103.83,104.08,104.33,104.56,104.82,
  122.01,122.22,122.47,122.7,122.8,122.92,123.14,123.38,123.61,123.85,124.1,124.33,124.46,124.68,
  125.54,125.77,126.02,126.23,126.47,126.71,127.19,127.43,127.67,127.76,127.9,128.03,128.14,128.26,128.38,128.5,
  129.58,129.8,130.06,130.27,130.51,130.99,131.23,131.45,131.7,131.94,132.03,132.29,
  133.16,133.39,133.61,133.84,134.07,134.32,134.55,134.79,135.04,135.28,135.38,135.5,135.62,135.74,135.83,135.96,136.08,
  152.46,152.68,152.9,153.13,153.23,153.35,153.6,153.84,154.08,154.31,154.56,154.79,154.9,155.13,
  155.98,156.22,156.44,156.68,156.92,157.16,157.66,157.89,158.15,158.25,158.38,158.49,158.61,158.71,158.83,158.95,
  160.06,160.29,160.52,160.75,161,161.48,161.72,161.95,162.19,162.43,162.54,162.79,
  163.61,163.84,164.09,164.33,164.55,164.8,165.02,165.28,165.52,165.78,165.9,166.01,166.13,166.24,166.36,166.45,166.57
  
]

var aimaitrip_demo=new Array()
aimaitrip_demo=[
  't','n','k','t','m','t','t','n','h','k','w','s','t','k','w',
'a','m','w','a','k','r','k','w','s','t','s',
'k','s','n','m','a','t','r','w','h','h','s','a','s','t','k','w','n','h','s','m','t','k','r','t','a','t','t',
's','t','k','w','k','k','m','s','h','k','k','a','s','t','k','w',
'k','r','a','s','k','r','h','a','s','t','t',
'k','a','k','m','a','a','m','a','n','r','s','w','s','t','t','w','n','t','m','k','r','t','s','w','r','t','h',
'k','k','r','n','a','k','n','n','m','t','t','s','r','r','t','k','r','k','m','n','a','t',
'a','s','t','a','m','n','n','m','m','n','y','r','t','t','h','t','t','n','s',
'a','m','a','s','y','k','w','n','k','m','n','k','r','t',
'm','h','a','w','k','k','t','r','t','a','t','a','h','r','t','k',
'h','r','a','t','m','t','m','y','m','n','n','k',
't','t','k','w','m','t','a','n','s','a','a','m','a','t','r','t','h',
'a','m','t','k','k','n','k','s','t','k','t','a','h','a','r','k',
'a','r','a','h','m','a','s','a','k','r','k',
'k','k','t','k','w','k','s','h','k','n','k','w','t','a','r','y','k',
'a','s','h','m','t','a','k','k','r','a','h','k',
'a','k','a','t','n','t','n','a','k','m','s','s','t','a','r',
's','n','k','r','h','a','a','r','w','t','a','r',
'n','n','k','r','a','r','t','t','t','w','k','t','t','a','r','t','m','r','t','m','m','y','t','t','a','r',
'a','t','n','m','n','k','s','m','t','t','h','k','s','n','t','s','n','a','m','s','r',
'h','r','a','r','h','w','w','h','s','r','s','t','s','a','t','h','t','t','n','s',
'a','m','a','s','y','k','w','n','k','m','n','k','r','t',
'm','h','a','w','k','k','t','r','t','a','t','a','h','r','t','k',
'h','r','a','t','m','t','m','y','m','n','n','k',
't','t','k','w','m','t','a','n','s','a','a','m','a','t','r','t','h',
'a','m','a','s','y','k','w','n','k','m','n','k','r','t',
'm','h','a','w','k','k','t','r','t','a','t','a','h','r','t','k',
'h','r','a','t','m','t','m','y','m','n','n','k',
't','t','k','w','m','t','a','n','s','a','a','m','a','t','r','t','h'
]

var aimaitrip_easy=new Array()
aimaitrip_easy['1']=[1.3,'(前奏)','',13.49,0.3,11.16]
aimaitrip_easy['14']=[14.79,'繋ぎ止めてたのは現実感','つけ',1.84,0.3]
aimaitrip_easy['16']=[16.63,'今を生きる堅実さ','いけ',1.91,0.3]
aimaitrip_easy['18']=[18.54,'腰に巻いたロープは喪失感のハサミで切れていった','こそはき',3.81,0.3]
aimaitrip_easy['22']=[22.35,'自宅を囲む私服警察官','しし',1.9,0.3]
aimaitrip_easy['23']=[24.25,'華麗すぎる併殺打','かへ',1.92,0.3]
aimaitrip_easy['25']=[26.17,'記憶も曖昧なる前日譚に紡がれた旋律は','きせつせ',3.83,0.3]
aimaitrip_easy['29']=[30,'心の奥に眠った さらり溶ける君の歌','こおねさときう',7.58,0.3]
aimaitrip_easy['37']=[37.58,'明日と今の波間に揺れて旅立つのさ','あいなゆた',7.88,0.3]
aimaitrip_easy['45']=[45.46,'甘いシュガーに君のくれた','あしきく',3.56,0.3]
aimaitrip_easy['48']=[49.02,'魔法をかけたら大体ホリック','まかたほ',4.05,0.3]
aimaitrip_easy['52']=[53.07,'ほらいつまでも夢の中','ほまゆの',3.58,0.3]
aimaitrip_easy['56']=[56.65,'続きを見たいのさ 曖昧トリップ','つみあと',5.96,0.3]
aimaitrip_easy['63']=[63.91,'（間奏）','',13.1,0.3,73.21]
aimaitrip_easy['75']=[75.71,'未だ書き残してく逃亡録','いと',1.88,0.3]
aimaitrip_easy['77']=[77.59,'あるいは妄想語録','あも',1.91,0.3]
aimaitrip_easy['79']=[79.5,'枯渇感こそ僕の原動力','こほ',1.88,0.3]
aimaitrip_easy['81']=[81.38,'脚はまだ動く老木','あろ',1.95,0.3]
aimaitrip_easy['83']=[83.33,'行くあてなどないが目指している','いめ',1.9,0.3]
aimaitrip_easy['84']=[85.23,'さながらフェアリーテイル','さふ',1.92,0.3]
aimaitrip_easy['86']=[87.15,'何がリアルだってわかっているつもりでも迷っている','なわつま',3.84,0.3]
aimaitrip_easy['90']=[90.99,'いつの間にかしまった白紙の地図に今更','いましはちいら',7.59,0.3]
aimaitrip_easy['98']=[98.58,'震えるペンを走らせて　さあ旅立つのさ','ふへはさた',7.94,0.3]
aimaitrip_easy['107']=[107.82,'（間奏）','',15.17,0.3,119.19]
aimaitrip_easy['121']=[121.69,'甘いシュガーに君のくれた','あしきく',3.55,0.3]
aimaitrip_easy['124']=[125.24,'魔法をかけたら大体ホリック','まかたほ',4,0.3]
aimaitrip_easy['128']=[129.24,'ほらいつまでも夢の中','ほまゆの',3.61,0.3]
aimaitrip_easy['132']=[132.85,'続きを見たいのさ 曖昧トリップ','つみあと',4.93,0.3]
aimaitrip_easy['138']=[139.08,'（間奏）','',14.36,0.3,149.64]
aimaitrip_easy['151']=[152.14,'甘いシュガーに君のくれた','あしきく',3.57,0.3]
aimaitrip_easy['155']=[155.71,'魔法をかけたら大体ホリック','まかたほ',4.01,0.3]
aimaitrip_easy['159']=[159.72,'ほらいつまでも夢の中','ほまゆの',3.61,0.3]
aimaitrip_easy['163']=[163.33,'続きを見たいのさ 曖昧トリップ','つみあと',4.94,0.3]
aimaitrip_easy['167']=[168.27,'end','',0,0.6]



var aimaitrip_easy_s=new Array()
aimaitrip_easy_s=[
  15.09,16.21,
  16.93,17.65,
  18.84,20.02,20.75,21.3,
  22.65,23.49,
  24.55,25.25,
  26.47,27.63,28.43,29.05,
  30.3,31.7,32.42,34.07,35.03,35.77,36.69,
  37.88,39.08,39.83,40.98,42.64,
  45.76,46.47,47.41,48.11,
  49.32,50.3,51.46,51.94,
  53.37,54.31,55.27,55.74,
  56.95,57.92,59.07,59.54,
  76.01,77.16,
  77.89,78.34,
  79.8,80.56,
  81.68,82.61,
  83.63,84.64,
  85.53,86.01,
  87.45,88.4,89.33,89.97,
  91.29,92.44,93.17,95.06,96.22,96.97,98.14,
  98.88,100.29,100.97,102.9,103.61,
  121.99,122.7,123.62,124.32,
  125.54,126.46,127.65,128.12,
  129.54,130.54,131.47,131.94,
  133.15,134.09,135.27,135.74,
  152.44,153.17,154.1,154.8,
  156.01,156.95,158.15,158.61,
  160.02,160.98,161.95,162.41,
  163.63,164.56,165.76,166.21
  
]

var aimaitrip_easy_demo=new Array()
aimaitrip_easy_demo=[
  't','k',
  'a','k',
  'k','s','h','k',
  's','s',
  'k','h',
  'k','s','t','s',
  'k','a','n','s','t','k','a',
  'a','a','n','y','t',
  'a','s','k','k',
  'm','k','t','h',
  'h','m','y','n',
  't','m','a','t',
  'a','t',
  'a','m',
  'k','h',
  'a','r',
  'a','m',
  's','h',
  'n','w','t','m',
  'a','m','s','h','t','a','r',
  'h','h','h','s','t',  
  'a','s','k','k',
  'm','k','t','h',
  'h','m','y','n',
  't','m','a','t',  
  'a','s','k','k',
  'm','k','t','h',
  'h','m','y','n',
  't','m','a','t'
]

